[
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Struct: ServiceContext] [Integer Overflow] Can processor_task_count be set to u16::MAX (65535), causing integer overflow when multiplied with processor_batch_size during batch allocation in downstream modules, potentially leading to memory exhaustion or incorrect transaction processing? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Struct: ServiceContext] [Integer Overflow] Can processor_batch_size be set to u16::MAX, and when combined with processor_task_count, cause arithmetic overflow in total transaction calculations (task_count * batch_size), leading to undersized buffers and data corruption? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Struct: ServiceContext] [Resource Exhaustion] Can output_batch_size be set to u16::MAX without validation, causing the indexer to attempt sending 65535 transactions in a single gRPC message, exceeding MESSAGE_SIZE_LIMIT and causing service crashes or DoS? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Struct: ServiceContext] [Configuration Bypass] Are processor_task_count, processor_batch_size, and output_batch_size validated before ServiceContext construction, or can zero values be passed causing division-by-zero errors or infinite loops in processing logic? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Struct: ServiceContext] [Memory Exhaustion] Can processor_task_count * processor_batch_size exceed safe memory limits (e.g., 65535 * 65535 = 4.2 billion transactions), causing the indexer to allocate excessive memory and crash the fullnode? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Field: context] [Race Condition] Since context is wrapped in Arc<Context> and shared across multiple threads/tasks, can concurrent access to the underlying db or indexer_reader cause race conditions leading to inconsistent transaction data being served to clients? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Field: context] [Data Race] Does the Arc<Context> properly protect against concurrent mutations when multiple gRPC streams access context.db.get_transactions() simultaneously, or can this lead to torn reads of transaction data? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Field: context] [State Inconsistency] If the underlying Context's chain_id or db is replaced during runtime reconfiguration while ServiceContext is being cloned, can this create ServiceContext instances with mismatched state (old chain_id, new db) causing transaction validation to fail incorrectly? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Field: context] [Use-After-Free] When ServiceContext is cloned and the original Context is dropped, does the Arc reference counting prevent use-after-free, or can reference count manipulation via Clone trait abuse lead to accessing freed Context memory? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Derive: Clone] [Resource Leak] Since ServiceContext derives Clone, can unbounded cloning of ServiceContext instances (each holding Arc<Context>) cause Arc reference count overflow (unlikely but theoretically possible with isize::MAX clones) leading to undefined behavior? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Derive: Clone] [State Confusion] When ServiceContext is cloned to create multiple gRPC stream handlers, do all clones share the same Arc<Context> and configuration values, or can modifications to u16 fields in one clone affect others, causing inconsistent batch sizes across streams? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Derive: Clone] [Memory Leak] If ServiceContext is cloned repeatedly for each incoming gRPC connection without proper cleanup, can this lead to Arc<Context> reference cycles or memory leaks when connections are dropped unexpectedly? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Derive: Debug] [Information Disclosure] Does the Debug implementation for ServiceContext expose sensitive information from Arc<Context> (such as database paths, internal state, or configuration secrets) in logs or error messages that could be exploited by attackers? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Derive: Debug] [Log Injection] Can the Debug output of ServiceContext be controlled by external input (via processor_task_count, processor_batch_size, or output_batch_size values), enabling log injection attacks or log forgery when these values are logged during errors? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Module: convert] [Access Control] Is the convert module properly encapsulated with appropriate visibility, or can external crates import and misuse conversion functions to create malformed protobuf transactions that bypass indexer validation? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Module: counters] [Metrics Manipulation] Are the counters module's metrics properly protected, or can malicious code increment/decrement counters to hide DoS attacks or transaction processing failures from monitoring systems? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Module: fullnode_data_service] [Service Bypass] Can external crates directly instantiate FullnodeDataService without going through proper ServiceContext initialization, bypassing critical validation or configuration constraints? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Module: localnet_data_service] [Environment Confusion] Is there proper separation between fullnode_data_service and localnet_data_service, or can production code accidentally use localnet_data_service leading to incorrect transaction serving or security bypasses? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Module: runtime] [Runtime Manipulation] Can the runtime module be accessed to modify or restart the indexer gRPC server without proper authorization, potentially causing service interruption or configuration tampering? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Module: stream_coordinator] [Coordinator Bypass] Can external code instantiate IndexerStreamCoordinator directly without ServiceContext, bypassing processor_task_count, processor_batch_size, and output_batch_size limits to cause resource exhaustion? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Field: processor_task_count] [Task Exhaustion] Can processor_task_count be set to 1, forcing sequential transaction processing and degrading indexer performance to the point where it cannot keep up with blockchain state, causing clients to receive stale data? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Field: processor_task_count] [Thread Pool Exhaustion] Can processor_task_count exceed the available thread pool size (tokio runtime worker count), causing task queue buildup, high latency, and eventual gRPC stream timeouts for all connected clients? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Field: processor_batch_size] [Batch Underflow] Can processor_batch_size be set to 1, causing excessive database round-trips and CPU overhead for transaction conversion, leading to indexer performance degradation and inability to serve historical transaction requests? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Field: processor_batch_size] [Database Overload] Can processor_batch_size be set to u16::MAX (65535), causing single database queries to fetch 65535 transactions at once, overwhelming the database connection pool and causing timeouts for all indexer operations? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-fullnode/src/lib.rs] [Field: output_batch_size] [Message Size Violation] Can output_batch_size be configured such that output_batch_size * average_transaction_size exceeds gRPC MESSAGE_SIZE_LIMIT (default 4MB), causing stream errors and forcing clients to disconnect and reconnect repeatedly? (Medium)"
]