[
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: SymbolVisitor::new()] [Logic error] At line 131-135, access specifiers are pre-marked as used. Can an attacker craft access specifiers that reference all function parameters, causing the checker to never flag unused parameters in security-critical validation functions? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: SymbolVisitor::new()] [Type confusion] At line 137, func.module_env.env is assumed to be a valid GlobalEnv. Can type system bypasses or unsafe code provide an invalid env, causing undefined behavior during symbol resolution? (High)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: SymbolVisitor::entry()] [Pattern matching exhaustion] The match at line 147 only handles specific ExpData variants (Block, Match, Lambda, Quant, Assign, LocalVar, Temporary). Can unhandled variants (Call, Pack, Select, etc.) in malicious ASTs bypass scope tracking, missing critical unused variables? (High)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: SymbolVisitor::entry()] [Stack overflow] The recursive visit pattern allows unlimited nesting. Can an attacker create ASTs with thousands of nested blocks at line 148-165 to cause stack overflow and compiler DoS? (High)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: SymbolVisitor::entry()] [Scope leak] At line 150 and 160, enter_scope() is called in BeforeBody, but exit_scope() is only called in Post. If the AST traversal is interrupted or throws an exception, can scopes remain unclosed causing permanent state corruption? (High)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: SymbolVisitor::entry()] [Index out of bounds] At line 168, arms[idx] accesses an array with an index from AfterMatchBody. Can corrupted or malicious ASTs provide out-of-bounds indices causing panic and compiler crash? (High)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: SymbolVisitor::entry()] [Logic error] At line 152-156, UnboundBlockVar usage kind is only set when opt_binding.is_none(). Can an attacker manipulate binding states to mark bound variables as unbound, bypassing critical unused variable checks in resource management code? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: SymbolVisitor::entry()] [Race condition] If entry() is called concurrently on the same visitor (which shouldn't happen but could via unsafe code), can simultaneous scope enter/exit operations at lines 150 and 160 cause data races in seen_uses? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: SymbolVisitor::entry()] [Pattern variable extraction] At line 157-159, pat.vars() extracts variables from patterns. Can malicious patterns with duplicate variable names cause the same symbol to be registered multiple times, corrupting usage tracking? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: SymbolVisitor::entry()] [Lambda scope handling] At line 177-189, lambda scope handling enters scope at Pre and exits at Post. Can nested lambdas with complex capture patterns cause scope stack underflow if the traversal order is non-standard? (High)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: SymbolVisitor::entry()] [Quantifier range handling] At line 190-207, quantifier ranges are processed. Can overlapping range variable names in nested quantifiers cause inner variables to be incorrectly marked as used when only outer variables are referenced? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: SymbolVisitor::entry()] [Assign pattern handling] At line 208-214, assignment patterns are processed. Can destructuring assignments with nested patterns cause some variables to be marked as used when they're actually unused, hiding bugs in coin transfer logic? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: SymbolVisitor::entry()] [LocalVar tracking] At line 215-219, LocalVar references are tracked. Can shadowed variables with the same symbol name cause the wrong variable to be marked as used, leading to false negatives in governance voting functions? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: SymbolVisitor::entry()] [Temporary index] At line 220-224, Temporary nodes reference parameters by index. Can this index be manipulated in malicious bytecode to reference wrong parameters, causing incorrect usage tracking? (High)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: SymbolVisitor::entry()] [Always returns true] Line 227 always returns true to continue traversal. Can this prevent early termination on errors, causing the compiler to waste resources analyzing known-broken code? (Low)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: check_symbol_usage()] [Symbol pool corruption] At line 231-232, symbol_pool is accessed from env. Can concurrent modifications to the symbol pool during parallel compilation cause make() to return incorrect symbols, breaking the receiver_param_name check? (High)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: check_symbol_usage()] [Unicode handling] At line 233, symbol_starts_with_underscore() checks for underscore prefix. Can Unicode confusables or zero-width characters bypass this check, allowing malicious code with 'unused' variables that are actually used via string manipulation? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: check_symbol_usage()] [Logic bypass] At line 234, seen_uses.contains(sym) checks if symbol was used. Can an attacker pre-populate seen_uses through access specifiers at initialization time to mark all parameters as used, bypassing unused parameter detection? (High)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: check_symbol_usage()] [Special case bypass] At line 236, the 'self' receiver parameter is exempted. Can an attacker name regular parameters 'self' in non-receiver positions to bypass unused parameter checks in authorization functions? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: check_symbol_usage()] [Condition complexity] The complex boolean condition at line 233-237 has multiple clauses. Can the short-circuit evaluation order cause some checks to be skipped, missing unused variables in specific edge cases like inline functions with unbound block vars? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: check_symbol_usage()] [String formatting] At line 239-244, format!() constructs the warning message. Can extremely long symbol names cause buffer overflows or memory exhaustion when formatting error messages? (Low)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: check_symbol_usage()] [Diagnostic injection] At line 245, env.diag() is called with user-controlled symbol names. Can malicious symbol names containing format string specifiers or escape sequences inject fake diagnostics or cause parser confusion? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: check_symbol_usage()] [Severity level] Line 245 uses Severity::Warning. Should unused security-critical parameters (like authentication tokens) be treated as errors instead of warnings to prevent deployment of vulnerable contracts? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: check_parameter_usage()] [Iterator safety] At line 250, params.iter() assumes params slice is valid. Can a dangling reference or freed memory in params cause undefined behavior during iteration? (Critical)",
  "[File: third_party/move/move-compiler-v2/src/env_pipeline/flow_insensitive_checkers.rs] [Function: check_parameter_usage()] [Parameter structure] The Parameter tuple at line 250 is destructured as (sym, _atype, loc). Can mismatched tuple sizes or type confusion cause memory corruption when accessing these fields? (High)"
]