[
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start()] [Race condition] The `tokio::select!` at line 128 processes three concurrent event streams. Can race conditions between simultaneous reconfig and DKG start events cause inconsistent state updates or missed epoch transitions? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start()] [Error swallowing] Errors from all handlers are only logged (line 141) but execution continues. Can critical failures like epoch transition errors or DKG initialization failures be silently ignored, causing validators to operate with stale state? (Critical)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start()] [Infinite loop] The main loop (line 127) runs forever without exit conditions. If `await_reconfig_notification()` fails or hangs at line 126, can validators be stuck in an uninitialized state unable to participate in consensus? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start()] [Network receiver exhaustion] If `network_receivers.rpc_rx` (line 135) receives messages faster than they can be processed, can the channel backpressure cause network-level deadlocks or memory exhaustion? (Medium)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start()] [Event ordering] Since `tokio::select!` processes events non-deterministically, can a reconfig event at line 132 be processed before a pending RPC request completes, causing the RPC to be processed with wrong epoch state? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start()] [Shutdown handling] There's no graceful shutdown mechanism in the start loop. Can abrupt validator restarts leave DKG managers in inconsistent states or leaked tokio tasks? (Medium)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: await_reconfig_notification()] [Panic on startup] Line 151 uses `.expect()` which panics if reconfig sender is dropped. Can an attacker cause validator crashes by manipulating the reconfig event stream during startup? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: await_reconfig_notification()] [Unwrap panic] Line 154 uses `.unwrap()` on `start_new_epoch()` result. If epoch initialization fails due to invalid on-chain config, does the validator crash and become unable to restart? (Critical)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: await_reconfig_notification()] [Blocking wait] The function blocks on `.await` at line 149. If the reconfig notification never arrives due to on-chain issues, can validators be permanently stuck in initialization? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: await_reconfig_notification()] [Config validation] The `on_chain_configs` payload from line 152 is passed directly to `start_new_epoch()`. Are there any validation checks to prevent malicious or corrupted on-chain configs from being processed? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [ValidatorSet extraction failure] Line 158-160 uses `.expect()` to unwrap ValidatorSet. Can malicious governance proposals deploy invalid on-chain configs that crash all validators simultaneously when a new epoch starts? (Critical)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Epoch state race] Line 163 updates `self.epoch_state` without synchronization. Can concurrent calls to `start_new_epoch()` from multiple reconfig events cause epoch_state to be overwritten with wrong values? (Critical)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Index lookup failure] At lines 164-168, `my_index` lookup can return None if the validator is not in the new validator set. Can this cause silent exclusion from DKG even when the validator should participate? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Randomness config bypass] Lines 170-172 use `unwrap_or_else` to default if RandomnessConfigSeqNum is missing. Can an attacker exploit missing on-chain config to force default behavior, enabling or disabling randomness unexpectedly? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Override precedence attack] Lines 182-184 warn but allow local `randomness_override_seq_num` to disable randomness. Can a single compromised validator with malicious config participate differently than the network, breaking protocol assumptions? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Config construction] Lines 186-190 construct OnChainRandomnessConfig from potentially untrusted inputs. Can integer overflow in seq_num comparison cause randomness to be incorrectly enabled/disabled? (Medium)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Consensus config error handling] Lines 192-196 log errors but use `unwrap_or_default()`. Can a malicious consensus config payload cause all validators to operate with default (potentially insecure) consensus parameters? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Feature flag race] Lines 199-200 check both `is_vtxn_enabled()` and `randomness_enabled()`. Can these feature flags be toggled independently to create states where only some validators participate in DKG? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [DKGState deserialization] Line 205 uses `unwrap_or_default()` for DKGState extraction. If DKG is in progress but the state is corrupted, will defaulting cause the protocol to restart and lose progress? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Network sender creation] Line 207 creates a network sender without validation. Can this sender be used to send messages before the epoch is fully initialized, causing protocol confusion? (Medium)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [ReliableBroadcast initialization] Lines 208-220 construct ReliableBroadcast with parameters from `rb_config`. Can malicious backoff_policy_base_ms or rpc_timeout_ms values cause the broadcast protocol to fail or behave unpredictably? (Medium)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Validator address ordering] Line 210 uses `get_ordered_account_addresses()`. If validators have different orderings due to config inconsistencies, can ReliableBroadcast protocols diverge across nodes? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Executor bound] Line 219 creates BoundedExecutor with hardcoded limit of 8. Can DKG protocols with many participants exceed this limit, causing task rejections or deadlocks? (Medium)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Channel capacity] Lines 223-224 create dkg_start_event_tx with KLAST queue style and capacity 1. Can rapid DKG start events cause earlier events to be dropped before processing? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [RPC message channel] Lines 227-230 create dkg_rpc_msg_rx with FIFO queue and capacity 100. Can an attacker flood this channel during DKG to cause legitimate messages to be dropped or delayed? (High)"
]