[
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: SEQUENCE_NUMBER_TOO_BIG] [Sequence overflow] Code 24 prevents sequence number overflow - what is the maximum sequence number, and can attackers intentionally overflow to reset sequence numbers? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: FEATURE_UNDER_GATING] [Feature flag bypass] Code 26 handles feature gating - can attackers exploit feature activation timing to use features before they're fully enabled, causing consensus divergence? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: SECONDARY_KEYS_ADDRESSES_COUNT_MISMATCH] [Multi-sig validation] Code 27 checks secondary signer counts - can mismatch between keys and addresses be exploited to forge multi-sig transactions? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: SIGNERS_CONTAIN_DUPLICATES] [Duplicate signer exploitation] Code 28 prevents duplicate signers - can this check be bypassed to make one signer count multiple times in multi-sig scenarios? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: SEQUENCE_NONCE_INVALID] [Nonce validation bypass] Code 29 validates sequence nonces - can attackers exploit nonce validation to execute transactions out of order or replay old transactions? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: INDEX_OUT_OF_BOUNDS] [Bytecode verification] Code 1001 catches index errors - can attackers craft bytecode with invalid indices that pass verification but crash during execution? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: RECURSIVE_STRUCT_DEFINITION] [Type recursion exploit] Code 1005 prevents recursive structs - can attackers use generic type parameters or phantom types to create effectively recursive structures that bypass this check? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: INVALID_FALL_THROUGH] [Control flow bypass] Code 1007 checks for invalid fall-through - can attackers craft bytecode with unreachable code that contains malicious operations that are never verified? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: NEGATIVE_STACK_SIZE_WITHIN_BLOCK] [Stack underflow] Code 1009 detects stack underflow - is this check sufficient to prevent all stack manipulation attacks, or can carefully crafted bytecode cause stack corruption? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: TYPE_MISMATCH] [Type confusion] Code 1020 catches type mismatches - can generic type parameters or type aliases be used to create type confusion that passes verification but causes runtime errors? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: MISSING_DEPENDENCY] [Dependency resolution] Code 1021 checks dependencies - can attackers publish modules with missing dependencies that are later resolved to malicious modules? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: MODULE_ADDRESS_DOES_NOT_MATCH_SENDER] [Address spoofing] Code 1067 validates module publisher address - can this be bypassed through transaction batching or multi-sig scenarios where sender differs from module address? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: DUPLICATE_MODULE_NAME] [Module shadowing] Code 1095 prevents duplicate module names in one transaction - can an attacker publish modules with the same name across multiple transactions to shadow or replace system modules? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: BACKWARD_INCOMPATIBLE_MODULE_UPDATE] [Compatibility bypass] Code 1096 enforces backward compatibility - what specific compatibility rules are enforced, and can attackers craft updates that technically pass checks but break existing code? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: CYCLIC_MODULE_DEPENDENCY] [Dependency cycle] Code 1097 prevents cyclic dependencies - can mutual dependencies between modules be exploited to cause initialization deadlocks or infinite loops? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: NUMBER_OF_ARGUMENTS_MISMATCH] [Argument count bypass] Code 1098 validates argument counts - can generic functions or variadic arguments be used to bypass argument count validation? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: FAILED_TO_DESERIALIZE_ARGUMENT] [Argument deserialization] Code 1100 handles argument deserialization failures - can attackers craft arguments that deserialize differently across validator implementations? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: CALLED_SCRIPT_VISIBLE_FROM_NON_SCRIPT_VISIBLE] [Visibility bypass] Code 1102 enforces script visibility - can module functions be called as scripts through entry function wrappers, bypassing visibility restrictions? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: INVALID_FRIEND_DECL_WITH_SELF] [Friend declaration exploit] Code 1104 prevents self-friendship - can circular friend relationships between modules be used to escalate privileges or access internal functions? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: CYCLIC_MODULE_FRIENDSHIP] [Friendship cycle] Code 1107 prevents cyclic friendships - can indirect friendship chains (A→B→C→A) bypass this check and create effective cycles? (Low)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: INVALID_PHANTOM_TYPE_PARAM_POSITION] [Phantom type abuse] Code 1108 validates phantom type parameters - can phantom types be misused to bypass resource constraints or create type confusion? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: LOOP_MAX_DEPTH_REACHED] [Nested loop DoS] Code 1111 limits loop nesting - is this limit enforced during verification only, or can runtime code generation create deeply nested loops? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: TOO_MANY_TYPE_PARAMETERS] [Generic parameter explosion] Code 1112 limits type parameters - can nested generics create exponential type combinations that overwhelm the verifier despite passing this check? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: VALUE_STACK_OVERFLOW/PUSH_OVERFLOW] [Stack limits] Codes 1115, 1117 prevent stack overflow - are these limits sufficient to prevent resource exhaustion, and are they enforced consistently across all bytecode operations? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: MAX_DEPENDENCY_DEPTH_REACHED] [Dependency depth exploit] Code 1118 limits dependency depth - can attackers create long dependency chains that pass this check but cause O(n²) verification time? (Medium)"
]