[
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Non-determinism] For Fq12 operations, can the ordering of component arithmetic operations in arkworks cause different intermediate states on different validators, even if final results are mathematically equivalent? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Consensus break] If handle allocation in store_element! is non-deterministic (e.g., due to vector capacity changes), can different validators assign different handle values to the same result element, causing Move contract state divergence? (Critical)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Type safety] Does the Move type system properly enforce that handles (u64 values) can only reference elements of the type specified in the type argument, or can type confusion in Move bytecode allow cross-type handle usage? (Critical)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Type safety] Can generic type parameter manipulation in Move allow an attacker to instantiate sub_internal with type arguments that match neither BLS12381 nor BN254 structures but still pass structure_from_ty_arg! validation? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [VM integration] Does the SafeNativeContext properly isolate AlgebraContext state between different Move transaction executions, or can handle values from one transaction be reused in another to access deallocated memory? (Critical)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [VM integration] Can speculative execution in parallel transaction processing cause sub_internal() to operate on stale or inconsistent AlgebraContext state from rolled-back transactions? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Arithmetic correctness] For field elements near zero, does subtraction properly handle underflow and wrap around to large positive values modulo the field order, or can negative results cause undefined behavior? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Arithmetic correctness] Can subtracting the zero element from itself produce a non-canonical representation of zero that breaks equality checks in later operations? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Arithmetic correctness] For group elements, does P - P always produce the proper identity element in the correct representation, or can coordinate system artifacts cause non-canonical identity representations? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Arithmetic correctness] Can subtracting elements that are equal but in different coordinate representations (e.g., different projective coordinates for the same affine point) fail to recognize equality and produce incorrect results? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Arithmetic correctness] For Gt group subtraction implemented as division at lines 60-66 and 95-101, can division by certain elements near the group order cause incorrect results due to cyclotomic subgroup structure? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Cross-structure attack] Can an attacker create handles for BLS12-381 elements and then attempt to use them in BN254 subtraction operations by exploiting type argument manipulation? (Critical)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Cross-structure attack] Does the AlgebraContext store type information with each handle, or can handles be reinterpreted as different types between operations (e.g., treat a G1 element handle as an Fr element)? (Critical)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Cross-structure attack] Can an attacker exploit the fact that both BLS12-381 and BN254 use similar field sizes to cause type confusion where elements from one curve are interpreted as elements from another? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Cross-structure attack] If an attacker provides handles that were created with one Structure type but attempts subtraction with a different type argument, does safe_borrow_element! properly detect the mismatch and abort? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Protocol vulnerability] Can incorrect subtraction results in pairing-based cryptography (using Gt group operations) break BLS signature verification or aggregate signature schemes used in consensus? (Critical)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Protocol vulnerability] If Move smart contracts use sub_internal() for zk-SNARK verification, can subtle arithmetic errors cause valid proofs to be rejected or invalid proofs to be accepted? (Critical)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Protocol vulnerability] Can an attacker exploit the div-instead-of-sub semantic for Gt groups to break cryptographic protocols that assume consistent additive notation across all group operations? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Protocol vulnerability] If DeFi protocols use elliptic curve operations for threshold signatures or multi-party computation, can arithmetic errors in sub_internal() cause signature shares to combine incorrectly? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [State divergence] If sub_internal() produces non-deterministic results or different handle allocations across validators, can this cause Jellyfish Merkle Tree state root mismatches leading to consensus failure? (Critical)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [State divergence] Can differences in AlgebraContext state serialization between validators cause the same algebraic operations to produce different state commitments even with correct arithmetic results? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [State rollback] If a transaction containing sub_internal() operations is rolled back due to parallel execution conflicts, does the AlgebraContext properly clean up allocated handles and memory? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Serialization] If the result of sub_internal() is later serialized using serialize_internal, can non-canonical element representations cause the same mathematical result to serialize to different byte sequences? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Deserialization] Can an attacker deserialize maliciously crafted elements, perform subtraction, and cause the result to have properties that break subsequent operations (e.g., infinity flags, invalid coordinates)? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Complexity attack] Can an attacker craft element pairs where subtraction triggers worst-case performance in arkworks (e.g., expensive coordinate normalization), causing validator slowdowns? (Medium)"
]