[
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Trait: ExpChecker] [Unbounded iteration] If visit_expr_pre() or visit_expr_post() are called on deeply nested expressions, could this cause stack overflow even without explicit recursion due to the call stack depth? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Trait: ExpChecker] [Stateful checker attack] Can malicious ExpChecker implementations maintain internal state across visit_expr_pre() and visit_expr_post() calls that causes non-deterministic behavior based on compilation order, leading to inconsistent security checks? (High)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Trait: StacklessBytecodeChecker] [Cross-function state] Could StacklessBytecodeChecker implementations leak state between different FunctionTarget invocations, causing security checks for one function to incorrectly influence checks for another function? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Function: get_exp_checkers()] [Checker reuse] Are ExpChecker instances created fresh for each compilation or reused, and if reused, could leftover state from previous compilations cause false positives/negatives in security checks? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Function: get_stackless_bytecode_checkers()] [Instance identity] Does the compiler rely on checker instance identity rather than name equality, and could this cause duplicate checks or missing checks if multiple ExternalChecks providers return checkers with the same name? (Low)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Function: report()] [GlobalEnv poisoning] Could a malicious checker corrupt the GlobalEnv passed to report() by calling methods that modify global compiler state, affecting subsequent compilation stages or other checkers? (High)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Function: report()] [Loc spoofing] Can a malicious checker fabricate Loc values in report() to point to incorrect source locations, causing developers to fix the wrong code or miss actual vulnerabilities? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Function: visit_expr_pre()] [FunctionEnv tampering] If FunctionEnv is mutable, could visit_expr_pre() modify function metadata in ways that affect subsequent checkers or compilation stages, bypassing security validations? (High)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Function: visit_expr_post()] [ExpData corruption] Could visit_expr_post() modify ExpData after child expressions have been processed, creating inconsistent AST state that causes type checking or verification failures? (High)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Const: LintAttribute::SKIP] [Wildcard suppression] Does the lint suppression system support wildcards or patterns in checker names, and if so, could an attacker use #[lint::skip(*)] to disable all security checks on malicious Move modules? (Critical)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Function: report()] [Suppression scope] Are lint suppressions properly scoped to functions/modules, or could a suppression attribute leak across compilation units allowing one module to disable checks for unrelated modules? (High)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Function: report()] [Case sensitivity] Is checker_name comparison case-sensitive when matching suppression attributes, and could case variations be used to bypass intended suppressions or suppress the wrong checker? (Low)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Trait: ExternalChecks] [Checker ordering] Does the order of ExpCheckers or StacklessBytecodeCheckers matter for security, and could a malicious external checker provider reorder checkers to run bypasses before validations? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Function: known_checker_names()] [Duplicate detection] If multiple ExternalChecks implementations provide checkers with the same name, how are conflicts resolved, and could this cause security checks to be silently overridden? (High)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Trait: ExternalChecks] [Checker isolation] Are ExpCheckers and StacklessBytecodeCheckers properly isolated from each other, or could side effects from one checker type influence the behavior of the other checker type? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Trait: ExpChecker] [AST traversal bypass] Could a malicious checker exploit the separation between visit_expr_pre() and visit_expr_post() to see expressions in inconsistent states, missing security-critical validations? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Function: report()] [Panic in lint_diag_with_notes] If GlobalEnv::lint_diag_with_notes() panics (due to invalid Loc or other issues), could this crash the compiler without proper error handling, causing DoS for developers trying to compile Move contracts? (Low)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Trait: ExpChecker] [Uncaught panic propagation] If visit_expr_pre() or visit_expr_post() panics, does the compiler catch and recover, or does the entire compilation fail without producing any diagnostics for the user? (Low)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Trait: StacklessBytecodeChecker] [Check failure modes] If check() encounters invalid FunctionTarget data, does it panic, return an error, or silently skip validation, and could silent failures cause insecure bytecode to be generated? (High)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Const: LINTER_URL_BASE] [URL construction] Does the URL construction in report() properly escape special characters in checker_name, or could names containing URL-sensitive characters (/, #, ?, etc.) generate malformed or misdirected URLs? (Low)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Function: report()] [Link safety] Are the generated linter documentation links validated or sanitized, or could a malicious checker with a crafted name cause browsers to execute JavaScript or navigate to malicious sites? (Low)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Trait: ExternalChecks] [Trait coherence] Could overlapping trait implementations for ExternalChecks cause ambiguity or allow multiple implementations to be registered for the same type, leading to duplicate or conflicting checker execution? (Medium)",
  "[File: third_party/move/move-compiler-v2/src/external_checks.rs] [Trait: ExpChecker] [Lifetime violations] Are the lifetime bounds on FunctionEnv and ExpData references in visit_expr_pre()/visit_expr_post() sufficient to prevent use-after-free, or could checkers hold references beyond their valid lifetimes? (Critical)"
]