[
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [Deserialization tampering] Pipeline deserializes after serialization - can attacker modify serialized bytecode between serialize/deserialize to inject malicious CFG structure? (Critical)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [Function: cfg_compile_if_else_with_two_returns] [Early exit exploitation] Test has multiple return paths but doesn't verify all paths execute required cleanup - can attacker use early returns to skip resource cleanup, causing resource leaks or double-spending? (High)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [Branch condition evaluation] Tests use jump_if with expressions but don't verify condition evaluation order - can attacker craft conditions with side effects that execute in wrong order? (Medium)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [Function: cfg_compile_nested_if] [Deep nesting limits] Test has 2 levels of nesting - can attacker create deeply nested conditionals that overflow CFG construction stack or cause exponential complexity? (Medium)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [Block ID collision] Tests assume block IDs are unique - can attacker cause hash collisions in block ID assignment, causing CFG to merge distinct blocks? (High)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [Bytecode version compatibility] Tests don't specify bytecode version - can attacker use newer bytecode version with features that old CFG implementation doesn't understand, bypassing analysis? (High)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [Function: cfg_compile_script_let] [Type confusion in CFG] Test uses u64 variables but CFG is type-agnostic - can attacker exploit type confusion where CFG thinks values are safe but actual types allow exploitation? (High)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [Concurrent CFG construction] Tests are single-threaded - can attacker trigger concurrent CFG construction on shared bytecode causing race conditions in block identification? (Medium)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [Memory exhaustion] Tests use small scripts - can attacker provide huge bytecode causing CFG to allocate unbounded memory in blocks/successors storage? (Medium)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [Function: cfg_compile_if_else_with_else_abort] [Abort code validation] Test uses abort 0 but doesn't validate abort codes - can attacker use invalid abort codes that cause CFG to misidentify abort as different instruction? (Low)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [Verification bypass via test gaps] Tests only cover ~11 patterns - can attacker craft control flow combining untested patterns (nested loops, switches, etc.) that CFG misanalyzes? (Critical)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [Function: cfg_compile_nested_if] [Reachability from non-entry] Test calls reachable_from(8) on non-entry block - does this properly compute reachability, or can attacker exploit assumptions about entry-point reachability? (Medium)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [Jump table attacks] Tests only use direct jumps - can attacker use computed/indirect jumps (jump tables) that CFG doesn't properly analyze, hiding malicious control flow? (Critical)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [CFG immutability] Tests create CFG once - can attacker exploit mutable CFG if it's modified during verification, causing TOCTOU bugs? (High)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [Function: cfg_compile_if_else_with_if_return] [Asymmetric branch handling] Test has return in one branch but not other - can attacker exploit CFG treating symmetric/asymmetric branches differently to bypass checks? (Medium)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [Compiler optimization bypass] Tests use unoptimized IR - can attacker craft code where optimization changes CFG structure, causing verified and executed code to differ? (Critical)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [Resource tracking in CFG] Tests don't verify Move resource semantics - can attacker exploit CFG not tracking resource acquire/release to double-spend or leak resources? (Critical)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [Function: cfg_compile_script_let] [Arithmetic operation ordering] Test has complex expression (move(x) + copy(y) * 5 - copy(y)) - does CFG preserve evaluation order, or can attacker exploit reordering to cause integer overflow? (High)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [Cross-module CFG interaction] Tests only use single scripts - can attacker exploit CFG not modeling cross-module calls to bypass module-level invariants? (High)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [Gas metering integration] Tests don't verify gas consumption - can attacker craft CFG-confusing code that causes incorrect gas calculation, enabling gas exhaustion attacks? (High)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [Function: cfg_compile_if] [Fall-through block handling] Test has empty b1 block that just jumps - can attacker exploit fall-through blocks where CFG incorrectly merges them with successors? (Medium)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [Bytecode instruction boundaries] Tests assume instructions are properly delimited - can attacker craft overlapping instructions that CFG parses at wrong boundaries? (Critical)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [Stack depth tracking] Tests don't verify stack depth - can attacker use control flow that causes stack overflow/underflow that CFG doesn't detect? (High)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [Function: cfg_compile_if_else_with_two_aborts] [Unreachable code optimization] Test expects b3 to be counted despite being unreachable - can attacker hide exploits in unreachable code that optimizer removes but verification already passed? (Medium)",
  "[File: third_party/move/move-ir-compiler/src/unit_tests/cfg_tests.rs] [All tests] [Dominator tree calculation] Tests don't verify dominance relationships - can attacker exploit CFG not correctly identifying dominators to bypass must-execute security checks? (High)"
]