[
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Integration: State fetch errors] When OnChainConfig::fetch_config() fails to read RequiredGasDeposit from state, does it silently fall back to default_if_missing(), potentially hiding critical state corruption or storage failures that should halt the chain? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Governance: Update mechanism] Can an attacker who compromises governance accounts call randomness_api_v0_config::set_for_next_epoch() with gas_amount: Some(u64::MAX) to make randomness API unusable by setting deposit requirements higher than any user can afford? (Critical)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Governance: Flag manipulation] Can malicious governance proposals call set_allow_max_gas_flag_for_next_epoch(true) to enable custom max_gas declarations, then immediately deploy contracts with inflated gas requirements to drain user funds through excessive gas charges? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Governance: Config buffer race] Between when a governance proposal calls set_for_next_epoch() and when on_new_epoch() applies the buffered config, can attackers exploit the time window to submit transactions under old deposit rules, bypassing new security restrictions? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Governance: Proposal validation] Does the governance system validate that RequiredGasDeposit updates maintain reasonable gas_amount values, or can a proposal set gas_amount: Some(1) making deposits too cheap and enabling spam attacks on the randomness API? (Medium)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Governance: Emergency response] If RequiredGasDeposit is misconfigured causing network-wide transaction failures, can emergency governance proposals update the config within a single epoch, or does the config_buffer delay allow the misconfiguration to persist causing extended downtime? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Governance: Rollback protection] Can governance proposals repeatedly toggle AllowCustomMaxGasFlag between true/false across epochs to cause validator confusion and consensus instability, or are there rate limits preventing rapid config changes? (Medium)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Struct: RequiredGasDeposit line 10] [Integer overflow] Can RequiredGasDeposit with gas_amount: Some(u64::MAX) cause integer overflow when multiplied by gas price during transaction validation, allowing attackers to bypass deposit checks by triggering wraparound to zero? (Critical)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Struct: RequiredGasDeposit line 10] [Zero handling] If gas_amount is set to Some(0), does this disable deposit requirements entirely or cause division-by-zero errors in gas calculation logic, potentially creating an unintended free randomness API that can be spammed? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Struct: RequiredGasDeposit line 10] [Negative gas amounts] Although u64 is unsigned, can deserialization of malicious payloads with negative numbers cause silent wraparound to large positive values like 2^64-1, making deposits unpayable? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Function: as_move_value() line 30] [Conversion overflow] When converting Option<u64> to MoveValue, can extremely large gas_amount values exceed Move VM's integer representation limits, causing silent truncation that makes validators compute different deposit requirements? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Integration: Gas calculations] If RequiredGasDeposit::gas_amount is used in arithmetic operations with transaction max_gas_units, can the sum exceed u64::MAX causing overflow that makes REQUIRED_DEPOSIT_INCONSISTENT_WITH_TXN_MAX_GAS checks fail incorrectly? (Medium)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Epoch transition: on_new_epoch() interaction] During reconfiguration_with_dkg::finish() when randomness_api_v0_config::on_new_epoch() extracts buffered configs, can validators crash or diverge if RequiredGasDeposit deserialization fails mid-epoch, causing permanent network split? (Critical)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Epoch transition: Atomic update failure] When on_new_epoch() updates both RequiredGasDeposit and AllowCustomMaxGasFlag, can partial updates leave configs in inconsistent state where deposit is required but custom max_gas is allowed, enabling gas requirement bypass attacks? (Critical)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Epoch transition: Config extraction race] If config_buffer::extract_v2<RequiredGasDeposit>() is called concurrently by multiple threads during epoch transition, can race conditions cause the same buffered config to be applied multiple times or lost entirely? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Epoch transition: Rollback vulnerability] If epoch transition fails after RequiredGasDeposit is updated but before on_new_epoch() completes, can the chain rollback to previous epoch with stale config values while some validators retain new values, causing consensus divergence? (Critical)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Epoch transition: DKG interaction] Does reconfiguration_with_dkg guarantee that randomness_api_v0_config updates complete before DKG randomness generation begins, or can timing issues cause new randomness to be generated under old deposit rules creating economic exploitation opportunities? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Epoch transition: State persistence] After on_new_epoch() updates RequiredGasDeposit in memory via borrow_global_mut, are changes immediately persisted to storage, or can validator crashes lose config updates requiring manual intervention to resync the network? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Epoch transition: Move-to semantics] When on_new_epoch() uses move_to(framework, new_config) if config doesn't exist, can malicious actors front-run this by creating a dummy RequiredGasDeposit resource at @aptos_framework, causing move_to to abort and DoS config updates? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Epoch transition: Config buffering order] Are RequiredGasDeposit and AllowCustomMaxGasFlag updates applied in a specific order during on_new_epoch(), or can arbitrary ordering allow attackers to exploit the window where one is updated but not the other? (Medium)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Consensus: State divergence] If different validators fetch RequiredGasDeposit at slightly different times during block execution, can they compute different gas_amount values due to concurrent config updates, causing them to accept/reject different transactions leading to consensus failure? (Critical)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Consensus: Byzantine validator] Can a Byzantine validator (<1/3 of stake) send malformed RequiredGasDeposit configs to honest validators causing their OnChainConfig::fetch_config() to fail, while the Byzantine validator proceeds with fabricated values to create fork conditions? (Critical)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Consensus: Non-deterministic defaults] When multiple validators call RequiredGasDeposit::default_if_missing() simultaneously, can differences in local state or timing cause them to compute different default gas_amount values, breaking deterministic execution guarantees? (Critical)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Consensus: Merkle tree impact] Does RequiredGasDeposit participate in state Merkle tree construction, and if so, can inconsistent serialization of Option<u64> cause validators to compute different state roots even with identical gas_amount values? (Critical)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Consensus: Quorum certificate validation] When validators vote on blocks containing RequiredGasDeposit updates, do they validate the config changes before signing, or can malicious leaders include invalid configs that pass quorum but crash validators during execution? (High)"
]