[
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: UNKNOWN_VERSION] [Version confusion] Code 3003 rejects unknown versions - can future version bytecode be replayed before validators upgrade, causing version confusion attacks? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: UNKNOWN_TABLE_TYPE] [Table type injection] Code 3004 validates table types - can attackers inject custom table types that are accepted by some validators but rejected by others? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: UNKNOWN_OPCODE] [Opcode injection] Code 3007 rejects unknown opcodes - can attackers use opcodes from newer versions to create transactions that behave differently across validator versions? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: DUPLICATE_TABLE] [Table duplication] Code 3010 prevents duplicate tables - can carefully crafted bytecode create effective table duplication through aliasing or references? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: UNKNOWN_ABILITY] [Ability system bypass] Code 3013 validates abilities - can unknown abilities be used to bypass resource constraints or type system protections? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: BAD_U16/U32/U64/U128/U256] [Integer deserialization] Codes 3017-3021 handle integer deserialization - can malformed integers cause integer overflow, undefined behavior, or consensus divergence? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: VALUE_SERIALIZATION/DESERIALIZATION_ERROR] [Value encoding] Codes 3022-3023 handle value encoding errors - can attackers craft values that serialize but don't deserialize correctly, causing state corruption? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: CODE_DESERIALIZATION_ERROR] [Code encoding] Code 3024 handles code deserialization - can bytecode be crafted that deserializes differently on different architectures or compiler versions? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: INVALID_FLAG_BITS] [Flag bit manipulation] Code 3025 validates flag bits - can reserved or invalid flag bits be used to enable undocumented features or bypass checks? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: UNABLE_TO_CAPTURE_OPTION_TYPE] [Option capture restriction] Code 3026 prevents capturing options until feature flag is enabled - can this restriction be bypassed through type aliasing or generic parameters? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: OUT_OF_GAS] [Gas exhaustion timing] Code 4002 indicates OOG - is gas checked after every operation, or can expensive operations complete before OOG is detected, allowing resource exhaustion? (High)"
]