[
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: new_readonly_for_test()] [Mode bypass] If this function is called on a database already opened in read-write mode by another process, can file lock conflicts cause data corruption or inconsistent reads? (High)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: new_readonly_for_test()] [Stale reads] Does opening in readonly mode guarantee consistent reads, or can concurrent writes from other processes cause TOCTOU (time-of-check-time-of-use) issues where state changes between reads? (High)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: new_readonly_for_test()] [Lock file manipulation] Can an attacker delete or manipulate RocksDB lock files to trick the system into opening a readonly handle when exclusive access is required, causing state corruption? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: new_readonly_for_test()] [Cache pollution] If readonly and read-write instances share the same cache configuration, can readonly operations pollute the cache and evict important hot data needed by the primary write instance? (Low)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: state_merkle_db()] [Direct merkle access] Does returning Arc<StateMerkleDb> allow test code to directly manipulate merkle tree nodes, bypassing validation logic and corrupting state commitment hashes? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: state_merkle_db()] [Concurrent modification] Can multiple callers obtain Arc clones and modify the merkle tree concurrently without proper locking, causing race conditions that corrupt the tree structure? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: state_merkle_db()] [State root manipulation] Can an attacker with access to this function forge state roots by directly writing merkle nodes, allowing them to fake state proofs and claim invalid account balances? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: state_merkle_db()] [Reference count leak] If callers hold onto the Arc<StateMerkleDb> indefinitely, can this prevent proper cleanup and resource reclamation, causing memory leaks over time? (Low)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [Version manipulation] Is first_version validated to ensure it matches the current ledger state, or can an attacker pass arbitrary version numbers to create gaps or overlaps in transaction history, corrupting the ledger? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [Transaction replay] Does the function validate that transactions being saved haven't already been committed, or can an attacker replay old transactions by calling this function multiple times with the same txns_to_commit? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [Ledger info bypass] If ledger_info_with_sigs is None, does the function still commit transactions without validator signatures, allowing unauthorized state changes that bypass consensus? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [Signature verification skip] When ledger_info_with_sigs is provided, does the function verify the signatures are valid and from authorized validators, or can an attacker pass fake signatures? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [State locking race] The function calls current_state_locked().clone() - can this create a race condition where the state changes between cloning and the update, causing state inconsistencies? (High)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [Brute force attack] The loop from lines 142-153 tries to brute force auxiliary_info_hash by testing 100 transaction indices - is this computationally expensive operation vulnerable to timing attacks that reveal information about hash values? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [Hash collision exploitation] Can an attacker craft malicious TransactionInfo with auxiliary_info_hash that intentionally collides with multiple transaction indices, causing the wrong PersistedAuxiliaryInfo to be selected? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [Panic on hash not found] If no match is found in 100 iterations, the function panics with 'Hash not found' - can an attacker craft transactions with auxiliary hashes outside the [0-99] range to crash validator nodes? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [Hash preimage attack] Does the brute force loop reveal that PersistedAuxiliaryInfo uses weak hash construction (just hashing transaction_index as u32), making it vulnerable to preimage attacks for creating hash collisions? (High)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [Limited index range] Why is the loop limited to 100 iterations (i in 0..100)? Can an attacker exploit this limitation by using transaction indices >= 100 to cause guaranteed panics? (High)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [CPU exhaustion] If many transactions have auxiliary_info_hash set, does this brute force loop (potentially 100 iterations per transaction) cause excessive CPU usage that delays block processing? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [Determinism violation] Is the hash reconstruction deterministic across all validators? If different validators find different matches in the brute force loop, could this cause state divergence? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [Auxiliary info forgery] Can an attacker analyze which transaction indices produce which hashes and craft transactions that fake auxiliary info, manipulating block metadata? (High)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [State clone race] Calling current_state_locked().clone() followed by state updates - is there a TOCTOU race where another thread modifies state between clone and update, causing state inconsistency? (High)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [Persisted state mismatch] Does get_persisted_state() guarantee consistency with current_state_locked(), or can async persistence cause stale state to be used for updates? (High)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [Hot vs cold state] The function distinguishes hot_state and persisted_state - can an attacker exploit inconsistencies between these to create forked state trees? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/db/aptosdb_testonly.rs] [Function: save_transactions_for_test()] [State update validation] Does update_with_db_reader validate that state updates are consistent with the transaction outputs, or can malformed updates corrupt the state merkle tree? (Critical)"
]