[
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 17-20] [Type Tag Injection] Can an attacker craft a malicious type tag string in ContractEvent::new_v2_with_type_tag_str() that causes type confusion, allowing non-JWK events to be misclassified as '0x1::jwks::QuorumCertifiedUpdate' and bypass subscription service filtering? (Critical)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 17-20] [Type Tag Parsing] Does TypeTag::from_str() in the new_v2_with_type_tag_str() call properly validate the type tag format, or can specially crafted strings with unicode characters, control characters, or escape sequences cause parser confusion leading to incorrect event classification? (High)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 17-20] [Memory Exhaustion] Can the vec![0xFF; 256] event data allocation in the benchmark setup be exploited in production code where attackers control event data size, causing memory exhaustion by creating events with extremely large data payloads that bypass size limits? (High)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 29-32] [Event Data Validation] Does ContractEvent::new_v2_with_type_tag_str() validate the event_data parameter, or can attackers inject malformed BCS-encoded data (vec![0xFF; 256]) that causes deserialization failures downstream in the subscription service, leading to service crashes? (Medium)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 17-20] [Type Tag Collision] Can an attacker create events with type tags that hash to the same value as '0x1::jwks::QuorumCertifiedUpdate', causing legitimate non-JWK events to be incorrectly forwarded to the subscription service and trigger unintended validator actions? (Critical)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 22, 34] [Filter Bypass] Does should_forward_to_subscription_service() properly validate event type tags, or can attackers craft events with similar but modified type tag strings (e.g., '0x1::jwks::QuorumCertifiedUpdate\\x00', '0x01::jwks::QuorumCertifiedUpdate') that bypass filtering but are still processed as valid JWK events? (Critical)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 22, 34] [Case Sensitivity] Is the type tag comparison in should_forward_to_subscription_service() case-sensitive, or can attackers use mixed-case variations ('0X1::JWKS::QuorumCertifiedUpdate') to bypass event filtering and prevent critical JWK updates from reaching validators? (High)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 34] [Whitelist Completeness] Does the should_forward_to_subscription_service() function check all five critical event types (JWK, DKG, NewEpoch, NewEpochV2, Randomness), or are there additional system-critical events that should be forwarded but are missing from the whitelist, causing consensus failures? (Critical)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 22] [Legacy Filter Vulnerability] Does the should_forward_to_subscription_service_old() function using string comparison (line 288-292 in lib.rs) have race conditions or vulnerabilities when used concurrently during benchmark execution that could indicate similar issues in production code? (Medium)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 34] [Type Tag Deref] Does the should_forward_to_subscription_service() comparison use .deref() correctly when comparing TypeTags, or can pointer/reference issues cause incorrect comparisons that allow malicious events to bypass filtering? (High)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 11] [Benchmark Group Naming] Can the benchmark_group name 'should_forward_to_subscription_service' be exploited to cause naming collisions with other benchmarks, potentially masking performance regressions that indicate security vulnerabilities in the filtering logic? (Low)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 14-24] [Feature Gate Bypass] Is the #[cfg(feature = 'bench')] guard on the v0 benchmark properly enforced, or can attackers compile with this feature enabled in production to expose the vulnerable old filtering implementation? (Medium)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 15] [Benchmark Setup Race] Does iter_with_setup() properly isolate benchmark iterations, or can concurrent benchmark executions cause race conditions in the event creation logic that could manifest as vulnerabilities in production multi-threaded environments? (High)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: criterion_main() line 45] [Criterion Configuration] Does the Criterion::default() configuration properly sandbox benchmark execution, or can malicious benchmark code escape the sandbox and interfere with production event filtering logic during testing? (Low)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 26-36] [v1 vs v0 Parity] Are the v1 and v0 benchmark implementations functionally equivalent, or could differences in behavior between the old string-based filtering and new TypeTag-based filtering cause consensus divergence if nodes run different versions? (Critical)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 18] [Type Tag String Injection] Can the type tag string '0x1::jwks::QuorumCertifiedUpdate' be manipulated through Unicode normalization attacks (e.g., using fullwidth characters '０ｘ１') to create events that appear identical but bypass filtering? (High)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 18] [Address Validation] Does the '0x1' address prefix in the type tag properly validate that events come from the system address, or can attackers create events from other addresses (0x2, 0x3) that masquerade as system events? (Critical)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 18] [Module Name Tampering] Can the module name 'jwks' in the type tag be substituted with similarly-named modules ('jwk', 'jwkss', 'jwks\\u200b') to create events that pass basic validation but cause failures in downstream JWK processing? (Medium)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 18] [Struct Name Validation] Does the struct name 'QuorumCertifiedUpdate' properly validate the event structure, or can attackers create events with truncated names ('QuorumCertified', 'QuorumCertifiedUpdat') that bypass length checks but match string prefixes? (Medium)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 18] [Type Parameter Injection] Can attackers append type parameters to the type tag string ('0x1::jwks::QuorumCertifiedUpdate<T>') to create generic events that bypass filtering by not exactly matching the expected type tag? (High)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 19] [Event Data Size] Does the 256-byte event data size in vec![0xFF; 256] represent a realistic upper bound, or can attackers create JWK events with larger data payloads that cause buffer overflows or memory exhaustion in the subscription service? (High)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 19] [Event Data Pattern] Is the 0xFF byte pattern used in the benchmark representative of real event data, or could this uniform pattern mask vulnerabilities in BCS deserialization that only trigger with specific byte sequences? (Medium)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 19] [BCS Encoding Validation] Does ContractEvent::new_v2() validate that the event_data is properly BCS-encoded before accepting it, or can attackers inject arbitrary binary data that causes deserialization panics when the subscription service attempts to process JWK updates? (High)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 31] [Event Data Reuse] Are event data buffers properly cleaned between benchmark iterations, or can residual data from previous iterations leak information or cause non-deterministic behavior in the filtering logic? (Low)",
  "[File: aptos-core/execution/executor-types/benches/default.rs] [Function: default_targets() line 19, 31] [Memory Alignment] Does the vec![0xFF; 256] allocation ensure proper memory alignment for the event data, or could misaligned data cause performance degradation or crashes on certain architectures when processing high-frequency events? (Low)"
]