[
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: new()] [Panic/DoS] Can an attacker provide a malformed CompiledModule that causes the Disassembler::disassemble().unwrap() call to panic on line 40-41, leading to process crash and potential denial of service if this tool is used in production validator infrastructure? (Medium)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: new()] [Input Validation] Does the new() function validate that the provided SourceMap and CompiledModule are compatible/consistent before creating SourceMapping on line 33, or can mismatched inputs cause undefined behavior in the disassembler? (Low)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: new()] [Memory Exhaustion] Can an attacker provide an extremely large CompiledModule with thousands of functions causing the disassembled_string on line 39-41 to consume excessive memory, potentially exhausting system resources if this viewer is used server-side? (Medium)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: new()] [Memory Exhaustion] When collecting lines via .lines().map(|x| x.to_string()).collect() on line 44, can a maliciously crafted module with extremely long disassembly output cause memory exhaustion by creating millions of String allocations? (Medium)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: new()] [Logic Error] The DisassemblerOptions on lines 34-38 sets print_code and print_basic_blocks to true without validation - can this expose sensitive bytecode implementation details that should remain private in production environments? (Low)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: new()] [Error Handling] The .unwrap() on line 41 provides no error context when disassembly fails - could this hide critical parsing errors that indicate module tampering or corruption, allowing malformed bytecode to be processed silently? (Low)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: new()] [Lifetime Safety] The BinaryIndexedView on line 32 borrows the CompiledModule with lifetime 'a - can lifetime issues cause use-after-free if the module is dropped while the viewer is still in use, potentially exposing memory corruption? (Medium)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: new()] [State Initialization] The build_mapping() call on line 48 occurs after struct initialization - if this function panics, is the BytecodeViewer left in a partially initialized state that could cause downstream issues? (Low)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [Regex DoS] The regex pattern r'^(\\\\d+):.*' on line 53 with unbounded quantifiers could be vulnerable to ReDoS (Regular Expression Denial of Service) if an attacker crafts disassembly output with extremely long digit sequences - can this cause catastrophic backtracking? (High)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [Regex DoS] The function regex pattern r'^public\\\\s+([a-zA-Z_]+)\\\\(' on line 54 allows unbounded repetition of whitespace (\\\\s+) - can specially crafted input with thousands of spaces cause regex engine to hang or consume excessive CPU? (Medium)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [Panic/DoS] Both Regex::new().unwrap() calls on lines 53-54 will panic if regex compilation fails - while unlikely with hardcoded patterns, could regex engine vulnerabilities or resource exhaustion cause unexpected panics? (Low)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [Integer Overflow] On line 70, casting enumerate() index to u16 with 'as u16' truncates if there are more than 65535 function definitions - can this cause function_definition_index collisions or incorrect mappings in large modules? (Medium)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [Panic/DoS] Line 79 performs direct HashMap indexing with function_def_for_name[fn_name] which panics if fn_name doesn't exist - can malformed disassembly output with unregistered function names cause process crash? (High)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [Panic/DoS] The .unwrap() chain on line 78 (cap.get(1).unwrap().as_str()) panics if regex capture group 1 doesn't exist - can this happen with edge case inputs causing unexpected regex match behavior? (Medium)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [Panic/DoS] Line 86 calls .parse::<u16>().unwrap() on regex-captured digits - can this panic if the digit string represents a number > 65535, causing overflow in u16 parsing? (High)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [Panic/DoS] Line 89 accesses current_fdef_idx.unwrap() without checking if it was set - if current_fun is Some but current_fdef_idx is None due to logic bugs, will this panic? (Medium)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [Integer Overflow] The code_offset value parsed on line 86 is directly cast to u16 - can bytecode with offsets exceeding 65535 cause silent truncation leading to incorrect source mapping and debugger confusion? (Medium)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [Logic Bug] Lines 77-82 set current_fun and current_fdef_idx when function regex matches, but these persist across iterations - if a bytecode line matches the digit regex before any function declaration, will current_fun be None causing the map operation on line 85 to silently fail? (Low)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [Logic Bug] The function regex on line 54 only matches 'public' functions - are private/internal Move functions ignored in the mapping, potentially causing incomplete source debugging information? (Low)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [HashMap Collision] Lines 87-91 insert into line_map using line number i as key - if multiple bytecode instructions map to the same source line, does later insertion overwrite earlier mappings causing loss of debugging information? (Low)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [Resource Exhaustion] The function iterates over all self.lines with enumerate() (line 75) - for extremely large modules with millions of lines, can this cause excessive CPU consumption or memory pressure during HashMap operations? (Low)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [Type Safety] Line 81 creates FunctionDefinitionIndex(function_definition_index) - does this newtype wrapper provide any bounds checking, or can out-of-range values cause issues in downstream BinaryIndexedView operations? (Low)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [String Handling] Line 76 calls line.trim() which allocates new strings - for modules with millions of lines, can this cause memory fragmentation or allocation failures? (Low)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [Regex Injection] While regex patterns are hardcoded, if future modifications allow user-controlled regex patterns, could attackers inject malicious regex to cause ReDoS or information disclosure? (Low)",
  "[File: third_party/move/tools/move-bytecode-viewer/src/bytecode_viewer.rs] [Function: build_mapping()] [Data Race] The function mutates self.line_map on line 95 - if BytecodeViewer is used concurrently (despite lacking Send/Sync markers), could race conditions corrupt the HashMap? (Low)"
]