[
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Function: try_from_bytes()] [Deserialization Attack] Can an attacker craft malicious BCS-encoded bytes with oversized length prefixes that cause memory exhaustion during deserialization, leading to validator node crashes and consensus disruption? (High)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Function: try_from_bytes()] [Integer Overflow] Does the BCS deserialization properly validate that the amount field doesn't overflow u64::MAX during decoding, or can an attacker inject crafted bytes that wrap around to create incorrect burn amounts? (Critical)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Function: try_from_bytes()] [Type Confusion] Can an attacker provide BCS bytes that deserialize to a valid BurnTokenEvent but contain a TokenId pointing to a different token type, allowing them to burn one token while the event indicates another was burned? (Critical)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Function: try_from_bytes()] [Malformed Data] What happens if try_from_bytes() receives truncated or incomplete BCS data - does the error handling prevent partial state updates that could corrupt the token supply tracking? (High)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Function: try_from_bytes()] [Resource Exhaustion] Can an attacker provide deeply nested TokenId structures within the BCS encoding that cause stack overflow during recursive deserialization, crashing validator nodes? (High)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Function: try_from_bytes()] [Replay Attack] Does the deserialization validate event uniqueness, or can an attacker replay the same BCS-encoded burn event bytes multiple times to falsely indicate multiple burns of the same tokens? (Critical)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Function: try_from_bytes()] [Error Handling] If bcs::from_bytes() fails, does the error propagation properly clean up any partially allocated resources, or can repeated failed deserializations leak memory? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Function: try_from_bytes()] [Zero Amount] Does the deserialization accept amount=0 for burn events, and if so, can attackers flood the event stream with zero-burn events to bloat storage without actually burning tokens? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Field: amount] [Integer Overflow] Can the amount field (u64) overflow when accumulated across multiple burn events, causing total supply calculations to wrap around and show incorrect remaining supply? (Critical)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Field: amount] [Supply Manipulation] If an attacker burns u64::MAX tokens in a single event, does this saturate the supply counter or cause underflow in the remaining supply calculation? (Critical)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Field: amount] [Zero Burn] Does the BurnTokenEvent accept amount=0, and if so, can this be exploited to emit events without actually reducing token supply, causing discrepancies in event-based indexers? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Field: amount] [Precision Loss] For tokens with decimal places, does the u64 amount handle fractional burns correctly, or can rounding errors accumulate to create phantom tokens? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Function: amount()] [Getter Security] Does the amount() getter perform any validation or can it return inconsistent values if the struct is partially initialized or corrupted? (Low)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Field: amount] [Negative Values] Although u64 is unsigned, can the serialization format allow negative values to be reinterpreted as large positive amounts through bit manipulation? (High)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Field: id] [Invalid TokenId] Does BurnTokenEvent validate that the TokenId actually exists before allowing the event to be created, or can attackers emit burn events for non-existent tokens? (High)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Field: id] [Cross-Token Attack] Can an attacker provide a TokenId from a different collection or creator, burning tokens from one account while the event claims they burned from another? (Critical)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Field: id] [Property Version Manipulation] Does the TokenId's property_version field get validated, or can attackers specify arbitrary versions to burn tokens with different properties than intended? (High)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Function: id()] [Reference Safety] Does the id() getter return a reference that could outlive the BurnTokenEvent struct, potentially causing use-after-free if the event is dropped? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Field: id] [TokenDataId Tampering] Can the TokenDataId within TokenId have its creator, collection, or name fields modified after event creation to point to different tokens? (High)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Field: id] [Address Collision] If two tokens have the same TokenDataId due to address collision, can a burn event for one token accidentally affect the supply of both? (High)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Function: new()] [Missing Validation] Does the new() constructor validate its inputs (TokenId validity, amount > 0), or can it create invalid burn events that bypass Move-side checks? (High)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Function: new()] [Ownership Transfer] Does new() take ownership of the TokenId or clone it, and could this lead to double-burn scenarios if the same TokenId reference is reused? (High)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Function: new()] [Uninitialized Fields] Are all fields of BurnTokenEvent guaranteed to be initialized by new(), or could partially initialized instances escape through unsafe code? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Function: new()] [Amount Validation] Does new() enforce a maximum burn amount per event to prevent extreme supply changes in a single transaction? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_token_event.rs] [Struct: BurnTokenEvent] [Event Ordering] Can burn events be emitted out of order, causing indexers to process a burn before the corresponding mint, leading to negative supply calculations? (High)"
]