[
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Macro: NonZeroUsize!] [Panic-based DoS] Can an attacker cause a validator node crash by triggering the NonZeroUsize! macro with a zero value during runtime, leading to a panic via .expect() that terminates the validator process and affects network liveness? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Macro: NonZeroUsize!] [Panic propagation] Does the macro's use of .expect() in line 12 create unrecoverable panics in critical consensus paths, where a zero value from configuration or runtime calculation could crash the entire validator without graceful error handling? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Macro: NonZeroUsize!] [Expression evaluation] Can attackers exploit the fact that the macro evaluates the expression $num before checking for zero (line 12), allowing side effects from the expression to execute even when the value is zero, potentially causing state corruption before the panic occurs? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Macro: NonZeroUsize!] [Integer overflow] Can an attacker provide input that causes integer overflow during the expression evaluation in $num (line 8), where the overflow wraps to zero or another value, bypassing the intended NonZeroUsize guarantee and creating invalid state? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Macro: NonZeroUsize!] [Type confusion] Does the macro properly handle all usize expression types, or can complex expressions involving unsafe casts, pointer arithmetic, or underflow result in zero values that violate the NonZeroUsize invariant before the check? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Macro: NonZeroUsize!] [Custom message exploit] Can the custom error message parameter $message (line 11) be exploited through injection attacks, where malicious strings in panic messages could leak sensitive validator information or be logged in ways that reveal internal state? (Low)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Macro: NonZeroUsize!] [Macro hygiene] Are there macro hygiene issues where the NonZeroUsize! macro could capture variables from the calling scope, leading to unexpected behavior or security vulnerabilities in modules using this macro? (Low)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Macro: NonZeroUsize!] [Compile-time vs runtime] Since the macro performs runtime checking via .expect() rather than compile-time validation, can attackers manipulate runtime inputs to trigger panics in production that weren't caught during testing? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: consensus/round_manager.rs:385] [Consensus halt] In RoundManager's blocks_with_broadcasted_fast_shares LRU cache initialization using NonZeroUsize::new(5).expect(), can a configuration error or code path that evaluates to zero cause validator panic during consensus initialization, halting the validator and affecting network progress? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: consensus/round_manager.rs:385] [Hard-coded capacity] The RoundManager uses a hard-coded LRU capacity of 5 via NonZeroUsize::new(5) - can this fixed size be exploited by Byzantine validators to cause cache thrashing or memory exhaustion during high-throughput fast share broadcasting? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: consensus/round_manager.rs:385] [Byzantine block flooding] If the NonZeroUsize capacity for blocks_with_broadcasted_fast_shares is too small (5 blocks), can malicious validators flood the cache with unique block IDs to evict legitimate entries, breaking fast share tracking and consensus optimization? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: consensus/round_manager.rs] [Cache sizing attack] Can attackers manipulate the validator to process blocks at a rate that exceeds the LRU cache capacity (defined via NonZeroUsize), causing deterministic eviction patterns that degrade consensus performance or create timing attacks? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: storage/state_merkle_db.rs:89] [State corruption] In StateMerkleDB's LruNodeCache initialization using NonZeroUsize::new(max_nodes_per_lru_cache_shard), can a configuration that results in zero cause the cache initialization to panic, leaving the state storage in an inconsistent state and corrupting the Jellyfish Merkle tree? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: storage/state_merkle_db.rs:89] [Merkle verification bypass] If the LruNodeCache capacity via NonZeroUsize is set too low due to misconfiguration, can attackers cause excessive cache evictions that force repeated disk reads, creating timing side-channels that leak information about state access patterns? (Low)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: storage/state_merkle_db.rs:89] [Resource exhaustion] Can the NonZeroUsize capacity for LruNodeCache be manipulated through configuration to be unreasonably large (e.g., usize::MAX - 1), causing memory exhaustion when the cache is fully populated during state synchronization? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: storage/state_merkle_db.rs:89] [Sharded cache imbalance] With NUM_STATE_SHARDS creating multiple LruNodeCache instances each with NonZeroUsize capacity, can uneven state distribution cause some shards to experience cache thrashing while others are underutilized, degrading Merkle proof generation performance? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: storage/hot_state.rs:362] [State cache poisoning] In HotStateLRU test properties using NonZeroUsize::new(n).unwrap(), can the use of .unwrap() instead of .expect() with descriptive messages hide critical errors during property testing, allowing cache bugs to propagate to production? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: storage/hot_state.rs] [Transaction execution delay] If HotStateLRU's capacity via NonZeroUsize is configured too small, can attackers craft transaction sequences that deliberately miss the cache, forcing expensive state reads from disk and degrading transaction execution throughput? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: storage/hot_state.rs] [Determinism violation] Can different validators using different NonZeroUsize capacity configurations for HotStateLRU experience different cache behaviors, leading to subtle timing differences that compound into consensus disagreement over transaction execution results? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: channel/aptos_channel.rs:242] [Message queue DoS] In aptos_channel::new() using NonZeroUsize! for max_queue_size_per_key, can a zero value passed as max_queue_size_per_key cause channel initialization to panic, preventing critical consensus messages from being delivered and halting network progress? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: channel/aptos_channel.rs:242] [Queue overflow] If the NonZeroUsize queue capacity is set too low, can malicious validators flood the channel with messages that exceed the per-key queue size, causing message drops that violate consensus message delivery guarantees? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: channel/aptos_channel.rs:242] [Backpressure bypass] Can attackers exploit the fixed NonZeroUsize queue capacity by sending messages just under the limit repeatedly, preventing legitimate high-priority consensus messages from being processed due to queue exhaustion? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: channel/aptos_channel.rs:242] [Custom panic message] The aptos_channel uses custom message 'aptos_channel cannot be of size 0' - can this error message appear in logs in ways that reveal internal channel configuration to attackers monitoring validator logs? (Low)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: move-vm/verified_module_cache.rs:17] [Module verification bypass] The VerifiedModuleCache uses const VERIFIED_CACHE_SIZE with NonZeroUsize::new(100_000).unwrap() - can a compilation environment where this evaluates to zero cause validator startup to fail, preventing the network from processing Move transactions? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/nonzero.rs] [Usage: move-vm/verified_module_cache.rs:17] [Cache poisoning attack] With VerifiedModuleCache capacity of 100,000 modules via NonZeroUsize, can attackers deploy junk modules that fill the cache, evicting legitimate verified modules and forcing expensive re-verification that degrades transaction execution performance? (High)"
]