[
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Function: PeerMonitoringMetadata::new()] [Invariant violation] Can PeerMonitoringMetadata be constructed with average_ping_latency_secs < latest_ping_latency_secs, violating the expected invariant that average should smooth out spikes, leading to incorrect peer prioritization in mempool? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Trait: Display for PeerMonitoringMetadata] [Format string injection] When formatting metadata for logs, can attackers inject format string directives through NetworkInformationResponse or NodeInformationResponse Display implementations that get interpolated by the outer Display, causing log injection or information disclosure? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Trait: Debug for PeerMonitoringMetadata] [Missing internal_client_state] Debug formatting explicitly excludes internal_client_state - if debug logs are used for security auditing, can attackers hide malicious state in this field that never appears in debug output but affects runtime behavior? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Function: display_format_option()] [Unbounded output] The display formatting functions don't limit string length - can extremely verbose NetworkInformationResponse or NodeInformationResponse values cause log overflow, filling disk storage and triggering log rotation that purges important security events? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Function: debug_format_option()] [Recursive formatting] If NetworkInformationResponse contains references to other peers' metadata, can recursive debug formatting create infinite loops or stack overflows when displaying cyclic peer relationships? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Integration: Mempool] [Transaction routing] Since mempool uses PeerMonitoringMetadata to prioritize peers for transaction forwarding, can an attacker with multiple nodes provide fake metadata to monopolize transaction flow, enabling front-running attacks by ensuring all transactions pass through their infrastructure first? (Critical)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Integration: Mempool] [Sybil attack amplification] Can an attacker create multiple peer identities with fake low-latency PeerMonitoringMetadata to occupy all top priority slots in mempool's peer ranking, starving honest peers of transaction traffic and degrading network propagation speed? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Integration: Mempool] [Load balancing bypass] Can attackers report identical low latencies across all their Sybil nodes to defeat load balancing logic, ensuring they receive transaction duplicates from all sender buckets and gaining complete visibility into mempool contents for MEV extraction? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Integration: Mempool] [Failover poisoning] If primary peers fail, mempool falls back to peers with Failover priority - can attackers position themselves as failover peers with slightly higher but still fake-low latencies to take over transaction routing during network instability? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Integration: Consensus Observer] [Subscription manipulation] Since consensus observer uses distance_from_validators and ping latencies for subscription selection, can malicious peers provide fake metadata to become preferred subscription targets, allowing them to filter or delay consensus messages and degrade finality? (Critical)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Integration: Consensus Observer] [Eclipse attack] Can an attacker surround a fullnode with colluding peers all reporting distance=1 from validators with low latency, causing the fullnode to exclusively subscribe to attacker-controlled consensus observers and receive censored or forked chain views? (Critical)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Integration: Consensus Observer] [Subscription starvation] Can Byzantine nodes report extremely low latencies to monopolize all consensus observer subscription slots, preventing honest fullnodes from subscribing to legitimate validators and causing them to fall behind or fork? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Integration: State Sync] [Data source manipulation] Can attackers provide fake PeerMonitoringMetadata to become preferred data sources for state synchronization, allowing them to serve corrupted state data or selectively withhold critical transactions to partition the network? (Critical)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Integration: State Sync] [Snapshot poisoning] If state sync prioritizes peers with low distance and latency for snapshot downloads, can attackers position themselves as top-priority snapshot sources and serve snapshots at incorrect versions to cause sync failures? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Derive: Default for PeerMonitoringMetadata] [Unsafe defaults] The Default implementation creates all-None metadata - can code paths that rely on Default accidentally use uninitialized metadata for peer selection, causing random peer prioritization or selection of disconnected peers? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Derive: Default for PeerMonitoringMetadata] [Zombie peers] If a peer's metadata is reset to Default after disconnection but before removal from peer maps, can stale Default metadata cause the disconnected peer to be selected for transaction forwarding, resulting in failed sends and retransmission storms? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Derive: Clone for PeerMonitoringMetadata] [Deep copy cost] Since PeerMonitoringMetadata contains nested Option<NetworkInformationResponse> with BTreeMap<PeerNetworkId, ConnectionMetadata>, can excessive cloning during peer prioritization updates cause CPU spikes that delay transaction processing? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Derive: Clone for PeerMonitoringMetadata] [State inconsistency] If PeerMonitoringMetadata is cloned for comparison while being updated concurrently, can torn reads cause mempool to make prioritization decisions based on partially updated metadata where distance is new but latency is old? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Derive: PartialEq for PeerMonitoringMetadata] [Float semantics] PartialEq for f64 fields uses IEEE 754 semantics where NaN != NaN - can this cause PeerMonitoringMetadata comparisons to be non-reflexive (metadata != metadata), breaking hash map lookups and causing peer metadata leaks? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Derive: PartialEq for PeerMonitoringMetadata] [Transitive violation] If two metadata instances have slightly different f64 values due to floating-point errors but compare equal via PartialEq, can this violate transitivity (A == B && B == C but A != C) and corrupt sorted peer lists? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Field: distance_from_validators via latest_network_info_response] [Recursive distance poisoning] Since distance is calculated recursively (node distance = min(peer distances) + 1), can an attacker with one compromised low-distance peer infect the entire network's distance calculations, making all nodes incorrectly believe they're close to validators? (Critical)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Field: distance_from_validators via latest_network_info_response] [Distance oscillation] Can attackers alternate between reporting distance=1 and distance=99 in their metadata to cause peer prioritization to oscillate, triggering continuous re-prioritization that wastes CPU and disrupts transaction forwarding? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Field: distance_from_validators via latest_network_info_response] [Validator impersonation] If a fullnode receives NetworkInformationResponse claiming distance=0 from a peer without verifying that peer actually has validator role, can non-validators impersonate validators to gain priority in all peer selection algorithms? (Critical)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Field: average_ping_latency_secs] [Negative latency] Can attackers exploit float encoding to report negative ping latencies that sort higher than all positive latencies, gaining top priority in mempool and consensus observer selection? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Field: average_ping_latency_secs] [Zero latency] Can reporting exactly 0.0 for ping latency bypass comparison logic that uses latency differences, causing the peer to be treated as infinitely fast and monopolizing all traffic? (Medium)"
]