[
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Field: enable_cache_compression] [Toggle attack] Can an attacker who can modify configuration trigger a format change between compressed and uncompressed cache storage, potentially corrupting cached data or causing the service to serve invalid transaction data from incompatible cache entries? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Field: txns_to_strip_filter] [Filter bypass] The BooleanTransactionFilter is used to strip sensitive transaction data (payload, signature, events, writesets) - can an attacker craft transactions that bypass the filter logic through edge cases in the boolean expression evaluation, causing sensitive data to be leaked? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: default_txns_to_strip_filter()] [Empty OR vulnerability] The default filter uses BooleanTransactionFilter::new_or(vec![]) which matches no transactions - can an attacker exploit race conditions where the filter is temporarily set to this default, causing all transactions to pass through unstripped during configuration reload? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: run()] [Filter clone safety] At line 184, txns_to_strip_filter is cloned into RawDataServerWrapper - can this clone operation fail for complex filters, or can an attacker exploit deep clone behavior to cause memory exhaustion with extremely nested boolean expressions? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Field: txns_to_strip_filter] [Filter DoS] Can an attacker configure extremely complex BooleanTransactionFilter expressions that cause excessive CPU usage during transaction evaluation, effectively creating a denial of service by making transaction processing prohibitively slow? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Field: txns_to_strip_filter] [Incomplete stripping] The documentation mentions stripping payload, signature, events, and writesets - can an attacker exploit transactions where the filter matches but stripping is incomplete, leaking partial sensitive data like transaction metadata or gas information? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: run()] [Race condition between servers] At lines 197-235, both TLS and non-TLS servers can be spawned concurrently using tokio::spawn - can race conditions between these servers cause port binding conflicts, inconsistent state, or one server to start before shared resources are fully initialized? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: run()] [Task panic handling] The servers are spawned with tokio::spawn but errors are only caught by try_join_all at line 237 - can an attacker cause one server to panic, potentially bringing down both servers or leaving the service in an inconsistent state with only partial availability? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: run()] [Service clone safety] At lines 194-195, svc and reflection_service are cloned - can these clones share mutable state that leads to race conditions when both TLS and non-TLS servers process requests concurrently, potentially causing data corruption in cached responses? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: run()] [Graceful shutdown] There's no explicit shutdown handling in the run() function - can an attacker exploit the lack of graceful shutdown to cause data loss in in-flight transactions or corrupt the cache state when the service is terminated? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: run()] [Address binding race] At lines 199 and 216, listen_address is extracted from config - can an attacker exploit TOCTOU race conditions where the address is validated during config parsing but changed before binding, potentially causing the service to bind to attacker-controlled interfaces? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: run()] [HTTP/2 keepalive exploitation] The HTTP2_PING_INTERVAL_DURATION is set to 60 seconds and HTTP2_PING_TIMEOUT_DURATION to 10 seconds - can an attacker exploit these values by establishing many connections and letting them timeout, causing the server to waste resources on dead connection cleanup? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Constant: HTTP2_PING_INTERVAL_DURATION] [Connection exhaustion] The 60-second ping interval may be too long - can an attacker hold many connections open without sending pings, exhausting the server's connection limit and preventing legitimate indexer clients from connecting? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: run()] [Compression algorithm] At lines 152-154 and 189-191, both Zstd and Gzip compression are enabled - can an attacker exploit compression ratio attacks by requesting data with high compression ratios, causing excessive CPU usage during decompression that leads to service degradation? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: run()] [Reflection service exposure] The gRPC reflection service is enabled at lines 141-154 - can an attacker use reflection to enumerate all available services and methods, potentially discovering undocumented or debug endpoints that expose sensitive indexer internals? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: run()] [File descriptor registration] At lines 147-149, multiple file descriptor sets are registered - can an attacker exploit missing or incorrect descriptor registrations to cause reflection to return incomplete or incorrect schema information, leading to client errors or unexpected behavior? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: run()] [Cache initialization race] At lines 171-177, InMemoryCache is created with Redis connection - can an attacker exploit race conditions between cache initialization and first request processing to cause cache misses, stale data, or inconsistent reads? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: run()] [Cache Arc safety] The InMemoryCache is wrapped in Arc::new() at line 186 - can concurrent access from both TLS and non-TLS servers cause race conditions in cache operations despite Arc, potentially leading to inconsistent transaction data being served? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Field: in_memory_cache_config] [Cache size limits] The InMemoryCacheConfig is used but not validated for reasonable limits in this file - can an attacker configure excessive cache sizes that cause memory exhaustion, or zero-sized caches that cause all requests to hit Redis/file store, creating performance degradation? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: run()] [Cache warmup] There's no cache warmup logic - can an attacker exploit cold cache scenarios after service restart to cause cascading failures by overwhelming the file store or Redis with requests before the cache is populated? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: run()] [Server wrapper creation] At lines 180-187, RawDataServerWrapper is created with multiple dependencies - can an attacker exploit the error handling in this constructor to leak sensitive information about file store configuration or Redis connection details through error messages? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Function: run()] [Channel size exploitation] The data_service_response_channel_size is passed to RawDataServerWrapper - can an attacker exploit mismatches between this channel size and actual request volumes to cause response buffering issues, dropped responses, or deadlocks? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Field: file_store_config] [File store path validation] The IndexerGrpcFileStoreConfig is passed without additional validation - can an attacker manipulate file store paths to perform directory traversal attacks, reading arbitrary files from the filesystem or writing cached data to attacker-controlled locations? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Struct: IndexerGrpcDataServiceConfig] [Deserialization bomb] The serde deny_unknown_fields attribute requires exact field matching - can an attacker craft deeply nested JSON/YAML configurations that pass deserialization but cause stack overflow or excessive memory usage during validation? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service/src/config.rs] [Struct: TlsConfig] [Path injection in serde] The cert_path and key_path are deserialized as raw strings - can an attacker inject null bytes, unicode exploits, or special characters that cause file system operations to behave unexpectedly when these paths are used? (High)"
]