[
  "[File: aptos-core/third_party/move/move-model/src/lib.rs] [DoS: Recursive Module Collection] collect_related_modules_recursive() has no depth limit - can deeply nested or circular dependencies cause stack overflow or excessive recursion? (High)",
  "[File: aptos-core/third_party/move/move-model/src/lib.rs] [DoS: Large Address Maps] Can extremely large address_map in PackageInfo cause memory exhaustion during compilation? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/lib.rs] [DoS: Many Source Files] Can providing an excessive number of source files in PackageInfo.sources cause compilation timeouts or memory exhaustion? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/lib.rs] [DoS: Deep Module Dependencies] Can an attacker create a chain of modules where each depends on the next, causing excessive memory usage in visited_modules BTreeSet? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/lib.rs] [DoS: Large Documentation Comments] Lines 217-226 add documentation - can extremely large documentation strings cause memory exhaustion? (Low)",
  "[File: aptos-core/third_party/move/move-model/src/lib.rs] [Symbol: Module Name Construction] Line 353-359 constructs ModuleName from address bytes and symbols - can symbol pool manipulation cause name collisions? (High)",
  "[File: aptos-core/third_party/move/move-model/src/lib.rs] [Symbol: Pseudo Script Names] Line 369 generates pseudo script names - can these collide with actual module names? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/lib.rs] [Symbol: Named Address Resolution] Multiple functions resolve named addresses to numerical addresses - can inconsistent resolution across the codebase cause security issues? (High)",
  "[File: aptos-core/third_party/move/move-model/src/lib.rs] [Name: Module Table Insertion] Line 363 inserts into module_table - can hash collisions or duplicate insertions cause modules to overwrite each other? (Critical)",
  "[File: aptos-core/third_party/move/move-model/src/lib.rs] [Name: Friend Module Names] Friend declarations use ModuleName - can name confusion between different representations (full name vs short name) cause friend check bypasses? (High)",
  "[File: aptos-core/third_party/move/move-model/src/lib.rs] [Concurrency: GlobalEnv Mutation] GlobalEnv is mutated throughout the compilation process - can concurrent compilations cause race conditions if the environment is shared? (High)"
]