[
  "[File: aptos-core/types/src/account_config/resources/aggregator.rs] [Function: state_key()] [TableHandle validation] Does state_key() validate that TableHandle(handle) points to a legitimate table, or can forged handles access arbitrary storage locations including system tables? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/aggregator.rs] [Struct: OptionalAggregatorV1Resource] [Invariant violation] Can OptionalAggregatorV1Resource have both aggregator and integer fields set simultaneously, breaking the mutual exclusion invariant and causing undefined behavior in supply tracking? (High)",
  "[File: aptos-core/types/src/account_config/resources/aggregator.rs] [Struct: IntegerResource] [Limit enforcement] Does IntegerResource enforce its limit field during value updates, or is it purely informational allowing integer values to exceed limits and bypass supply caps? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/aggregator.rs] [Generic type T] [Type confusion] Can AggregatorResource<T> and AggregatorSnapshotResource<T> be instantiated with incompatible types causing type confusion when deserializing u64 aggregators as u128 or vice versa? (High)",
  "[File: aptos-core/types/src/account_config/resources/fungible_store.rs] [Field: balance] [Integer overflow] Can balance field overflow u64::MAX during deposits, causing balance wrapping to zero and complete loss of deposited fungible assets? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/fungible_store.rs] [Field: frozen] [Freeze bypass] Can frozen fungible stores be unfrozen by directly modifying the frozen field during deserialization, bypassing asset freeze mechanisms intended for compliance? (High)",
  "[File: aptos-core/types/src/account_config/resources/fungible_store.rs] [Field: metadata] [Metadata mismatch] Can metadata AccountAddress be changed to point to different fungible asset metadata, enabling type confusion attacks where one asset type is treated as another? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/fungible_store.rs] [Function: primary_apt_store()] [Address collision] Can primary_apt_store() generate colliding addresses for different user accounts via create_derived_object_address(), causing multiple users to share the same APT store? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/fungible_store.rs] [Struct: ConcurrentFungibleBalanceResource] [Aggregator consistency] Does ConcurrentFungibleBalanceResource maintain consistency between aggregator value and actual balance during concurrent modifications, or can race conditions cause balance corruption? (High)",
  "[File: aptos-core/types/src/account_config/resources/fungible_store.rs] [Function: new() for ConcurrentFungibleBalanceResource] [Max value] Why is max_value set to u64::MAX - can this cause overflow when incrementing balance, or should it enforce actual supply limits? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/fungible_store.rs] [Struct: MigrationFlag] [Migration exploit] Can MigrationFlag be manipulated during coin-to-fungible-asset migration to bypass migration checks, enabling double-claiming of assets in both old and new systems? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/chain_id.rs] [Field: chain_id] [Replay attack] Can chain_id u8 value be manipulated to accept transactions from different chains (testnet/mainnet), enabling cross-chain replay attacks and theft of funds? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/chain_id.rs] [Function: chain_id()] [Type conversion] Does ChainId::new(u8) properly validate the chain_id value range, or can invalid chain IDs cause transaction validation failures or consensus issues? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/chain_id.rs] [OnChainConfig implementation] [Configuration override] Can ChainIdResource be modified post-genesis to change the chain ID, breaking transaction signature validation and enabling replay attacks? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/token_store.rs] [Field: direct_transfer] [Authorization bypass] Can direct_transfer flag be flipped to true during deserialization, bypassing opt-in transfer protection and enabling unauthorized token theft? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/token_store.rs] [Struct: Table] [Handle validation] Does Table struct validate that handle points to a legitimate storage table, or can attackers forge table handles to access other users' token inventories? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/token_store.rs] [Field: tokens] [Table corruption] Can the tokens table handle be corrupted during deserialization to point to wrong storage, causing token balance queries to return incorrect or other users' tokens? (High)",
  "[File: aptos-core/types/src/account_config/resources/token_store.rs] [Event handles] [Event ordering] Can mutate_token_property_events be manipulated to have non-sequential sequence numbers, breaking event ordering guarantees and causing indexer inconsistencies? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Field: collection] [Collection spoofing] Can collection Object reference be changed to point to a different collection, enabling token ownership transfer across collections or creating counterfeit tokens? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Field: index] [Index manipulation] Can index field be manipulated to duplicate token indices within a collection, causing multiple tokens to appear as the same index and enabling double-spending? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Fields: name/description/uri] [String injection] Do string fields properly sanitize inputs during deserialization, or can malicious UTF-8 sequences, null bytes, or control characters cause crashes or exploits? (Low)",
  "[File: aptos-core/types/src/account_config/resources/collection.rs] [Field: creator] [Creator forgery] Can creator AccountAddress be changed during deserialization to impersonate collection creators, enabling unauthorized collection modifications or royalty theft? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/collection.rs] [Fields: name/description/uri] [Metadata integrity] Are collection metadata fields immutable after creation, or can deserialization allow metadata changes that violate collection immutability guarantees? (High)",
  "[File: aptos-core/types/src/account_config/resources/object.rs] [Field: owner] [Ownership theft] Can owner AccountAddress be directly modified during deserialization to transfer object ownership without proper transfer ceremony and ownership checks? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/object.rs] [Field: allow_ungated_transfer] [Transfer bypass] Can allow_ungated_transfer be set to true for objects that should require gated transfers, bypassing transfer restrictions and enabling theft? (High)"
]