[
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: register_sleep()] [Panic on assert] At lines 301-304, assert!(prev_entry.is_none()) will panic if index collides - if this occurs in a production test environment, can it cause false test failures that mask real consensus bugs? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: drop()] [Panic during drop] If MockSleep::drop panics while locking at line 402, can this cause undefined behavior or abort the entire test/validator process? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: sleep_blocking()] [Blocking on async] At lines 211-214, futures::executor::block_on is used - if called from an async context in consensus code, can this cause deadlock or panic? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: sleep_blocking()] [Auto-advance in blocking] When sleep_blocking is called with auto-advance enabled, will the sleep resolve immediately, or can it block forever if auto_advance_deadline is exceeded? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance()] [Multiple advance calls] Can calling advance() multiple times rapidly cause cumulative time advancement that exceeds u64::MAX duration, wrapping time and breaking consensus ordering? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance_secs/advance_ms()] [Unit confusion] Functions at lines 143-150 convert u64 to Duration - can passing very large values (near u64::MAX seconds) cause Duration construction to overflow or panic? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: reset()] [Multiple resets] Can calling reset() multiple times on the same MockSleep without polling cause waker updates to be lost, preventing the sleep from ever waking? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: now_unix_time()] [Unix time assumption] At line 204, self.lock().now returns Duration directly - does consensus code assume this is actual unix time, and can the simulated time starting at 0 break timestamp validation? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance_next()] [Consensus ordering] If consensus timeout logic calls advance_next() expecting strictly increasing wake times, can the max() at line 228 returning current time for past deadlines break timeout ordering invariants? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance()] [Timeout fairness] The advance function at lines 233-254 wakes all expired waiters - if many consensus timeouts expire simultaneously, can the wakeup order (based on SleepIndex) affect which validator proposals are processed first, introducing bias? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: sleep()] [Timeout precision] When consensus code creates timeouts with sleep(), can the lack of real hardware timing in mock mode cause tests to miss race conditions that only appear with actual timing jitter? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Struct: MockTimeService] [Test isolation] If multiple consensus tests share a single MockTimeService instance, can time advancement in one test affect another test's timeouts, causing test interference? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: now()] [Clock monotonicity] Does the now() function guarantee monotonicity if called repeatedly, or can concurrent advance() calls cause time to appear to move backwards to different threads? (Critical)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: is_elapsed()] [TOCTOU race] The is_elapsed function at lines 353-356 checks if sleep is registered, but between check and use, can another thread trigger the sleep, causing the caller to make decisions on stale information? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance()] [Iterator invalidation] At lines 241-245, .position() iterates pending.keys(), but if another thread modifies pending concurrently, can the Mutex guarantee prevent this or is there undefined behavior? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: unregister_min_sleep()] [Double removal] If two threads call unregister_min_sleep concurrently, can both get the same entry from keys().next() before either removes it, causing the second remove to fail unexpectedly? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: register_sleep()] [Corrupted pending queue] If auto_advance logic at line 291 advances time but a panic occurs before returning at line 292, can the sleep be lost (not registered but time advanced), causing consensus timeouts to never fire? (Critical)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance()] [Partial wakeup] If waker.wake() panics at line 329 during the loop at lines 248-251, can some waiters be removed from pending without being woken, causing permanent hangs? (Critical)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: reset()] [Lost sleep entry] If unregister_sleep at line 364 succeeds but register_sleep at line 367 panics, can the sleep be lost entirely, causing the task to never wake and consensus to stall? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance()] [O(n) iteration] The advance function iterates all pending entries to find expired ones at lines 241-245 - can an attacker create many sleeps with far-future deadlines to slow down advance(), causing consensus timeouts to miss their windows? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: unregister_min_sleep()] [Inefficient removal] Lines 317-320 copy keys before removal instead of using pop_first (which isn't stable) - can repeated calls to advance_next() cause O(n) overhead per wakeup, slowing consensus? (Low)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Struct: Inner] [BTreeMap overhead] Using BTreeMap for pending queue provides ordering but at O(log n) insert/remove cost - can consensus create enough concurrent timeouts to make this overhead significant? (Low)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: new()] [Test isolation] MockTimeService::new() at lines 90-100 initializes with shared state - if test teardown doesn't properly clean up, can one test's time state leak into another, causing false positives/negatives? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: new_auto_advance()] [Test realism] Using auto_advance in consensus tests (line 103-105) makes all timeouts resolve instantly - can this hide real-world timing bugs where consensus depends on specific timeout ordering? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance_async()] [Test flakiness] The yield_now() at line 174 introduces non-determinism from tokio scheduler - can this cause consensus tests to be flaky, making it hard to distinguish real bugs from test artifacts? (High)"
]