[
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: get_account_transaction_summaries_iter()] [Limit enforcement] Is the limit parameter properly enforced to prevent attackers from requesting excessive results causing memory exhaustion, or can limit be set to u64::MAX? (High)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: get_account_transaction_summaries_iter()] [Schema mismatch] Can there be inconsistencies between TransactionSummariesByAccountSchema and the actual transaction data, where summaries exist but transactions are missing or vice versa? (High)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: get_account_transaction_summaries_iter()] [Race condition on scan direction] If multiple concurrent requests use different scan directions for the same account, can this cause iterator corruption or return overlapping/duplicate transactions? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: get_account_transaction_summaries_iter()] [Ledger version consistency] When ledger_version is checked inside AccountTransactionSummariesIter, can there be TOCTOU issues where the ledger advances during iteration causing inconsistent visibility of transactions? (High)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: get_account_transaction_summaries_iter()] [seek_for_prev boundary] At lines 115 and 130, seek_for_prev is used. If the sought version doesn't exist, does this correctly position before the next lower version, or can it skip transactions? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_by_account()] [Partial pruning failure] If db_batch.delete() at line 153 fails midway through the transactions vector, does this leave the database in an inconsistent state with some transactions pruned and others not? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_by_account()] [Version ignored] The function receives (Version, Transaction) tuples but only uses the Transaction part and ignores Version at line 149. Can this cause pruning to delete wrong transactions if Version and Transaction.sequence_number don't match? (High)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_by_account()] [ReplayProtector bypass] At line 151, only transactions with ReplayProtector::SequenceNumber are pruned. Can attackers exploit alternative replay protector types to prevent their transactions from being pruned, causing database bloat? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_by_account()] [Batch atomicity] Is the SchemaBatch commit atomic, or can a crash during commit cause partial deletions from OrderedTransactionByAccountSchema leaving orphaned entries? (High)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_by_account()] [State synchronization] If pruning occurs while get_account_ordered_transactions_iter() is active, can this cause iterators to return inconsistent results or crash with missing data errors? (High)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_by_account()] [Transaction type filtering] The function uses try_as_signed_user_txn() to filter transactions. Can non-user transactions (genesis, block metadata) be incorrectly pruned or left behind causing schema inconsistency? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_by_account()] [Duplicate sequence numbers] If the database contains duplicate sequence numbers due to a bug, does this function prune all duplicates or only the first, potentially leaving corrupted data? (High)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_by_account()] [Cross-schema consistency] This function only prunes OrderedTransactionByAccountSchema. If TransactionSummariesByAccountSchema is not pruned simultaneously, can this create schema inconsistencies where summaries exist without underlying transactions? (High)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_by_account()] [Error propagation] If the schema delete operation fails, does the error properly propagate to halt the pruning operation, or can it be silently ignored causing incomplete pruning? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_by_account()] [Concurrent pruning] Can multiple concurrent pruning operations on the same account cause race conditions leading to double-deletion errors or missing deletions? (High)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_summaries_by_account()] [Version mismatch] This function uses version from the tuple at line 165, while prune_transaction_by_account() uses sequence number. Can this discrepancy cause some summaries to be pruned while their transactions remain, or vice versa? (High)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_summaries_by_account()] [Partial batch failure] If deletion fails midway through the transactions vector, are previous deletions rolled back, or does this leave TransactionSummariesByAccountSchema in a partially pruned state? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_summaries_by_account()] [Schema corruption] Can inconsistencies between the key format (txn.sender(), version) and the actual schema layout cause deletions to target wrong entries or miss intended entries? (High)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_summaries_by_account()] [Transaction filtering] Like prune_transaction_by_account, this only processes signed user transactions. Can this leave non-user transaction summaries behind causing accumulation of unprunable data? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_summaries_by_account()] [Concurrent read impact] If API queries read from TransactionSummariesByAccountSchema while pruning is happening, can this cause query failures, incomplete results, or iterator crashes? (High)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: prune_transaction_summaries_by_account()] [Orphaned summaries] If a transaction summary exists for a version that was already pruned from the main transaction store, does this function properly clean it up, or are orphaned summaries left behind? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Struct: TransactionStore] [Shared state] The TransactionStore holds an Arc<LedgerDb> at line 28. Can concurrent access from multiple threads cause race conditions in the underlying LedgerDb leading to state corruption? (High)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Struct: TransactionStore] [Clone safety] The TransactionStore derives Clone at line 26. Can cloning and using multiple instances concurrently cause inconsistent views of the database state during updates? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Function: new()] [Initialization validation] Does the new() constructor at line 32 validate that the LedgerDb is properly initialized, or can it accept a corrupted or uninitialized database causing undefined behavior? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/transaction_store/mod.rs] [Cross-function] [Schema consistency] Between get_account_ordered_transaction_version() using OrderedTransactionByAccountSchema and get_account_transaction_summaries_iter() using TransactionSummariesByAccountSchema, can schema inconsistencies cause the same transaction to appear in one but not the other? (High)"
]