[
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: MAX_JSON_REQUEST_RETRY_SECONDS] [Content type bypass] Can attackers serve HTML or XML files with application/json Content-Type headers to bypass JSON parsing logic and potentially inject malicious content into the CDN? (Medium)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: DEFAULT_MAX_IMAGE_DIMENSIONS] [Format-specific attacks] Does the 4096px dimension limit apply consistently across all image formats (PNG, JPEG, GIF, AVIF, WebP)? Can attackers exploit format-specific decoders by sending malformed images that report false dimensions? (Medium)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: DEFAULT_IMAGE_QUALITY] [Animated image bypass] Since GIF and AVIF formats bypass image optimization, can attackers create 15MB animated GIFs with thousands of frames to consume excessive GCS storage and CDN bandwidth without any size reduction? (Medium)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: IPFS_AUTH_KEY] [SSRF via IPFS parsing] When the URI parser constructs IPFS gateway URLs with pinataGatewayToken, can attackers inject CRLF characters or URL fragments into the CID to manipulate the final URL and cause SSRF attacks against internal services? (High)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: IPFS_AUTH_KEY] [Path traversal] If the IPFS URI parser allows paths after the CID, can attackers craft URIs like 'ipfs://CID/../../../etc/passwd?pinataGatewayToken=X' to access unintended files or cause path traversal vulnerabilities? (Medium)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: MAX_ASSET_UPLOAD_RETRY_SECONDS] [Upload race condition] During the 180-second upload timeout, can multiple workers simultaneously attempt to upload the same asset_uri to Cloudflare, causing duplicate uploads and wasted storage costs? (Low)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: MAX_ASSET_UPLOAD_RETRY_SECONDS] [Metadata injection] When uploading assets with metadata containing the asset_uri, can attackers craft URIs with JSON escape sequences or SQL injection payloads that corrupt the Cloudflare metadata storage? (Medium)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: MAX_RETRY_TIME_SECONDS] [Backoff timing attack] With only 2 seconds for exponential backoff, does this allow only 3-4 retry attempts? Can attackers exploit predictable retry timing to launch synchronized attacks when they know the crawler will retry? (Low)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: MAX_RETRY_TIME_SECONDS] [Thundering herd] If many URIs fail simultaneously, can the uniform 2-second backoff window cause a thundering herd problem where all retries happen at once, overwhelming both the crawler and target servers? (Medium)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: DEFAULT_MAX_FILE_SIZE_BYTES] [Memory fragmentation] When processing many 15MB files concurrently, can memory fragmentation occur due to large allocations being freed and reallocated, degrading performance and potentially causing allocation failures? (Medium)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: DEFAULT_MAX_IMAGE_DIMENSIONS] [Buffer allocation] When resizing images to 4096px dimensions, does the RGBA8 buffer allocation (4096 * 4096 * 4 = 67MB per image) account for concurrent processing? Can memory exhaustion occur with multiple workers processing max-size images? (High)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: DEFAULT_MAX_FILE_SIZE_BYTES] [HEAD vs GET mismatch] If file size validation uses HEAD requests with MAX_HEAD_REQUEST_RETRY_SECONDS (15s) timeout, can servers return different Content-Length values for HEAD vs GET requests to bypass the 15MB limit? (High)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: DEFAULT_MAX_NUM_PARSE_RETRIES] [Retry reset vulnerability] Can attackers manipulate the last_transaction_version field in the database to reset retry counters, effectively bypassing the 3-retry limit and forcing infinite reprocessing of malicious URIs? (Medium)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: MAX_IMAGE_REQUEST_RETRY_SECONDS] [Slowloris variant] Can attackers create image servers that send the first byte immediately but then transmit the remaining data at 1 byte per second for 89 seconds, maximizing connection time and exhausting the worker pool? (High)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constants: All timeout values] [Timeout stacking] Can attackers craft attack scenarios that stack multiple timeouts (e.g., 2s retry + 30s JSON timeout + 90s image timeout + 180s upload timeout) to tie up a single worker for up to 302 seconds? (Medium)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: DEFAULT_IMAGE_QUALITY] [Quality inconsistency] Since images without transparency use JPEG at 100% quality while transparent images use PNG, can attackers exploit this inconsistency to cause unexpected storage costs or CDN bandwidth consumption? (Low)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: DEFAULT_MAX_IMAGE_DIMENSIONS] [Aspect ratio manipulation] When downsizing images to 4096px maximum dimension, can attackers exploit rounding errors in the aspect ratio calculation to create images with unexpected dimensions that bypass size validations? (Low)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: IPFS_AUTH_KEY] [Environment variable injection] If the actual pinataGatewayToken value is loaded from environment variables or config files, can attackers with partial system access inject malicious tokens that redirect IPFS traffic to attacker-controlled gateways? (High)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constants: All defaults] [YAML injection] Since ParserConfig uses serde deserialization with default value functions, can attackers exploit YAML parsing vulnerabilities (tags, anchors, merge keys) to override these constants with malicious values? (Medium)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: MAX_RETRY_TIME_SECONDS] [Metrics manipulation] If retry backoff operations emit metrics, can attackers flood the metrics system with failing URIs to cause metric cardinality explosion and degrade monitoring infrastructure? (Low)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: DEFAULT_MAX_NUM_PARSE_RETRIES] [Logging amplification] Does each retry attempt generate log entries? Can attackers amplify logging volume by 3x through retry exploitation, causing log storage exhaustion or SIEM overload? (Low)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: DEFAULT_MAX_FILE_SIZE_BYTES] [Storage cost attack] Can attackers create thousands of NFTs with 15MB metadata files to maximize GCS storage costs, exploiting the crawler's willingness to download and store large files? (Medium)",
  "[File: ecosystem/nft-metadata-crawler/src/utils/constants.rs] [Constant: MAX_ASSET_UPLOAD_RETRY_SECONDS] [Cloudflare cost attack] Can attackers exploit the 180-second upload timeout by uploading malicious 15MB images that take exactly 179 seconds to process, maximizing Cloudflare API request costs? (Medium)"
]