[
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: process_close_cmd()] [Epoch_change_time calculation] At lines 230-232, duration_since_epoch().as_secs_f64() - start_time.as_secs_f64() - if epoch_change_time() panics or returns incorrect time due to system time manipulation, can this cause metric corruption? (Low)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: run()] [Stopped flag bypass] At line 165, the loop checks 'while !self.stopped' but self.stopped is only set in process_close_cmd() - can other error conditions set stopped=true prematurely, or conversely, can stopped never be set if close_rx hangs, causing infinite execution? (Medium)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: process_peer_rpc_msg()] [Response state mismatch] At lines 464-474, both InProgress and Finished states return my_transcript - but if the transcript differs between these states due to bugs, can this cause peers to aggregate inconsistent transcripts? (High)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: setup_deal_broadcast()] [Public_params tampering] At line 314, public_params is derived from dkg_session_metadata which comes from on-chain events - if on-chain governance is compromised, can malicious params be injected to weaken DKG security or cause validation failures? (Critical)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: process_aggregated_transcript()] [Proposed flag never cleared] At line 419, 'proposed: false' is set in Finished state - but if the validator transitions back to NotStarted and then Finished again in the same epoch, can the stale 'proposed' flag cause the second transcript to never be marked as proposed? (Low)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: run()] [Message handler error propagation] At lines 166-194, each handler returns Result but errors are only logged at lines 196-202 - can repeated transient errors in one handler starve other handlers by consuming tokio::select! cycles, degrading overall responsiveness? (Medium)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: run()] [Interval drift during long operations] At line 191, interval.tick() fires every 5 seconds - but if processing other messages takes longer than 5s, can interval ticks queue up and fire rapidly in succession, causing observe() to spam logs and degrade performance? (Low)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: process_dkg_start_event()] [Duplicate start events] At line 439, the check only ensures state is NotStarted - but if multiple DKGStartEvent arrive before state transitions, can the second event cause setup_deal_broadcast() to be called twice, creating race conditions? (Medium)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: setup_deal_broadcast()] [Rounding_summary optional handling] At lines 315-323, rounding_summary() may return None - if the DKG implementation changes to always require rounding but this code still expects Optional, can missing validation cause runtime panics? (Low)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: setup_deal_broadcast()] [Abort_handle not checked] At line 359, start_produce() returns abort_handle but there's no verification it's valid - if start_produce() fails internally but returns a dummy handle, can process_close_cmd() at line 223 fail to abort the task, leaving it running? (Medium)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: process_close_cmd()] [Multiple abort handle copies] If abort_handle is somehow cloned or copied before being moved into InProgress state, can calling abort() on one copy leave other copies active, failing to fully terminate aggregation? (Low)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: process_aggregated_transcript()] [Abort handle dropped without abort] At line 384, std::mem::take() moves state out, implicitly dropping the old InProgress which contains abort_handle - does Drop implementation abort the task, or is it silently dropped, leaving aggregation running in background? (High)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: run()] [Tokio task spawn failure] In agg_trx_producer.rs line 86, tokio::spawn() could theoretically fail if runtime is shutting down - if spawn fails but abort_handle is still returned, can this create a handle that doesn't correspond to any task, causing confusion? (Low)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: new()] [Dealer_sk exposure via Arc] At line 54, dealer_sk is Arc-wrapped - can cloning this Arc expose the private key to other components? If agg_trx_producer or other code holds Arc clones, can the key be extracted after DKGManager is dropped? (High)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: setup_deal_broadcast()] [Dealer_pk not validated] At line 338, dealer_pk is passed to generate_transcript() but never validated against epoch_state validator set - can an attacker provide a dealer_pk for a non-validator to participate in DKG and compromise security? (Critical)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: new()] [My_addr not validated] At line 97, my_addr is accepted without checking it matches epoch_state.validators[my_index] - can providing mismatched my_addr cause transcripts to be attributed to wrong validator, breaking accountability? (High)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: process_aggregated_transcript()] [ValidatorTransaction::DKGResult format] At line 397, ValidatorTransaction::DKGResult is constructed with DKGTranscript - if the variant expects different data format than provided, can deserialization fail in consensus, causing the transaction to be rejected and DKG to never complete? (High)",
  "[File: aptos-core/dkg/src/dkg_manager/mod.rs] [Function: process_aggregated_transcript()] [Topic::DKG uniqueness] At line 406, Topic::DKG is used as vtxn category - if multiple DKG managers for different cryptographic schemes use the same Topic, can this cause transaction collisions and prevent some from being proposed? (Medium)"
]