[
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Float key ordering] Although FileCommentMap uses (u32, u32) tuple keys, can any floating-point calculations in position arithmetic introduce non-determinism in tuple ordering across different hardware platforms? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Hash determinism] Can FileHash (SHA256) produce different values across Rust compiler versions or CPU architectures, causing CommentMap keys to mismatch between validators and breaking compilation consensus? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Timing leaks] Can BTreeMap lookup times in FileCommentMap leak information about comment positions through cache timing, allowing attackers to infer source code structure of unpublished governance proposals? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Size inference] Can the memory footprint of MatchedFileCommentMap be measured through allocation patterns to infer the size and complexity of Move source code before it's published on-chain? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Compilation timing] Can the time to populate CommentMap for different FileHash keys leak information about source file sizes or comment density, revealing details of confidential governance proposals before voting? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [API misuse] If external code incorrectly assumes CommentMap entries are immutable after parsing, can subsequent modifications during AST transformation phases corrupt comment data and cause validator disagreements? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Incomplete validation] Does the lexer validate that all u32 positions in MatchedFileCommentMap fall within actual file boundaries, or can out-of-bounds positions cause panics when retrieving source snippets? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Span validation] Are (start, end) tuples in FileCommentMap validated to ensure start <= end, or can inverted spans cause undefined behavior in range-based operations during comment extraction? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [FileHash reuse] If FileHash values are reused across different source files (due to bugs or caching), can stale CommentMap entries from previous compilations contaminate new compilation sessions? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Serialization explosion] If CommentMap is serialized for caching or RPC transmission, can extremely large comment data cause serialization buffer overflows or exceed network message size limits? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Deserialization attacks] Can maliciously crafted serialized MatchedFileCommentMap data with invalid u32 keys or oversized String values cause panics or memory exhaustion when deserialized by validators? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Format versioning] If FileCommentMap serialization format changes between compiler versions, can validators running different versions produce incompatible comment data causing consensus failures on governance upgrades? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Pipeline ordering] If CommentMap is populated before syntax validation but used during semantic analysis, can syntax errors leave CommentMap in an inconsistent state affecting subsequent compilation attempts? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Incremental compilation] During incremental recompilation of modified Move modules, can stale MatchedFileCommentMap entries from unchanged files cause incorrect comment matching when file positions shift? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Error recovery] If lexer errors cause early termination, are partial FileCommentMap entries properly cleaned up, or can they persist and interfere with retry compilation attempts? (Low)"
]