[
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Oneshot coordination] Line 232 creates oneshot channel for shutdown coordination. Can race conditions in epoch transitions cause multiple shutdown signals, leading to double-close errors or panics? (Medium)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Public key lookup] Lines 234-237 look up public key with `.ok_or_else()` and anyhow error. If the validator's own key is not in the validator set, does this correctly prevent DKG participation or cause inconsistent state? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Consensus key derivation] Lines 238-243 look up consensus secret key by public key. Can key storage corruption or mismatch cause the wrong private key to be used for DKG, compromising protocol security? (Critical)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Error propagation] Line 242 maps storage errors to anyhow. Are these errors properly propagated to prevent validator participation with invalid keys, or can partial failures cause protocol inconsistencies? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [DKGManager construction] Lines 244-252 construct DKGManager with Arc-wrapped keys and state. Can shared references lead to key reuse across epochs or allow key extraction from memory after epoch transitions? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Tokio spawn] Line 253 spawns DKG manager task without monitoring. If the task panics or terminates unexpectedly, will the epoch manager detect this or continue operating as if DKG is running? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [In-progress session] Line 254 passes `in_progress_session` to DKG manager. Can a malicious or corrupted session state from the previous epoch cause the new DKG to produce invalid keys? (Critical)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: start_new_epoch()] [Silent skip] If conditions at line 201 are not met (randomness disabled or not a validator), the entire DKG setup is skipped silently. Can validators end up with different views on whether DKG should run? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: on_new_epoch()] [Shutdown-before-start race] Line 264 shuts down current processor before starting new epoch. Can network messages from the new epoch arrive during shutdown and be processed with old epoch state? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: on_new_epoch()] [Error handling gap] If `shutdown_current_processor()` succeeds but `start_new_epoch()` fails at line 265-266, is the validator left in a non-functional state without DKG support? (Critical)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: on_new_epoch()] [Atomicity violation] The two-phase shutdown-then-start pattern (lines 264-266) is not atomic. Can concurrent epoch changes or crashes between these phases cause state corruption? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: shutdown_current_processor()] [Unwrap panic] Line 273 uses `.unwrap()` when sending shutdown signal. If the DKG manager already closed its receiver, does the validator panic and crash? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: shutdown_current_processor()] [Await unwrap] Line 274 uses `.unwrap()` on the acknowledgment receive. If DKG manager crashes or hangs without sending acknowledgment, does the epoch transition deadlock forever? (Critical)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: shutdown_current_processor()] [Missing timeout] The shutdown await at line 274 has no timeout. Can a misbehaving DKG manager prevent epoch transitions indefinitely by not acknowledging shutdown? (Critical)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: shutdown_current_processor()] [Take() pattern] Line 271 uses `.take()` to consume `dkg_manager_close_tx`. If called multiple times, subsequent calls are no-ops. Can this hide real shutdown failures or leave zombie DKG tasks? (Medium)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: shutdown_current_processor()] [Oneshot coordination] The oneshot pattern at lines 272-273 requires DKG manager cooperation. Can a Byzantine validator's DKG manager maliciously ignore shutdown requests, preventing clean epoch transitions? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: create_network_sender()] [Sender cloning] The function clones `network_sender` and `self_sender` at lines 281-282. Can these cloned senders be used after epoch transitions to send messages with stale epoch numbers? (Medium)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Function: create_network_sender()] [Address binding] Line 280 binds NetworkSender to `self.my_addr`. If this address doesn't match the validator's network identity, can messages be sent with spoofed source addresses? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Integration] [Channel lifecycle] DKG channels are created in `start_new_epoch()` (lines 223-231) but used in `process_rpc_request()`. Can messages arriving between epoch transitions be forwarded to closed channels or wrong epoch DKG managers? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Integration] [Epoch number consistency] Multiple functions check `epoch_state.epoch` but epoch_state can be None or in transition. Can inconsistent epoch checks allow messages to be processed at wrong times? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Integration] [Memory leak] DKG manager tasks are spawned (line 253) but there's no tracking of their completion. Can failed or stuck tasks accumulate across epochs, causing memory leaks or resource exhaustion? (Medium)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Integration] [Key rotation] Consensus keys are loaded from `key_storage` (lines 238-243) each epoch. If key rotation occurs mid-epoch, can validators end up using mismatched keys in DKG protocol? (Critical)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Integration] [Event ordering] DKG start events and reconfig events are processed concurrently. Can a DKG start event for epoch N+1 arrive before reconfig for epoch N+1 is processed, causing protocol confusion? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Integration] [Validator set changes] When validator set changes between epochs (line 158-160), can new validators joining DKG cause quorum calculation errors if they don't have proper historical state? (High)",
  "[File: aptos-core/dkg/src/epoch_manager.rs] [Integration] [VTxn pool sharing] The `vtxn_pool` is shared (line 251) across epochs. Can validator transactions from old epochs be erroneously applied in new epochs due to lack of epoch isolation? (High)"
]