[
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Struct: IndexerGrpcFileStoreWorkerConfig] [Deserialization attack] Can an attacker craft a malicious configuration file with extremely large chain_id values (e.g., u64::MAX) that could cause integer overflow when used in arithmetic operations in the processor, potentially corrupting version tracking or file metadata? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Struct: IndexerGrpcFileStoreWorkerConfig] [Deserialization attack] Does the serde deny_unknown_fields attribute at line 14 properly prevent injection of malicious fields, or can an attacker bypass this by exploiting serde version vulnerabilities to inject unexpected configuration that alters runtime behavior? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Struct: IndexerGrpcFileStoreWorkerConfig] [Path traversal] When file_store_config contains a LocalFileStore configuration, can an attacker specify a local_file_store_path with path traversal sequences (../) during deserialization to write transaction data to arbitrary filesystem locations, potentially overwriting critical system files? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Struct: IndexerGrpcFileStoreWorkerConfig] [Resource exhaustion] Can an attacker provide a redis_main_instance_address pointing to a malicious Redis server that returns enormous data payloads, causing the processor to consume excessive memory when fetching transactions and leading to OOM crashes? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: enable_cache_compression] [Compression bomb] When enable_cache_compression is set to true at line 21, can an attacker upload highly compressible but malicious transaction data to Redis that expands to enormous size during decompression, causing memory exhaustion in the file store worker? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: redis_main_instance_address] [URL injection] Can an attacker craft a redis_main_instance_address with special characters or CRLF injection sequences that bypass RedisUrl validation and execute arbitrary Redis commands when the connection is established in Processor::new()? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: redis_main_instance_address] [SSRF attack] Can an attacker specify a redis_main_instance_address pointing to internal infrastructure endpoints (e.g., metadata servers, admin interfaces) to exploit SSRF vulnerabilities and access sensitive internal resources? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: redis_main_instance_address] [Authentication bypass] Does RedisUrl validation ensure Redis authentication is properly configured, or can an attacker connect to unauthenticated Redis instances and inject malicious transaction data into the cache that gets propagated to the file store? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: chain_id] [Chain ID manipulation] Can an attacker provide a chain_id of 0 in the configuration that passes through to Processor::new() at line 52, potentially causing division by zero errors or bypassing chain ID validation checks in the file store metadata? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Chain ID mismatch] When the processor is created with chain_id at line 52 and later validates against file store metadata, can race conditions during concurrent deployments cause chain ID mismatches that result in transactions from different chains being mixed in the same storage bucket? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: chain_id] [Integer boundaries] Can setting chain_id to extreme values (e.g., u64::MAX - 1) cause arithmetic overflow when the processor performs version calculations (batch_start_version + FILE_ENTRY_TRANSACTION_COUNT), leading to incorrect file storage locations or metadata corruption? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Panic propagation] The processor creation at lines 49-56 uses expect() which panics on failure, but can an attacker trigger this panic by corrupting Redis state or file store metadata, causing the entire indexer service to crash and losing liveness for data archival? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Panic propagation] The processor.run() call at lines 57-60 uses expect() which panics on unexpected exit, but can an attacker exploit gaps in error handling in the processor module to trigger this panic repeatedly, creating a denial-of-service condition for the file store service? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Error recovery] Since run() returns Ok(()) immediately after processor.run() exits at line 61, does this mask critical errors from the processor that should be propagated to the framework, potentially hiding data loss or corruption issues? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Unrecoverable state] If the processor panics during initialization due to chain ID mismatch or Redis connection failure, can the service enter an unrecoverable state where it cannot restart without manual intervention, causing permanent data archival outage? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [TOCTOU race] Between creating the processor at line 49 and running it at line 57, can another process modify the file store metadata or Redis state, causing time-of-check-time-of-use vulnerabilities that lead to duplicate uploads or data corruption? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Concurrent initialization] If multiple instances of IndexerGrpcFileStoreWorkerConfig::run() are started concurrently with the same configuration, can they race to initialize the file store metadata, resulting in conflicting metadata updates and data loss? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: new()] [State initialization] During Processor::new() at lines 49-52, can concurrent modifications to Redis cache metadata cause inconsistent initialization state where file_store_latest_version doesn't match actual file store metadata, leading to gaps in archived data? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Struct: IndexerGrpcFileStoreWorkerConfig] [Clone safety] The Clone trait is derived at line 13, but can cloning the config while file_store_config contains GCS credentials create multiple instances sharing the same service account key, potentially leading to authentication conflicts or quota exhaustion? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: file_store_config] [Credential sharing] When file_store_config is cloned at line 51, does this create a shallow copy of sensitive GCS service account key paths that could be accessed by untrusted code if the config is later shared across thread boundaries? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: redis_main_instance_address] [Connection pooling] When redis_main_instance_address is cloned at line 50, can multiple processor instances created from cloned configs overwhelm the Redis server with connection requests, causing performance degradation or connection exhaustion? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: default_enable_cache_compression()] [Insecure default] The default value for enable_cache_compression is false at lines 24-26, but could this default expose the system to performance issues where extremely large uncompressed transaction batches consume excessive Redis memory, potentially causing cache eviction of critical metadata? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: enable_expensive_logging] [Information disclosure] When enable_expensive_logging is Some(true), does this log sensitive transaction data or internal state information that could be exploited by attackers to understand the indexer's behavior and plan targeted attacks? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: file_store_config] [GCS credential exposure] When file_store_config contains GcsFileStore with gcs_file_store_service_account_key_path, can an attacker who gains read access to the config file obtain the credential path and subsequently read the service account keys to gain unauthorized access to the storage bucket? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: file_store_config] [Bucket manipulation] Can an attacker modify the gcs_file_store_bucket_name in file_store_config to point to an attacker-controlled GCS bucket, causing transaction data to be uploaded to unauthorized storage and potentially leaked or corrupted? (Critical)"
]