[
  "[File: api/types/src/view.rs] [Integration: convert.rs] [Native type injection] Does MoveTypeLayout::Native case in try_into_vm_value_from_layout properly reject all inputs, or can crafted JSON bypass validation and inject native values? (Critical)",
  "[File: api/types/src/view.rs] [Integration: convert.rs] [Signer injection] Can arguments contain signer types through crafted JSON, bypassing the is_signer() filter and allowing unauthorized signer access in view functions? (Critical)",
  "[File: api/types/src/view.rs] [Integration: convert.rs] [Function type bypass] Does MoveTypeLayout::Function case properly reject all function types, or can attackers exploit the TODO comment to inject function values? (High)",
  "[File: api/types/src/view.rs] [Integration: convert.rs] [Type tag conversion] When MoveType is converted to TypeTag, can malformed generic type parameters cause panic or bypass Move VM type safety checks? (High)",
  "[File: api/types/src/view.rs] [Integration: convert.rs] [Module bytecode cache] Does view_existing_module cache module bytecode, and can attackers exploit cache poisoning to execute stale or malicious module versions? (High)",
  "[File: api/types/src/view.rs] [Integration: aptos_vm.rs] [Gas exhaustion] Can ViewFunction with valid syntax but expensive computation (deep recursion, large loops) exceed max_gas_view_function limit causing API timeouts? (Medium)",
  "[File: api/types/src/view.rs] [Integration: aptos_vm.rs] [Gas metering bypass] Does execute_view_function properly meter gas for all operations, or can crafted ViewFunction execute expensive operations without proper gas accounting? (High)",
  "[File: api/types/src/view.rs] [Integration: aptos_vm.rs] [Read-only enforcement] Can view functions bypass read-only restrictions through ViewFunction manipulation, causing state modifications that violate view function semantics? (Critical)",
  "[File: api/types/src/view.rs] [Integration: aptos_vm.rs] [Global state leak] Can ViewFunction access global state beyond the requested ledger_version, leaking information about pending transactions or future state? (Medium)",
  "[File: api/types/src/view.rs] [Integration: aptos_vm.rs] [Error message leak] Do ViewFunctionError responses from execute_view_function leak sensitive internal state or module implementation details through error messages? (Low)",
  "[File: api/types/src/view.rs] [Integration: aptos_vm.rs] [Abort code manipulation] Can attackers craft ViewFunction that triggers specific abort codes to probe for existence of resources or bypass access controls? (Medium)",
  "[File: api/types/src/view.rs] [Integration: aptos_vm.rs] [Return value tampering] Does BCS encoding of return values maintain integrity, or can VM bugs cause returned values to differ from actual computation results? (High)",
  "[File: api/types/src/view.rs] [Integration: aptos_vm.rs] [Reentrancy] Even though view functions are read-only, can nested view function calls create reentrancy conditions that exhaust stack or cause unexpected behavior? (Medium)",
  "[File: api/types/src/view.rs] [Integration: view_function.rs] [Allowlist bypass] Can ViewFunction module/function names be crafted with Unicode normalization to bypass ViewFilter allowlist checks? (High)",
  "[File: api/types/src/view.rs] [Integration: view_function.rs] [Blocklist evasion] Does ViewFilter.allows() check both ModuleId and Identifier consistently, or can attackers use case variations to evade blocklists? (Medium)",
  "[File: api/types/src/view.rs] [Integration: view_function.rs] [TOCTOU race] Between ViewFilter validation and VM execution, can an attacker trigger module redeployment causing execution of non-allowlisted function? (Low)",
  "[File: api/types/src/view.rs] [Integration: view_function.rs] [System function exposure] Can ViewFunction reference internal system functions (e.g., in 0x1::account) that shouldn't be publicly callable but pass filter checks? (High)",
  "[File: api/types/src/view.rs] [Struct: ViewRequest] [Clone implementation] Does derived Clone for ViewRequest with Vec fields properly handle deep copying, or can shared references cause use-after-free? (Low)",
  "[File: api/types/src/view.rs] [Struct: ViewRequest] [PartialEq bypass] Can two semantically different ViewRequests compare as equal due to PartialEq implementation, causing cache poisoning or replay attacks? (Medium)",
  "[File: api/types/src/view.rs] [Struct: ViewFunction] [Hash collision] Does Hash implementation for ViewFunction properly include all fields, or can attackers craft colliding ViewFunction instances for cache attacks? (Low)",
  "[File: api/types/src/view.rs] [Struct: ViewFunction] [Serde skip] Are there any #[serde(skip)] annotations that could allow deserialization without full validation, bypassing security checks? (Medium)",
  "[File: api/types/src/view.rs] [Struct: ViewRequest] [Enum variant exhaustion] If EntryFunctionId or MoveType are enums, can all variants be safely deserialized without causing panics or undefined behavior? (Medium)",
  "[File: api/types/src/view.rs] [Integration: view_function.rs] [Ledger version skew] Can ViewRequest at specific ledger_version see inconsistent state if the version is during epoch boundary or reconfig events? (Medium)",
  "[File: api/types/src/view.rs] [Integration: view_function.rs] [Pruned state access] When ledger_version is pruned, does error handling prevent state leak or allow reconstruction of pruned data through view function results? (Low)",
  "[File: api/types/src/view.rs] [Integration: view_function.rs] [StateView caching] Can ViewFunction execution see stale StateView cache, causing non-deterministic results across multiple view calls? (Medium)"
]