[
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Sync: Move-Rust] [Field addition] If the Move Token struct adds a new field, does TokenResource deserialization fail or silently ignore the new field, causing loss of critical token metadata? (High)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Sync: Move-Rust] [Field type change] If the Move framework changes a field type (e.g., index from u64 to u128), can TokenResource still deserialize the old format without panicking or data loss? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Sync: Move-Rust] [Deprecation] The Move Token struct marks index and name as deprecated in favor of TokenIdentifiers - does TokenResource properly handle tokens with/without these deprecated fields? (High)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Sync: Move-Rust] [Resource group] TokenIdentifiers uses #[resource_group_member] attribute - does TokenResource account for tokens where data is split across Token and TokenIdentifiers resources? (High)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Concurrency: Read] [Data race] Can concurrent reads of TokenResource fields from multiple threads cause data races or torn reads if the underlying storage is not properly synchronized? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Concurrency: Write] [Write-write conflict] If multiple transactions attempt to modify the same TokenResource concurrently, can conflicting updates be lost or cause state corruption? (High)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Concurrency: Cache] [Cache coherency] If TokenResource is cached across multiple nodes, can stale cache entries cause nodes to have inconsistent views of token state? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Economic: Minting] [Inflation attack] Can an attacker mint unlimited tokens by exploiting lack of supply tracking in TokenResource, causing token value dilution for existing holders? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Economic: Rarity] [Rarity manipulation] Can an attacker manipulate the index field to create artificial rarity (claiming low indices) for pump-and-dump schemes in NFT markets? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Economic: Metadata] [Metadata fraud] Can token creators change description/uri after sale to perform bait-and-switch attacks, changing artwork or utility claims after users purchase? (Low)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Cross-module: Collection] [Collection validation] When TokenResource references a collection Object, is there validation that the collection actually exists and hasn't been deleted? (High)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Cross-module: Transfer] [Transfer hooks] If token transfers check TokenResource fields, can manipulated metadata bypass transfer restrictions or royalty enforcement? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Cross-module: Burn] [Burn verification] When burning tokens, is the TokenResource properly deleted from storage or can ghost entries remain causing storage bloat? (Medium)"
]