[
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Static OnceCell Initialization] Since IndexerGrpcGatewayConfig uses a static OnceCell for the GRPC_GATEWAY, can race conditions during concurrent initialization attempts cause undefined behavior or allow double initialization? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Metrics Endpoint Security] Does the health_check_port from the config have authentication/authorization, or can attackers access sensitive metrics, profiling data, and status information without authentication? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Configuration Reloading] If configuration can be reloaded at runtime, can an attacker trigger race conditions between the main runtime and config reload that cause inconsistent state or security setting downgrades? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Upstream Data Service Trust] Does the gateway properly validate responses from the grpc_manager and upstream data services, or does it blindly trust and proxy potentially malicious responses to clients? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [URL Origin Validation] In the gateway's URL override logic, can an attacker bypass the origin check through URL parsing discrepancies between url::Url and http::Uri, enabling SSRF or request smuggling? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Request Body Replay] When the gateway reads the request body to extract user_request, can this cause issues if the body is consumed or modified, leading to incorrect proxying or request manipulation? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Compression Bomb] Does the gateway validate compressed request sizes before decompression (when grpc-encoding header is set to gzip/zstd), or can attackers send compression bombs that cause memory exhaustion? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Proto Deserialization] Can malicious GetTransactionsRequest proto messages with deeply nested structures, large repeated fields, or malformed data cause panics or resource exhaustion during deserialization? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Logging Sensitive Data] Does the gateway's info logging (data_service_url) potentially log sensitive information like authentication tokens, internal network topology, or API keys embedded in URLs? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [HTTP/2 Client Settings] Since the proxy uses HTTP/2 only, can attackers exploit HTTP/2 specific vulnerabilities like stream multiplexing attacks, HPACK compression issues, or rapid reset attacks? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Response Tampering] As the gateway proxies responses from upstream services, are there integrity checks to detect if responses have been tampered with by a compromised upstream service? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Path Traversal in URI] Can attackers craft URIs with path traversal sequences that bypass the override_uri_with_upstream_url origin check and access unintended endpoints on upstream services? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Connection Pool Exhaustion] Does the HTTP/2 client properly limit concurrent connections and streams to upstream services, or can attackers exhaust connection pools through rapid requests? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Extension Injection] Can attackers manipulate request extensions (used to pass the upstream URL) through specially crafted requests, potentially redirecting traffic to malicious servers? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Middleware Bypass] Can attackers craft requests that bypass the get_data_service_url middleware layer through non-standard HTTP methods, malformed headers, or path variations? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Error Response Information Leakage] When proxy requests fail, do error responses leak internal network information, service versions, or stack traces that aid attackers in reconnaissance? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Axum Router Misconfiguration] Does the /*path catch-all route properly validate and sanitize paths, or can it match unintended routes that expose internal functionality? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [TcpListener Binding] Since the TcpListener binds to 0.0.0.0, is there proper network-level access control, or can the gateway be accessed from unintended networks (public internet when it should be private)? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Request Timeout] Are there proper timeouts configured for upstream requests, or can attackers cause the gateway to wait indefinitely for slow or unresponsive upstream services, leading to resource exhaustion? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-gateway/src/main.rs] [Function: main()] [Health Check Vulnerabilities] Since the framework exposes readiness, metrics, and profilez endpoints on health_check_port, can attackers abuse these endpoints for reconnaissance, resource exhaustion, or to gather sensitive profiling data? (Medium)"
]