[
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Function: ProtocolId::to_bytes() CompressedBcs] [MAX_APPLICATION_MESSAGE_SIZE bypass] Does the compression check properly enforce MAX_APPLICATION_MESSAGE_SIZE on the compressed output, or can oversized messages slip through if compression happens to reduce them below limits? (High)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Function: ProtocolId::from_bytes() CompressedBcs] [Compression metadata attack] Can malicious compression metadata (headers, dictionaries) within compressed messages cause decompression libraries to behave unexpectedly or expose vulnerabilities? (Medium)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Function: ProtocolId compression] [Multiple compression layers] Can messages be double-compressed by applying compression at multiple protocol layers, causing excessive decompression overhead or triggering decompression library bugs? (Medium)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Function: ProtocolId::to_bytes()] [Partial serialization] If serialization fails partway through for a large structure, can partially serialized data leak into memory or cause state corruption before the error is detected? (Medium)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Function: ProtocolId::from_bytes()] [Partial deserialization memory] If deserialization fails after allocating significant memory for intermediate structures, can repeated failed attempts cause memory exhaustion before garbage collection occurs? (Medium)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Struct: HandshakeError] [Error propagation] Can HandshakeError variants be misinterpreted at higher layers, causing incorrect connection state management or enabling connection state confusion attacks? (Low)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Function: HandshakeMsg::perform_handshake()] [Early return state] Can early returns on ChainId or NetworkId mismatches leave connection state in an inconsistent state that affects subsequent handshake attempts? (Low)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Function: ProtocolId::to_bytes()] [Timer observation conditional] The serialization timer only observes duration on success - can this timing difference be exploited to infer whether serialization succeeded through side-channel timing analysis? (Low)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Struct: HandshakeMsg] [Concurrent handshake] Can two peers simultaneously perform handshakes with each other, causing race conditions in protocol selection where both peers select different protocol sets, leading to communication failures? (Medium)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Function: ProtocolId::to_bytes()] [Concurrent serialization] Can concurrent serialization of the same message from multiple threads cause data races in the serialization timer metrics or compression state? (Low)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Struct: ProtocolIdSet] [Concurrent modification] If ProtocolIdSet is modified during iteration through iter(), can this cause iterator invalidation or expose inconsistent protocol states to concurrent handshakes? (Medium)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Function: HandshakeMsg::perform_handshake()] [TOCTOU in protocol check] Can a time-of-check-time-of-use race exist between checking is_empty() and returning the protocol set, allowing protocol set modification between validation and use? (Low)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [ProtocolId: ConsensusRpcBcs/ConsensusDirectSendBcs] [Consensus message manipulation] Can an attacker exploit the separate BCS-encoded consensus protocols to send malformed consensus messages that bypass validation in one protocol but are processed by another? (Critical)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [ProtocolId: ConsensusRpcJson/ConsensusDirectSendJson] [JSON consensus inconsistency] Can JSON encoding for consensus messages lead to non-deterministic serialization (field ordering, float precision) causing state divergence between validators? (Critical)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [ProtocolId: MempoolDirectSend] [Mempool recursion exploit] With USER_INPUT_RECURSION_LIMIT (32) applied to mempool, can attackers flood mempool with maximally nested transactions that consume disproportionate deserialization resources? (High)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [ProtocolId: DKG protocols] [DKG protocol downgrade] Can an attacker force DKG to use uncompressed or JSON protocols instead of compressed versions, exposing DKG messages to larger bandwidth and enabling traffic analysis attacks? (Medium)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [ProtocolId: JWKConsensus protocols] [JWK protocol negotiation] Can JWK consensus protocol negotiation be manipulated to force use of less secure encoding formats (JSON vs CompressedBcs), potentially exposing JWK updates to tampering? (High)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [ProtocolId: ConsensusObserver] [Observer protocol abuse] Can malicious nodes claim ConsensusObserver protocol support to receive consensus messages without being validators, enabling consensus information leakage? (Medium)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [ProtocolId: HealthCheckerRpc] [Health check spoofing] Can malicious peers manipulate HealthCheckerRpc protocol negotiation to falsely report health status, affecting peer reputation and connection management? (Low)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [ProtocolId: StorageServiceRpc] [Storage service abuse] Can attackers exploit StorageServiceRpc protocol to send expensive state queries causing storage layer DoS without proper rate limiting at protocol level? (Medium)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [ProtocolId: PeerMonitoringServiceRpc] [Monitoring data poisoning] Can malicious peers inject false monitoring data through PeerMonitoringServiceRpc, affecting network health assessment and peer selection decisions? (Low)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Function: ProtocolId::to_bytes() JSON] [JSON injection] For JSON-encoded protocols, can specially crafted field values with quotes, backslashes, or control characters break JSON structure and cause parsing failures or injection attacks? (Medium)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Function: ProtocolId::from_bytes() JSON] [JSON bomb] Can deeply nested JSON objects or arrays bypass recursion limits and cause stack overflow during JSON parsing, crashing validator nodes? (High)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Function: ProtocolId::to_bytes() JSON] [JSON number precision] Can large integers or floating-point numbers in JSON encoding lose precision during serialization/deserialization, causing consensus divergence for numeric values? (Medium)",
  "[File: network/framework/src/protocols/wire/handshake/v1/mod.rs] [Function: ProtocolId::from_bytes() JSON] [JSON schema validation] Does JSON deserialization validate schema strictly, or can extra fields or missing required fields pass validation and cause processing errors downstream? (Low)"
]