[
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: add()] [Cofactor subgroup] Does add() preserve the prime-order subgroup property, or can adding points from different cosets enable small subgroup confinement attacks that leak plaintext information? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: sub()] [Underflow to identity] Can sub() produce the identity element when subtracting a point from itself, and is this identity element properly validated in downstream ElGamal operations to prevent decryption to zero? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: sub()] [Negative point handling] Does sub() correctly compute point negation and subtraction, or can incorrect sign handling enable an attacker to forge ElGamal ciphertexts with negative discrete logarithms? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: sub()] [Torsion point subtraction] Can an attacker subtract torsion points to remove the low-order component from ElGamal ciphertexts, enabling them to manipulate veiled coin balances without affecting the prime-order component? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: sub()] [Invalid point subtraction] If sub() receives an invalid point that is not on the curve, does it reject the operation, or can it produce a result that breaks the group structure and enables forgery attacks? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: sub()] [Timing side-channel] Does sub() execute in constant time, or can the special case of subtracting a point from itself leak information through timing variations that enable key recovery attacks? (Medium)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: sub()] [Homomorphic subtraction abuse] In veiled coin systems, can an attacker use sub() to create negative balance ciphertexts that appear valid but represent impossible account states, enabling double-spending? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: sub()] [Integer underflow] Does sub() properly handle subtraction that would result in a negative discrete logarithm (e.g., subtracting a larger encrypted value from a smaller one), or can this cause wraparound to large positive values? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: sub()] [Point order validation] Does sub() ensure both input points have the same order (are in the prime-order subgroup), or can mixing points of different orders enable invalid curve attacks? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: sub()] [Neutral element subtraction] If the identity element is subtracted from a point, does sub() return the original point unchanged, and can this property be exploited to detect encrypted zero values in veiled coin balances? (Medium)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: mul()] [Zero scalar multiplication] Does mul() properly handle multiplication by zero scalar, producing the identity element, and is this identity element correctly rejected in ElGamal public key validation to prevent trivial key attacks? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: mul()] [Scalar timing attack] Does mul() use constant-time scalar multiplication, or can timing variations leak scalar bits through cache/branch prediction, enabling recovery of ElGamal private keys during decryption? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: mul()] [Small scalar attack] Can an attacker use very small scalars (e.g., 1, 2, 3) with mul() to generate predictable points that enable brute-force attacks on ElGamal ciphertexts in veiled coin transactions? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: mul()] [Large scalar overflow] Does mul() properly reduce the scalar modulo the curve order before multiplication, or can extremely large scalars cause overflow that produces incorrect results? (High)",
  "[File: aptos-core/crates/aptos-core/src/elgamal/curve25519.rs] [Function: mul()] [Invalid point multiplication] If mul() receives a point not on the curve or not in the prime-order subgroup, does it detect and reject the operation, or can it produce a point that breaks ElGamal security? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: mul()] [Torsion point multiplication] Can an attacker multiply a torsion point by various scalars using mul() to extract information about the scalar through timing or output analysis, breaking ElGamal private key secrecy? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: mul()] [Scalar negation] Does mul() handle negative scalars correctly (treating them as modulo the curve order), or can negative scalars produce points that enable forgery attacks on ElGamal signatures? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: mul()] [Point doubling attack] Can an attacker use mul() with scalar value 2 repeatedly to perform point doubling and detect low-order points in ElGamal ciphertexts, leaking plaintext information? (Medium)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: mul()] [Cofactor multiplication] Does mul() clear the cofactor by multiplying by 8, or can the cofactor component in the result enable invalid curve attacks when the point is used in ElGamal operations? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Function: mul()] [DPA vulnerability] Is mul() vulnerable to differential power analysis (DPA) attacks where scalar bits can be recovered by measuring power consumption during point multiplication on validator hardware? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Integration: ElGamal encryption] When Curve25519 is used in elgamal::encrypt(), can an attacker provide an invalid public key (identity element or low-order point) that causes encryption to produce malleable ciphertexts? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Integration: ElGamal decryption] Does the decrypt() function validate that ciphertext components are in the prime-order subgroup before using mul() and sub(), preventing invalid curve attacks that leak private key bits? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Integration: Key generation] In key_gen(), can the generated public key ever be the identity element (if rand_scalar() returns zero), and is this properly detected to prevent completely insecure ElGamal keypairs? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Integration: Hybrid encryption] In ElGamalCurve25519Aes256Gcm, does the implementation validate that the ElGamal-encrypted AES key is a valid curve point before decryption, preventing invalid point attacks that could leak the private key? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/elgamal/curve25519.rs] [Integration: Homomorphic operations] When add() is used for homomorphic addition of veiled coin ciphertexts, can repeated additions cause the discrete logarithm to exceed the solvable range, making decryption computationally infeasible? (High)"
]