[
  "[File: aptos-core/api/types/src/derives.rs] [Macro: impl_poem_parameter!] [Query parameter injection] Can attackers inject special characters in query parameters for U64, U128, I64, I128 types to manipulate SQL queries or other backend operations? (Medium)",
  "[File: aptos-core/api/types/src/derives.rs] [Macro: impl_poem_parameter!] [Header injection via ToHeader] Since types implement ToHeader trait (line 134 in helpers.rs), can attackers cause HTTP header injection by providing values with CRLF sequences? (High)",
  "[File: aptos-core/api/types/src/derives.rs] [Macro: impl_poem_type! invocations] [JSON deserialization bombs] All types use ParseFromJSON trait - can attackers send deeply nested JSON that causes stack overflow or excessive memory allocation during deserialization? (High)",
  "[File: aptos-core/api/types/src/derives.rs] [Macro: impl_poem_type! invocations] [Schema reference manipulation] The macros generate schema references - can attackers exploit circular schema references or recursive type definitions to cause infinite loops in schema validation? (Medium)",
  "[File: aptos-core/api/types/src/derives.rs] [Macro: impl_poem_type! invocations] [Type name collision] Since type names are derived from stringify! (line 72 in helpers.rs), can attackers create types that collide with system types in the OpenAPI schema? (Low)",
  "[File: aptos-core/api/types/src/derives.rs] [Macro: impl_poem_type! invocations] [Example data poisoning] Can attackers reference the example values in the schema (e.g., line 35, 54, 92) to craft attacks, knowing these exact values appear in documentation and tests? (Low)",
  "[File: aptos-core/api/types/src/derives.rs] [Macro: impl_poem_parameter! invocations] [Multipart form data attack] Since types implement ParseFromMultipartField (line 161 in helpers.rs), can attackers upload malicious multipart data that bypasses validation? (Medium)",
  "[File: aptos-core/api/types/src/derives.rs] [Integration] [Type confusion across layers] Can attackers exploit inconsistencies between the OpenAPI schema definitions in derives.rs and actual implementation logic in address.rs/move_types.rs to cause type confusion? (High)",
  "[File: aptos-core/api/types/src/derives.rs] [Integration] [Pattern validation bypass] The MoveStructTag pattern on line 131 and MoveType pattern on line 220 - are these patterns consistently enforced in underlying FromStr implementations, or can attackers bypass them? (High)",
  "[File: aptos-core/api/types/src/derives.rs] [Integration] [Serialization round-trip attack] Can attackers craft values that serialize correctly but deserialize to different values, causing state inconsistencies between API and blockchain layers? (High)",
  "[File: aptos-core/api/types/src/derives.rs] [Integration] [Description-implementation mismatch] Do the type descriptions (lines 38-45, 74-80, 112-120, etc.) accurately reflect implementation behavior, or can attackers exploit gaps between documentation and code? (Medium)",
  "[File: aptos-core/api/types/src/derives.rs] [Integration] [Format string inconsistency] Types specify formats like 'hex', 'uint64', 'uint128' - are these formats validated consistently across all API endpoints, or can format confusion cause vulnerabilities? (Medium)"
]