[
  "[File: config/src/config/internal_indexer_db_config.rs] [Struct: InternalIndexerDBConfig] [Feature enablement change] If a node restarts with enable_event changed from true to false after partial indexing, will the existing event data become orphaned and cause version mismatch panics on next startup? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Struct: InternalIndexerDBConfig] [Batch size change mid-indexing] If batch_size is changed from 10000 to 100 during node restart while indexing is in progress, will this cause the indexer to reprocess transactions with a different batch boundary, leading to duplicate entries or data corruption? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Struct: InternalIndexerDBConfig] [Config persistence] Is InternalIndexerDBConfig persisted to disk or only kept in memory - if only in memory, can a node restart with different config values cause catastrophic version mismatches and data loss? (Critical)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Derive: Serialize, Deserialize] [Malicious config injection] Can an attacker inject a malicious YAML/TOML config file with carefully crafted values that exploit serde deserialization vulnerabilities (e.g., recursive structures, extremely long strings) causing stack overflow or excessive memory consumption? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Attribute: serde(default)] [Partial deserialization] If the config file has only some fields specified (e.g., only enable_event), will serde use Default values for missing fields, potentially causing unexpected behavior if the operator intended to keep previous values? (Low)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Derive: PartialEq, Eq] [Comparison bypass] Are PartialEq and Eq implementations used in security-critical comparisons - if so, can floating point NaN shenanigans or custom implementations cause comparison bypass vulnerabilities? (Low)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Derive: Copy, Clone] [Unintended mutation] Since the struct derives Copy, can concurrent threads hold stale copies of the config while another thread updates it, leading to TOCTOU races where old config values are used after sanitize() validation? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: sanitize()] [Sharding initialization race] If storage sharding is enabled after node startup but before indexer initialization, will the sanitize() check pass incorrectly, allowing the indexer to start without proper sharded storage? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: sanitize()] [Sharding type mismatch] Does enable_storage_sharding validate that the correct sharding strategy is used for the indexer DB, or could incompatible sharding configurations cause data corruption? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: sanitize()] [Partial sharding] If enable_storage_sharding is true but only some column families are sharded, will the indexer attempt to write to non-sharded CFs, causing write failures or data loss? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: sanitize()] [Sharding disabled after enablement] If storage sharding is disabled after the indexer has been running with sharding enabled, will the sanitize() check catch this configuration regression and prevent data corruption? (Critical)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Field: batch_size] [usize to u64 conversion] When batch_size (usize) is converted to u64 in DBIndexer, can this overflow on 32-bit systems where usize::MAX < u64::MAX, or underflow when converting large u64 values back to usize? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Field: event_v2_translation_ignores_below_version] [u64 arithmetic overflow] If this field is used in calculations like (version - event_v2_translation_ignores_below_version), can underflow occur when version is less than the threshold, causing wrapped values and incorrect indexing? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Field: batch_size] [Multiplication overflow] If batch_size is multiplied by other values (e.g., item size) to calculate total memory, can this overflow and wrap around to small values, causing under-allocation and buffer overflows? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Field: event_v2_translation_ignores_below_version] [Version comparison edge cases] When comparing this threshold with blockchain versions, are all comparison operators (>, >=, <, <=, ==) used correctly, or can off-by-one errors cause events at exact boundary versions to be mishandled? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Struct: InternalIndexerDBConfig] [Concurrent modification] Since the struct derives Copy but not Send/Sync explicitly, can multiple threads concurrently modify different copies of the config, leading to inconsistent state across threads? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: sanitize()] [Race between validation and usage] Can sanitize() run on one thread while another thread is already using the config, creating a TOCTOU race where invalid config passes validation but is then modified before usage? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Struct: InternalIndexerDBConfig] [Atomic config updates] If the config needs to be updated at runtime (e.g., changing batch_size), is there atomic update mechanism to ensure all fields remain consistent, or can partial updates cause invalid intermediate states? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Getter methods] [Non-atomic reads] Do getter methods like enable_transaction() read fields atomically, or can torn reads occur where boolean values are read mid-update, causing undefined behavior? (Low)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Struct: InternalIndexerDBConfig] [API data inconsistency] If different API endpoints use different feature flags (enable_transaction for /accounts/.../transactions, enable_event for /accounts/.../events), can inconsistent enablement cause some API endpoints to work while others fail silently? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: is_internal_indexer_db_enabled()] [API availability check] Do API handlers check is_internal_indexer_db_enabled() before processing requests, or can they attempt indexer queries when it's disabled, causing panics or returning empty results? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Field: enable_statekeys] [Resource query failures] If enable_statekeys is false, will API endpoints like /accounts/{address}/resources fail with errors or return misleading empty results, confusing clients? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Field: enable_event] [Event query failures] If enable_event is false but clients expect event data, will API queries fail gracefully with proper error messages, or return empty arrays making it impossible to distinguish between no events and indexer disabled? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: sanitize()] [Error propagation] If sanitize() returns Error::ConfigSanitizerFailed, is this error properly propagated to node startup logic to prevent node launch, or could it be caught and ignored, allowing invalid config to proceed? (Critical)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: sanitize()] [Error message leakage] Does the error message 'Don't turn on internal indexer db if DB sharding is off' leak sensitive information about the node's storage configuration that could aid attackers in reconnaissance? (Low)"
]