[
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Function: set_coin()] [Integer overflow] Can an attacker call set_coin() with u64::MAX to cause overflow when subsequent deposits are made, leading to wrapped-around balances and unlimited minting of tokens? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Function: set_coin()] [Integer underflow] Does set_coin() allow setting coin balance to 0 when actual withdrawals haven't occurred, enabling attackers to drain accounts by manipulating the coin field directly without proper validation? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Struct: CoinStoreResource] [Integer overflow] When the coin field (u64) reaches u64::MAX (18,446,744,073,709,551,615), can deposit operations cause silent wraparound to 0, resulting in massive fund loss for holders of large balances? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Function: coin()] [Type confusion] Can an attacker exploit the u64 return type of coin() to cause integer overflow in arithmetic operations performed by consuming code, leading to incorrect balance calculations? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Struct: CoinStoreResourceUntyped] [Data integrity] Does CoinStoreResourceUntyped lack proper validation allowing coin values beyond economic security limits (e.g., > total supply), enabling inflationary attacks? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Function: frozen()] [Access control bypass] Can the frozen flag be read but not enforced during withdrawals in external code, allowing attackers to bypass freeze restrictions and withdraw from frozen accounts? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Struct: CoinStoreResource] [State manipulation] Is there a race condition where frozen status can be checked and then changed before withdrawal completes, enabling TOCTOU (time-of-check-time-of-use) attacks to drain frozen accounts? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Field: frozen] [Privilege escalation] Can a malicious Move module directly deserialize and modify the frozen field to false, bypassing governance freeze actions and unfreezing sanctioned addresses? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Function: frozen()] [Logic error] Does the absence of set_frozen() method in the public API mean frozen state can only be changed via deserialization, creating inconsistent enforcement across different code paths? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Struct: CoinStoreResourceUntyped] [Type safety] Can frozen state be manipulated independently in CoinStoreResourceUntyped vs CoinStoreResource<C>, causing inconsistent freeze enforcement across typed and untyped variants? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Function: deposit_events_mut()] [Event corruption] Can an attacker use deposit_events_mut() to replace the EventHandle with a malicious one pointing to a different GUID, causing deposit events to be emitted under an attacker-controlled event stream? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Function: withdraw_events_mut()] [Audit trail manipulation] Can withdraw_events_mut() be exploited to reset event counters or change event stream destinations, enabling attackers to hide withdrawal transactions from indexers and auditing systems? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Field: deposit_events] [Event replay] If deposit_events EventHandle is cloned or duplicated across multiple CoinStore instances, can event sequence numbers collide, causing transaction indexers to drop legitimate events and hide malicious deposits? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Field: withdraw_events] [Accounting inconsistency] Can the withdraw_events EventHandle be corrupted such that emitted events have amounts that don't match actual coin field changes, breaking off-chain balance tracking and causing fund reconciliation failures? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Function: deposit_events()] [Information leak] Does exposing EventHandle via deposit_events() allow attackers to read event stream metadata (GUID, counter) to predict future event IDs and front-run transactions based on anticipated event emissions? (Low)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Function: withdraw_events()] [State inconsistency] If withdraw_events() returns a reference that becomes stale after mutations, can concurrent transactions see inconsistent event handle state causing duplicated or skipped event emissions? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Derive: Serialize, Deserialize] [Deserialization attack] Can a malicious validator craft state data with inconsistent coin/frozen values during deserialization, causing Byzantine validators to commit invalid CoinStore states with negative or overflow balances? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Struct: CoinStoreResource] [Type confusion] During deserialization, can an attacker swap PhantomData<C> type parameters to cause CoinStore<APT> to be deserialized as CoinStore<USDC>, enabling cross-token balance confusion and theft? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Attribute: #[serde(skip)]] [Serialization bypass] Does skipping phantom_data serialization allow attackers to forge CoinStore instances with mismatched type parameters that pass Move type checks but violate type safety invariants? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Derive: Arbitrary] [Fuzzing vulnerability] Can the fuzzing-enabled Arbitrary trait generate invalid CoinStore states (e.g., frozen=true with non-zero balance changes) that expose bugs in consuming code not tested against malformed inputs? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Struct: CoinStoreResourceUntyped] [Type erasure] Can untyped deserialization via CoinStoreResourceUntyped bypass type parameter validation, allowing an attacker to construct coins of arbitrary types without proper Move type system checks? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Generic: C: CoinType] [Type parameter injection] Can an attacker satisfy the CoinType bound with a malicious type that manipulates type_tag() output, causing resource path collisions between different coin types? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Function: type_args()] [Type confusion] Does type_args() returning C::type_tag() allow type parameter substitution attacks where CoinStore<FakeCoin> masquerades as CoinStore<APT> by returning identical type tags? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Trait: MoveStructType] [Resource collision] Can MODULE_NAME and STRUCT_NAME constants be exploited in combination with malicious type_args() to create resource path collisions, causing different coin types to share the same storage location? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Field: phantom_data] [Type safety bypass] Since PhantomData<C> is skipped during serialization, can state snapshots be restored with incorrect type parameters, causing Move VM to access wrong coin types during resource lookups? (High)"
]