[
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: file_store_config] [Subdirectory injection] When file_store_config contains gcs_file_store_bucket_sub_dir, can an attacker inject path traversal sequences to write files outside the intended bucket subdirectory, overwriting other chain data or metadata files? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: file_store_config] [Local file store abuse] When using LocalFileStore variant, can an attacker set local_file_store_path to a network mount point (NFS, CIFS) that has high latency or becomes unavailable, causing the processor to hang indefinitely while writing transaction batches? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Metadata desynchronization] After processor initialization at lines 49-56, can the file store metadata become out of sync with Redis cache metadata if one update succeeds but the other fails, leading to duplicate transaction uploads or gaps in the archive? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Metadata corruption] If the processor crashes between updating Redis file_store_latest_version and updating file store metadata in the infinite loop, can this leave the system in an inconsistent state where subsequent runs skip or re-upload transaction batches? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: enable_cache_compression] [Compression algorithm vulnerability] When enable_cache_compression is true and Lz4CompressedProto format is used, can vulnerabilities in the LZ4 compression library be exploited through malicious compressed transaction data to cause buffer overflows or arbitrary code execution? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: enable_cache_compression] [Decompression bomb] Can an attacker craft malicious transactions that compress well but expand to enormous sizes during decompression, causing the processor to exhaust memory when fetching from Redis cache? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: enable_cache_compression] [Format confusion] Can mismatches between enable_cache_compression setting and actual data format in Redis cause decompression failures that crash the processor, or worse, silently corrupt transaction data during upload to file store? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: get_server_name()] [Service identification] The hardcoded server name 'idxfilestore' at line 65 is used for identification, but can multiple instances with this same name cause metric collisions or logging confusion that masks security incidents or data corruption? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: get_server_name()] [Name collision] If the framework uses get_server_name() for resource allocation or rate limiting, can identical server names across multiple instances cause resource contention or allow one instance to exhaust resources intended for others? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Async execution] The run() function is async at line 48, but if the tokio runtime is configured with limited threads, can the blocking processor.run() at line 57 starve other async tasks, causing the entire indexer service to become unresponsive? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Cancellation safety] If the async run() function is cancelled or dropped while processor.run() is executing, can this leave file uploads in a partial state or corrupt file store metadata, requiring manual recovery? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Task spawn safety] Does the framework spawn run() in a separate task, and if so, can panics in processor.run() kill only that task or potentially bring down the entire service depending on how panics are handled? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: new()] [Parameter validation] The new() constructor at lines 29-43 accepts all parameters without validation, but can an attacker call it programmatically with inconsistent values (e.g., enable_cache_compression=true but incompatible file_store_config) to create corrupted configurations? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: new()] [Builder pattern bypass] Since new() directly assigns all fields without validation at lines 36-42, can this bypass any invariants that should be enforced during configuration construction, leading to runtime errors when the processor is created? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: redis_main_instance_address] [Connection security] Does the RedisUrl at line 17 enforce TLS/SSL connections, or can configurations use unencrypted redis:// URLs that expose transaction data to network eavesdropping when transmitted between cache and file store? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: redis_main_instance_address] [Connection timeout] When Processor::new() establishes Redis connection at line 49, can an attacker configure redis_main_instance_address to point to a slow or unresponsive Redis server, causing the initialization to hang indefinitely without timeout? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: redis_main_instance_address] [Connection pooling] Does creating multiple processor instances from the same config establish independent Redis connections, and can this exhaust Redis server connection limits if many file store workers are deployed? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Restart safety] If run() is called multiple times on the same config instance, can this create multiple processor instances that compete to update the same file store metadata, causing race conditions and data corruption? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Shutdown handling] Since run() contains an infinite loop in processor.run() at line 57, how does the service handle graceful shutdown, and can forced termination leave file uploads in partial states or corrupt metadata? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [State persistence] If the processor crashes and restarts, does it correctly resume from the last committed metadata version, or can it skip versions or re-upload the same batches, causing data inconsistency? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Struct: IndexerGrpcFileStoreWorkerConfig] [Memory leaks] When file_store_config contains paths to large credential files, can repeated cloning of the config cause memory leaks if the underlying PathBuf allocations are not properly freed? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Resource cleanup] If Processor::new() succeeds at line 49 but processor.run() immediately panics at line 57, are Redis connections and file store resources properly cleaned up, or can this cause resource leaks over time? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Struct: IndexerGrpcFileStoreWorkerConfig] [Type confusion] Can deserialization vulnerabilities in the nested IndexerGrpcFileStoreConfig type cause type confusion where a GcsFileStore is mistakenly treated as LocalFileStore, leading to authentication errors or file write failures? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Struct: IndexerGrpcFileStoreWorkerConfig] [Serialization roundtrip] If the config is serialized, modified, and deserialized (e.g., for debugging or config migration), can this process introduce subtle changes in Option<bool> fields or enable_cache_compression that alter runtime behavior? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Module: processor] [Module boundary] Since processor is declared as a public module at line 5, can external code directly create Processor instances bypassing the initialization in run(), leading to unvalidated chain IDs or uninitialized metadata? (Medium)"
]