[
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Function: Pool.get_balance()] [Division by zero] Can an attacker create a malicious on-chain Pool resource with total_shares set to 0, causing a division by zero panic when get_balance() calculates (*shares * self.total_coins) / self.total_shares, leading to Rosetta API crashes and exchange integration failures? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Function: Pool.get_balance()] [Integer overflow] In the calculation (*shares * self.total_coins) / self.total_shares, can an attacker craft on-chain state where shares and total_coins are both near u64::MAX, causing the multiplication to overflow before division, returning incorrect balances to exchanges and enabling theft through balance manipulation? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Function: Pool.get_balance()] [Precision loss] Does the integer division in (*shares * self.total_coins) / self.total_shares truncate remainders, allowing an attacker to systematically extract value through repeated small withdrawals where rounding errors accumulate, leading to fund drainage from the distribution pool? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Function: Pool.get_balance()] [Zero total_coins] If total_coins is 0 but total_shares is non-zero, does get_balance() return 0 balance correctly, or can this state be exploited to cause incorrect balance reporting in Rosetta API responses, misleading exchanges about available funds? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Function: StakingContract.get_balance()] [Delegation vulnerability] Can an attacker manipulate the distribution_pool field in StakingContract to point to a malicious Pool with crafted total_shares=0, causing get_balance() to panic when called through the staking contract interface, disrupting validator reward distributions? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: StakingContract] [Deserialization attack] Can a malicious Move module create a StakingContract resource with malformed commission_percentage exceeding 100 (stored as u64), which when deserialized by Rosetta causes incorrect commission calculations, allowing operators to extract more than 100% of rewards? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: Pool] [Vector bounds] Can an attacker create a Pool where the shares vector contains duplicate AccountAddress entries, causing get_balance() to return the first match only while other shares exist, hiding staked funds from Rosetta API queries and enabling fund concealment? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: Pool] [Inconsistent state] Can on-chain state have shareholders vector length exceeding shareholders_limit after deserialization, bypassing the limit check and causing state inconsistencies between Move VM and Rosetta API representations? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: Pool] [Share-shareholder mismatch] Is there validation that shares vector and shareholders vector have consistent AccountAddress entries, or can deserialization accept state where an address appears in shareholders but not in shares, causing balance query failures? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: DelegationPool] [Inactive shares manipulation] Can an attacker craft inactive_shares vector with overlapping ObservedLockupCycle indices, causing double-counting of locked funds when Rosetta aggregates balances across lockup cycles, leading to inflated balance reports? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: COIN_MODULE] [Module substitution] Can an attacker deploy a malicious module with name 'coin' that matches COIN_MODULE constant, causing Rosetta to parse transactions targeting the fake module as legitimate coin operations, enabling transaction misclassification and fund theft? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: TRANSFER_FUNCTION] [Function collision] If multiple modules implement a 'transfer' function, does Rosetta's use of TRANSFER_FUNCTION constant properly namespace-check the module, or can transactions to unrelated transfer functions be misinterpreted as coin transfers? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: UPDATE_COMMISSION_FUNCTION] [Typo exploitation] The comment notes UPDATE_COMMISSION_FUNCTION uses misspelled 'update_commision' - can an attacker exploit this by deploying both correctly and incorrectly spelled functions, causing Rosetta to miss commission updates and report stale commission rates? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: APTOS_COIN_RESOURCE] [Resource impersonation] Can a malicious contract create a resource named 'AptosCoin' in a non-standard module, which Rosetta incorrectly parses as legitimate AptosCoin balance due to resource name matching, showing fake balances to exchanges? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: STAKE_POOL_RESOURCE] [Multiple stake pools] If an account has multiple StakePool resources at different paths, does Rosetta query using STAKE_POOL_RESOURCE constant return all pools or just the first one, potentially hiding staked funds from API consumers? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: StakingContract] [Commission overflow] Can commission_percentage field (u64) be set to values greater than 10000 (100% with two decimals), causing calculation overflows when computing commission amounts in reward distribution, allowing operators to drain the entire reward pool? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: UpdateCommissionEvent] [Commission front-running] Does Rosetta properly sequence UpdateCommissionEvent with old_commission_percentage and new_commission_percentage, or can operators front-run commission changes by claiming rewards at old rate immediately before update takes effect? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: RequestCommissionEvent] [Accumulated rewards manipulation] Can commission_amount exceed accumulated_rewards in RequestCommissionEvent, indicating the operator requested more commission than available rewards, potentially draining funds from other delegators' shares? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: UnlockStakeEvent] [Commission_paid validation] Is there validation that commission_paid in UnlockStakeEvent doesn't exceed the amount being unlocked, or can malformed events show commission exceeding principal, hiding fund extraction? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: DelegationPool] [Operator commission override] Can operator_commission_percentage in DelegationPool differ from the commission_percentage in associated StakingContract, causing different commission rates to apply depending on which struct Rosetta queries, enabling commission rate confusion attacks? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: Store] [Event handle exhaustion] Can an attacker spam create_staking_contract_events EventHandle with fake events, causing the guid counter to overflow or the event log to grow unbounded, leading to API timeouts when Rosetta queries event history? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: DistributeEvent] [Recipient validation] Does Rosetta validate that the recipient address in DistributeEvent is actually a shareholder in the pool, or can malformed events claim distributions to arbitrary addresses, hiding fund flows from auditors? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: AddStakeEvent] [Amount validation] Can AddStakeEvent report an amount that exceeds the actual stake added on-chain, causing Rosetta to report inflated staking volumes and misleading validators about their delegation amounts? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: WithdrawUndelegatedEvent] [Amount_withdrawn overflow] If amount_withdrawn in WithdrawUndelegatedEvent is u64::MAX, does Rosetta properly handle this edge case or could it cause integer overflows when aggregating total withdrawals across multiple events? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: SwitchOperatorEvent] [Operator switching race] Can rapid SwitchOperatorEvent emissions (old_operator to new_operator, then back) cause Rosetta to process events out of order, showing incorrect current operator for a stake pool and misdirecting delegation decisions? (High)"
]