[
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::create_for_write()] [File overwrite attack] Does create_for_write() enforce create_new semantics, or can attackers overwrite existing backup files by calling it twice with the same backup_handle and name, corrupting historical data? (High)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::create_for_write()] [Resource leak] If the AsyncWrite handle is not properly closed/flushed before drop, can this cause partial file writes that appear valid but are corrupted, leading to failed restores during critical recovery scenarios? (High)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::create_for_write()] [Symbolic link attack] Can attackers create symbolic links in the backup directory before calling create_for_write(), causing the function to follow symlinks and overwrite arbitrary system files? (Critical)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Type alias: FileHandle] [Handle enumeration] FileHandles are stored in manifests as plain strings - can attackers enumerate valid file handles to access backups from other nodes or organizations, violating data privacy? (Medium)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::open_for_read()] [Arbitrary file read] The file_handle parameter comes from untrusted manifest files - can attackers inject path traversal sequences like '../../../../../../etc/shadow' to read arbitrary system files during restore? (Critical)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::open_for_read()] [Race condition on read] If a file is being written by create_for_write() while simultaneously read by open_for_read(), can this cause partial reads of corrupted data to be incorporated into restored state, breaking consensus? (Critical)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::open_for_read()] [AsyncRead exhaustion] The returned AsyncRead has no size limits - can attackers provide file handles to infinite streams (e.g., /dev/zero, /dev/random) causing memory exhaustion during restore? (High)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::open_for_read()] [TOCTOU vulnerability] Between manifest validation and calling open_for_read(), can an attacker replace the backup file with malicious content, bypassing integrity checks and injecting corrupted state? (High)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::open_for_read()] [Missing checksum validation] Does open_for_read() validate file integrity (checksums, signatures) before returning the reader, or can attackers serve modified backup files without detection, corrupting restored state? (Critical)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::open_for_read()] [Compression bomb] If backup files are compressed, can attackers craft zip bombs or other compression exploits that expand to terabytes during read, causing DoS during restore operations? (High)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::save_metadata_line()] [Metadata ordering attack] The default implementation at line 170 wraps a single line in a slice - can concurrent calls reorder metadata entries, causing epoch markers or state roots to be associated with wrong blocks? (Critical)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::save_metadata_line()] [Duplicate detection missing] Does save_metadata_line() check for duplicate entries before calling save_metadata_lines(), or can attackers inject duplicate metadata causing ambiguity in which backup version to restore? (High)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::save_metadata_line()] [Wrapper overhead] Converting a single TextLine to a slice via std::slice::from_ref() at line 170 - can excessive calls cause allocation overhead leading to performance degradation during high-volume backup operations? (Low)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::list_metadata_files()] [Incomplete listing attack] If list_metadata_files() returns partial results due to pagination or timeouts, can attackers cause backup metadata to appear incomplete, forcing restore from older (possibly compromised) checkpoints? (High)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::list_metadata_files()] [FileHandle injection] Can attackers inject malicious FileHandles into the returned vector that point to system files, executable scripts, or symlinks, causing code execution when these are later passed to open_for_read()? (Critical)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::list_metadata_files()] [Unbounded result set] Does list_metadata_files() have pagination or size limits, or can an attacker create millions of tiny metadata files causing memory exhaustion when the full list is returned? (High)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::list_metadata_files()] [Ordering manipulation] The trait doesn't specify ordering guarantees for the returned vector - can non-deterministic ordering cause restore operations to process metadata in wrong sequence, corrupting state reconstruction? (Medium)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::list_metadata_files()] [Hidden file vulnerability] Do implementations include hidden files (starting with .) in the listing, or can attackers hide malicious metadata files that are processed during restore but invisible during audits? (Medium)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::backup_metadata_file()] [Metadata loss] If backup_metadata_file() moves files to a backup folder but the move operation fails mid-way, can this cause metadata to be lost from both locations, making recent backups unrecoverable? (Critical)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::backup_metadata_file()] [Path traversal in backup] The file_handle parameter comes from list_metadata_files() - can attackers craft handles with '../' sequences to move metadata files to arbitrary locations or overwrite system files? (Critical)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::backup_metadata_file()] [Race condition on move] If backup_metadata_file() is called concurrently for the same file, can race conditions cause the file to be moved twice, lost, or corrupted, breaking backup consistency? (High)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::backup_metadata_file()] [Backup folder collision] Can attackers pre-create files in the metadata backup folder with the same names as metadata files being backed up, causing the move operation to fail or overwrite important archived data? (Medium)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::save_metadata_lines()] [Atomic write failure] Does save_metadata_lines() write all lines atomically, or can partial writes occur if the operation is interrupted, leaving corrupted metadata files that break restore operations? (Critical)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::save_metadata_lines()] [Line ordering preservation] Is the order of TextLines in the input slice guaranteed to be preserved in the saved file, or can reordering cause temporal inconsistencies in backup metadata? (High)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/mod.rs] [Trait method: BackupStorage::save_metadata_lines()] [Empty slice handling] What happens if save_metadata_lines() is called with an empty slice - does it create an empty file, skip creation, or error? Can this be exploited to create placeholder files that disrupt backup validation? (Medium)"
]