[
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: LogicalAndFilters] [Unbounded recursion] Can a malicious client craft deeply nested LogicalAndFilters with recursive BooleanTransactionFilter references causing stack overflow during deserialization, leading to indexer node crashes and DoS? (High)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: LogicalAndFilters] [Memory exhaustion] Can an attacker send LogicalAndFilters with millions of filter entries in the repeated filters vector, causing unbounded memory allocation and OOM crashes on the indexer service? (High)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: LogicalAndFilters] [Empty filter bypass] Does LogicalAndFilters properly validate that the filters vector is non-empty, or can an attacker send empty AND filters that always evaluate to true, bypassing transaction filtering entirely? (Medium)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: LogicalOrFilters] [Unbounded recursion] Can malicious LogicalOrFilters contain recursive BooleanTransactionFilter chains that cause exponential evaluation complexity, leading to CPU exhaustion DoS attacks on indexer nodes? (High)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: LogicalOrFilters] [Memory exhaustion] Can an attacker craft LogicalOrFilters with extremely large repeated filters vectors, causing memory exhaustion during protobuf deserialization before any validation occurs? (High)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: LogicalOrFilters] [Empty filter bypass] Does LogicalOrFilters handle empty filters vectors correctly, or does an empty OR filter incorrectly evaluate to false, allowing filter bypass by sending contradictory filter combinations? (Medium)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: TransactionRootFilter] [Optional field mishandling] Can an attacker send TransactionRootFilter with both success and transaction_type set to None, causing the filter to match all transactions and bypassing intended filtering logic? (Medium)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: TransactionRootFilter] [Type confusion] Does the transaction_type field properly validate that the i32 value corresponds to a valid TransactionType enum variant, or can invalid enum values cause panics or undefined behavior? (Medium)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: TransactionRootFilter] [Boolean logic bypass] Can an attacker craft TransactionRootFilter where success is Some(true) but applies it to genesis transactions, causing incorrect filtering that exposes system transactions? (Low)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: EntryFunctionFilter] [String injection] Can malicious EntryFunctionFilter contain address, module_name, or function fields with SQL injection payloads, Unicode exploits, or control characters that corrupt indexer database queries? (High)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: EntryFunctionFilter] [Address validation bypass] Does EntryFunctionFilter validate that address strings are properly formatted hex addresses, or can an attacker send invalid addresses that bypass filtering or cause parsing errors? (Medium)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: EntryFunctionFilter] [Case sensitivity bypass] Are the module_name and function string comparisons case-sensitive, or can an attacker bypass filters by using different casing (e.g., 'Transfer' vs 'transfer')? (Low)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: EntryFunctionFilter] [Wildcard injection] Can an attacker inject regex wildcards or SQL LIKE patterns into address, module_name, or function fields to match more transactions than intended? (Medium)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: EntryFunctionFilter] [Memory exhaustion] Can extremely long strings (>1MB) in address, module_name, or function fields cause memory exhaustion during string comparison operations? (Medium)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: EntryFunctionFilter] [Empty string matching] Do empty strings in optional fields match all values or no values, and can this ambiguity be exploited to bypass filtering? (Low)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: UserTransactionPayloadFilter] [None field bypass] Can a UserTransactionPayloadFilter with entry_function_filter set to None bypass all payload filtering, allowing malicious transactions to be indexed? (Medium)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: UserTransactionPayloadFilter] [Missing payload types] Does UserTransactionPayloadFilter only filter EntryFunction payloads, allowing Script or Multisig payloads to bypass filtering entirely? (Medium)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: UserTransactionFilter] [Sender address spoofing] Does UserTransactionFilter validate sender addresses against transaction signatures, or can an attacker specify arbitrary sender filters to access transactions from other accounts? (High)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: UserTransactionFilter] [Optional field combination] Can both sender and payload_filter be None, causing the filter to match all user transactions and potentially exposing sensitive transaction data? (Medium)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: UserTransactionFilter] [Address format bypass] Can an attacker send sender addresses in different formats (0x-prefixed vs non-prefixed, uppercase vs lowercase) to bypass filtering logic? (Low)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: MoveStructTagFilter] [Type parameter injection] Does MoveStructTagFilter validate Move struct type parameters, or can an attacker inject malicious generic type arguments that cause type confusion? (Medium)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: MoveStructTagFilter] [Module path traversal] Can malicious module or name fields contain path traversal sequences (../) that access unauthorized Move modules? (Medium)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: MoveStructTagFilter] [String injection] Can address, module, or name fields contain special characters that break Move struct tag parsing or cause injection vulnerabilities? (Medium)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: EventFilter] [Substring filter bypass] Does data_substring_filter use safe substring matching, or can regex injection or glob patterns in the filter string cause catastrophic backtracking DoS? (High)",
  "[File: aptos-core/protos/rust/src/pb/aptos.indexer.v1.rs] [Struct: EventFilter] [Binary data handling] Can data_substring_filter properly handle binary event data with null bytes, invalid UTF-8, or control characters without crashing or causing corruption? (Medium)"
]