[
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: from_delete_table_item()] [Undeletion vulnerability] Once is_deleted is set to true, can the item be resurrected by subsequent write operations? Would this create inconsistent history where item appears deleted then undeleted? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Struct: CurrentTableItem] [Permanent deletion] Does is_deleted=true actually remove the item from queries, or can it still be accessed? Can attackers exploit this to access supposedly deleted sensitive data? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: from_delete_table_item()] [Value exposure] When item is deleted, decoded_value is set to None on line 115 - is this sufficient to prevent data leakage, or does the key field still expose sensitive information? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: from_write_table_item()] [Deletion override] Can a WriteTableItem operation override an item that was marked as deleted? Would this allow resurrecting deleted data without proper authorization? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Struct: CurrentTableItem] [Memory exhaustion] Can attackers create millions of table items with unique keys to exhaust database storage, causing indexer to run out of disk space and halt? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: from_write_table_item()] [String allocation] The key and table_handle fields as String - can extremely long strings cause excessive memory allocation during indexing, leading to OOM crashes? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Struct: TableItem] [History bloat] Since TableItem records all changes, can attackers repeatedly modify same table items to create unbounded history growth, exhausting database capacity? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: from_write_table_item()] [JSON size] Can decoded_value contain arbitrarily large JSON objects that cause database column overflow or slow query performance? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Struct: TableMetadata] [Metadata explosion] Can attackers create many tables with unique handles to exhaust table_metadatas storage, even if tables are empty? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: TableMetadata::from_write_table_item()] [Type mismatch] Can key_type or value_type on lines 127-128 be manipulated to not match actual data types, causing applications to misinterpret table data? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Struct: TableMetadata] [Missing validation] The handle on line 126 is taken directly from WriteTableItem - can this be spoofed to associate wrong metadata with a table? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: TableMetadata::from_write_table_item()] [Metadata update] If table metadata changes across transactions, does from_write_table_item() update existing metadata or ignore changes, causing stale type information? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Struct: TableMetadata] [Type injection] Can key_type or value_type contain malicious Move type strings that exploit parser vulnerabilities in tools processing this metadata? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: TableMetadata::from_write_table_item()] [Panic on missing data] The unwrap() on line 127 - can this panic if data field is None, crashing the indexer during metadata extraction? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: from_write_table_item()] [to_string() safety] The key.to_string() on line 64 - can malformed key byte vectors cause UTF-8 conversion errors or produce invalid strings? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: from_write_table_item()] [Handle encoding] The handle.to_string() on line 65 - does this properly encode addresses, or can it produce strings with unexpected characters that break address standardization? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: from_delete_table_item()] [String truncation] If key or handle strings are truncated during to_string() conversion, can this cause hash collisions or make items un-queryable? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: from_write_table_item()] [Unicode normalization] Are key strings normalized for unicode equivalence? Can different unicode representations of same key create duplicate entries? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: from_write_table_item()] [Indexer poisoning] Can malicious on-chain transactions be crafted specifically to exploit indexer parsing logic, causing the indexer to diverge from actual blockchain state? (Critical)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: from_delete_table_item()] [State query manipulation] By carefully timing delete operations, can attackers cause indexer queries to return inconsistent results that differ from on-chain reality, misleading users and applications? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Struct: CurrentTableItem] [View manipulation] Can attackers exploit timing windows to manipulate CurrentTableItem state such that dApps querying the indexer make incorrect decisions based on stale or forged data? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: from_write_table_item()] [Indexer lag exploitation] If indexer falls behind blockchain tip, can attackers exploit the lag to frontrun transactions based on unindexed state changes? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Struct: TableItem] [Historical rewrite] Can manipulating transaction_version or write_set_change_index values cause indexer to rewrite history, showing different past states than what actually occurred on-chain? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: from_write_table_item()] [Table confusion] Can identical keys in different tables cause confusion if table_handle validation is weak, allowing cross-table data leakage or corruption? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_tables.rs] [Function: from_delete_table_item()] [Cross-table deletion] Can a delete operation in one table accidentally affect items in another table if hash collisions occur in key_hash values? (Medium)"
]