[
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [Type size exploit] V20 added 'Limits for bounding MoveVM type sizes' and V14 added 'Gas for type creation' - if gas_feature_version is manipulated to show version 13 or below, can attackers create arbitrarily large or deeply nested types without gas costs or size limits, causing VM crashes or memory exhaustion? (High)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [Type tag conversion bug] V21 claims to 'Fix type to type tag conversion in MoveVM' - can attackers exploit the unfixed behavior by forcing gas_feature_version 20, potentially causing type confusion vulnerabilities, incorrect serialization, or bypassing type safety checks? (High)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [Enum gas bypass] V22 added gas parameters for enums - can transactions exploit version checks to use enum types without proper gas accounting, enabling complex computation at underpriced rates? (Medium)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [u16/u32/u256 underpricing] V5 added support for u16, u32, u256 types - are operations on these types properly priced in earlier versions, or can version manipulation exploit cheaper u64-based pricing for larger integer operations? (Low)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Constant: LATEST_GAS_FEATURE_VERSION] [Governance script bypass] V18 added 'Separate limits for governance scripts' - if LATEST_GAS_FEATURE_VERSION is used to determine governance script privileges, can attackers compile with older versions to bypass governance-specific limits and execute privileged operations without proper restrictions? (Critical)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [Dependency limit bypass] V15 added 'Gas & limits for dependencies' - can manipulating gas_feature_version to 14 or below allow publishing modules with unlimited or unaccounted dependencies, causing exponential gas consumption during module loading and validation? (High)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [Function compatibility bug] The code shows gas_feature_version < RELEASE_V1_34 triggers function_compat_bug - can attackers exploit this intentional bug for versions below 34 to bypass function compatibility checks during module publishing, potentially allowing ABI-breaking upgrades? (High)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Constant: LATEST_GAS_FEATURE_VERSION] [Proposal validation bypass] The on-chain gas_schedule.move requires new_gas_schedule.feature_version >= cur_gas_schedule.feature_version, but does it validate against LATEST_GAS_FEATURE_VERSION? Can a governance proposal set feature_version to 1000, breaking all validators compiled with version 43? (Critical)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [Resource group underpricing] V9 added 'Accurate tracking of the cost of loading resource groups' - can forcing gas_feature_version 8 cause resource groups to be loaded with inaccurate (lower) costs, enabling storage access patterns that exhaust validator I/O at underpriced rates? (High)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [Native function gas bypass] V10 added generate_unique_address and get_txn_hash natives, V6 added blake2b_256 - if these natives are available but gas_feature_version is manipulated to pre-introduction versions, are they available for free or with wrong gas costs? (Medium)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [Bulletproofs cost manipulation] V11 added Ristretto255 and Bulletproofs natives - these are expensive cryptographic operations; can version manipulation exploit their availability without proper gas charges, enabling computational DoS attacks? (High)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [BCS serialization exploit] V22 added gas for native function bcs::serialized_size - can calling this function with gas_feature_version 21 or below cause underpriced serialization calculations that enable complex BCS parsing attacks? (Low)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [Event memory leak] V4 mentions 'Consider memory leaked for event natives' - does this mean V3 and below don't account for event memory? Can this be exploited to exhaust validator memory through excessive event emission at older gas versions? (Medium)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [Missing V17 release] The constants jump from RELEASE_V1_16 (21) to RELEASE_V1_18 (22) - is V17 missing intentionally? Can systems that assume consecutive releases encounter undefined behavior or off-by-one errors when validating or comparing versions? (Low)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [V13 skip vulnerability] The changelog explicitly notes V13 was skipped due to testnet mis-operation - are there any residual checks or feature flags that still reference version 13? Could these cause crashes or incorrect behavior if encountered? (Medium)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [Version gap exploitation] There are several gaps in release numbering (V12 uses version 13, V15 uses 20, skipping 14,16-19 values) - can an attacker craft an on-chain gas schedule with intermediate version numbers that validators don't recognize, causing parsing failures or default behavior? (Medium)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [Future version collision] If development branches independently add RELEASE_V1_40 with different version values, can this cause merge conflicts that go undetected, resulting in ambiguous version constants in production builds? (Medium)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Constant: LATEST_GAS_FEATURE_VERSION] [VM initialization race] When AptosVM is initialized with LATEST_GAS_FEATURE_VERSION, but the on-chain gas schedule has a different feature_version, which takes precedence? Can this mismatch cause make_prod_gas_meter to use inconsistent gas parameters, breaking deterministic execution? (Critical)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Constant: LATEST_GAS_FEATURE_VERSION] [Genesis vs runtime mismatch] Genesis initialization uses LATEST_GAS_FEATURE_VERSION from compiled code, but runtime uses on-chain GasScheduleV2.feature_version - if these diverge after genesis, can it cause incompatibility between genesis state and post-genesis execution? (High)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [State sync corruption] During state snapshot restoration, LATEST_GAS_FEATURE_VERSION is used as default - if a node restores state from a snapshot with a different gas version, can this cause the node to compute incorrect state roots permanently? (Critical)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Constant: LATEST_GAS_FEATURE_VERSION] [Speculative execution divergence] In parallel execution with Block-STM, if different threads use cached gas calculations from different gas_feature_versions, can this cause non-deterministic ordering in conflict resolution, breaking parallel execution correctness? (High)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [Module cache poisoning] The code_cache_global_manager uses gas_feature_versions - can version mismatches cause the module cache to serve modules compiled for wrong gas versions, leading to execution with incorrect gas schedules? (High)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [Rollback safety] If a critical bug is found in gas feature version 43 and the network needs to rollback to version 42, does the architecture support downgrading LATEST_GAS_FEATURE_VERSION, or would this require a hard fork due to on-chain validation requiring version >= current? (Critical)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Module: gas_feature_versions] [Ancient version attack] Are there any protections against executing transactions with extremely old gas_feature_versions (e.g., version 11 from 2022)? Can attackers exploit long-patched vulnerabilities by forcing old version execution? (Medium)",
  "[File: aptos-core/aptos-move/aptos-gas-schedule/src/ver.rs] [Constant: LATEST_GAS_FEATURE_VERSION] [Migration failure] If a major version bump changes fundamental gas calculation methods (like V7's storage fee formulae), can transactions in-flight during the upgrade execute with mixed gas versions, causing incorrect charging or validation failures? (High)"
]