[
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [SSRF] Can an attacker provide internal network URIs (e.g., http://localhost:8080, http://127.0.0.1, http://169.254.169.254) to access internal metadata services, cloud instance metadata, or private network resources, potentially exposing sensitive validator configuration, API keys, or internal infrastructure details? (Critical)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [SSRF] Does the URI validation at line 61 prevent file:// scheme attacks that could read arbitrary local files from the crawler server filesystem, potentially exposing private keys, configuration files, or database credentials? (Critical)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [SSRF] Can an attacker use the gopher:// protocol scheme to perform SSRF attacks against internal services that don't expect HTTP traffic, potentially compromising internal databases or message queues? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [SSRF] Is there validation to prevent URIs pointing to private IPv4 ranges (10.0.0.0/8, 172.16.0.0/12, 192.168.0.0/16) that could access internal infrastructure or validator nodes? (Critical)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [SSRF] Can an attacker exploit IPv6 addresses or IPv6-mapped IPv4 addresses (::ffff:127.0.0.1) to bypass any IP-based SSRF protections and access restricted internal services? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [SSRF] Does the code prevent DNS rebinding attacks where a malicious DNS server initially resolves to a public IP but then changes to an internal IP during the retry logic at lines 80-96, allowing time-of-check-to-time-of-use SSRF exploitation? (Critical)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [SSRF] Can an attacker use HTTP redirect responses to redirect the reqwest client from a legitimate external URL to an internal network resource, bypassing any initial URI validation checks? (Critical)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [SSRF] Is there protection against URIs using rare or obscure schemes (dict://, ldap://, tftp://) that reqwest might support, allowing unexpected protocol interactions with internal services? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [SSRF] Can an attacker use the ftp:// scheme to access internal FTP servers or perform FTP bounce attacks through the crawler infrastructure? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [SSRF] Does the trim() call at line 61 properly handle Unicode whitespace characters that could be used to obfuscate malicious URIs and bypass basic validation checks? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [TOCTOU] Is there a race condition between the get_uri_metadata() HEAD request at line 32 that validates file size and MIME type, and the actual GET request at lines 60-64 that fetches content, where an attacker could swap the content between checks to bypass validation? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [TOCTOU] Can an attacker exploit the time gap between the MIME type check at line 33 and the JSON parsing at lines 66-69 to serve different content types, potentially causing the parser to process malicious image files as JSON or vice versa? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [TOCTOU] During the exponential backoff retry period (lines 80-96), can an attacker change the server response between retries to bypass size or MIME type validation on subsequent attempts? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [TOCTOU] If multiple concurrent requests are made to the same URI, can inconsistent validation results lead to some requests bypassing size limits while others are rejected, creating unpredictable behavior? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [Integer Overflow] At line 41, can an attacker manipulate the Content-Length header to cause integer overflow when the u32 size value is compared against max_file_size_bytes, potentially bypassing the file size check? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [Integer Overflow] If the Content-Length header contains a value larger than u32::MAX (4,294,967,295), will the parse operation at get_uri_metadata fail silently or could it wrap around to a small value, bypassing size validation? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [Integer Overflow] Can an attacker provide a negative Content-Length value that, when parsed as u32, wraps to a large positive value or zero, bypassing the size check at line 41? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [Type Confusion] What happens if get_uri_metadata returns size=0 (line 35 in lib.rs) due to missing Content-Length header, and this zero value passes the size check at line 41, allowing unlimited file downloads? (Critical)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [Memory Exhaustion] At lines 66-69, can an attacker provide deeply nested JSON objects (e.g., 100,000+ levels deep) that cause stack overflow or excessive memory allocation during serde_json parsing, crashing the crawler service? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [Memory Exhaustion] Can an attacker send JSON with extremely large string values or arrays that exceed available memory, causing the crawler to crash or become unresponsive despite passing the file size check? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [DoS] Can an attacker craft JSON with millions of duplicate keys that cause quadratic parsing time complexity, effectively DoSing the crawler even with files under the size limit? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [Compression Bomb] If the server sends JSON with Content-Encoding: gzip, can an attacker send a small compressed payload that expands to gigabytes when decompressed by reqwest, bypassing the size check at line 41? (Critical)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [JSON Injection] At lines 71-73, can an attacker inject malicious content into the 'image' or 'animation_url' fields that contains script tags, SQL injection payloads, or path traversal sequences that could affect downstream systems? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [Type Confusion] What happens if parsed_json['image'] or parsed_json['animation_url'] at lines 71-73 are not strings but objects, arrays, or null values - could this cause unexpected behavior in downstream processing? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/json_parser.rs] [Function: parse()] [Unicode Attacks] Can an attacker include Unicode normalization attacks, zero-width characters, or right-to-left override characters in JSON string values that bypass validation in downstream systems? (Low)"
]