[
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Function: execute()] [OriginatingAddress Table Update Delay] The on-chain rotation should update OriginatingAddress table atomically, but if there's reorg or consensus delay, can the CLI read stale table data for address lookup causing fund loss? (High)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Function: execute()] [Profile Address Consistency] Line 304 sets account: Some(current_address) in new profile - if current_address was derived incorrectly or the on-chain rotation fails after this point, does the new profile contain wrong address leading to fund loss? (High)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Function: execute()] [Public Key Derivation Race] Lines 152 and 159 derive public_key for current key - if the account has recently rotated on-chain but this CLI operation uses stale cached profile data, can public key mismatch cause rotation to fail with funds locked? (Medium)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Function: execute()] [Transaction Options State Mutation] self.txn_options is consumed by submit_transaction at line 251 - if txn_options contains mutable state like nonces or sequence numbers, can the consumption break retry logic or subsequent operations? (Low)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Struct: NewAuthKeyOptions] [Derivation Path Injection] Lines 62-67 accept new_derivation_path as String without validation - can an attacker inject shell metacharacters or control sequences that get passed to hardware wallet libraries causing command injection? (High)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Struct: NewAuthKeyOptions] [Derivation Index Type Confusion] Line 72 accepts new_derivation_index as String instead of integer - can non-numeric strings, negative numbers, or extremely large numbers bypass validation and cause integer overflow in BIP44 derivation path construction? (Medium)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Struct: NewAuthKeyOptions] [Private Key File Path Traversal] Line 56 accepts new_private_key_file as PathBuf without sanitization - can directory traversal sequences (../../../etc/passwd) allow reading arbitrary files as private keys, leaking sensitive system data? (High)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Struct: NewAuthKeyOptions] [Private Key String Length] Line 60 accepts new_private_key as unbounded String - can extremely long strings (gigabytes) cause memory exhaustion DoS or integer overflow in length calculations during parsing? (Medium)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Struct: NewProfileOptions] [Profile Name Special Characters] Line 84 accepts save_to_profile as String without character validation - can special characters in profile names (newlines, nulls, path separators) corrupt config file format or enable injection attacks? (Medium)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Struct: RotateKey] [TransactionOptions Injection] Line 42 embeds txn_options containing URLs, private keys, and addresses - can malicious values in TransactionOptions bypass CLI validation and enable broader attacks beyond just key rotation? (Medium)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Function: execute()] [Ledger App Version Mismatch] aptos_ledger calls assume specific Ledger app versions - can incompatible app versions return unexpected signature formats or public keys that pass CLI validation but fail on-chain, permanently locking funds? (High)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Function: execute()] [Ledger Device Swap Attack] Between lines 214 (current key signing) and 231 (new key signing), can an attacker perform a physical device swap to trick users into signing with wrong Ledger device, rotating account to attacker's hardware wallet? (High)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Function: execute()] [Ledger Blind Signing Vulnerability] The rotation_msg signed at lines 214-217 is not displayed in human-readable format on Ledger screen - can users be tricked into signing malicious rotation challenges that rotate to attacker keys while displaying seemingly legitimate data? (Critical)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Function: execute()] [Hardware Wallet Timeout] aptos_ledger::sign_message() calls may timeout if user delays approval - can timeout handling retry with different challenge messages, causing signature/message pair inconsistencies that break on-chain validation? (Medium)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Function: execute()] [Ledger Connection Hijacking] The hardware wallet connection may use USB HID without secure channels - can malware on the host intercept USB traffic to capture signatures or modify rotation messages in transit? (High)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Function: execute()] [account_rotate_authentication_key Parameter Mismatch] Lines 253-261 call aptos_stdlib::account_rotate_authentication_key with 6 parameters - if the Move function signature changes (adds/removes parameters), can ABI mismatch cause silent failures or enable parameter injection attacks? (High)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Function: execute()] [Move Function Gas Estimation] The account_rotate_authentication_key call doesn't show explicit gas limit - can the Move function consume more gas than estimated due to OriginatingAddress table updates, causing rotation to fail mid-execution and lock funds? (High)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Function: execute()] [Move Abort Code Handling] If account_rotate_authentication_key aborts (e.g., EWRONG_CURRENT_PUBLIC_KEY), the error handling at lines 270-280 may not decode Move abort codes - can this hide critical security errors like signature validation failures? (Medium)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Function: execute()] [Scheme Integer Casting] Lines 254 and 256 pass scheme as '0' which gets cast to u8 in Move - can integer casting vulnerabilities in Move allow negative schemes or schemes > 255 to bypass signature validation? (Low)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Function: execute()] [Public Key Bytes Vector Encoding] Lines 255 and 257 pass public key bytes as Vec<u8> - can inconsistencies between Rust Vec and Move vector encoding cause length mismatches or enable buffer overflow in Move contract? (Medium)",
  "[File: aptos-core/crates/aptos/src/account/key_rotation.rs] [Function: execute()] [Signature Bytes Vector Length] Lines 258-261 convert signatures to Vec<u8> without length checks - can oversized signatures (e.g., from multi-ed25519) cause Move VM memory exhaustion or enable signature padding attacks? (Medium)"
]