[
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: from_event()] [Error context leakage] Lines 257-260 include the raw JSON data in error messages - can this leak sensitive transaction data in logs, or can maliciously large data cause log flooding DoS? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Derive: Clone] [Deep copy cost] All structs derive Clone - can an attacker trigger expensive deep clones of structs containing large BigDecimal values or long strings, causing indexer performance degradation? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: CoinInfoResource] [Clone safety] The supply field contains nested Option<Vec<>> structures - does cloning preserve all interior mutability correctly, or can shared references cause race conditions? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Derive: Debug] [Information disclosure] All structs derive Debug - can printing these structs in logs expose sensitive information like private keys in address fields or exploit debug formatting for injection attacks? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: get_coin_type_trunc()] [Database key collision] The truncated coin_type (up to 5000 chars) is likely used as a database key - can Unicode normalization differences cause two distinct coin types to hash to the same database key? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: CoinInfoType] [Creator address validation] The creator_address is extracted from MoveType but not validated - can malformed addresses (wrong length, invalid characters) cause database constraint violations or query injection? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Macro: deserialize_from_string] [Custom deserializer] Lines 12, 91-92, 104-105, 126-127, 132-133, 138-139 use custom deserialize_from_string - can this deserializer be exploited with specially crafted string representations to bypass validation? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: from_resource()] [Version tracking] The txn_version parameter is used in error messages but not validated - can providing txn_version = i64::MIN or i64::MAX cause integer overflow in downstream code that uses this for ordering? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: from_write_resource()] [Recursive parsing] Line 224-234 calls MoveResource::from_write_resource() then Self::from_resource() - can deeply nested coin types cause stack overflow during recursive parsing? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Constant: COIN_TYPE_HASH_LENGTH] [Magic number] The constant is set to 5000 - is this length chosen based on security analysis, or can collision attacks be mounted with modern computing power against truncated 5000-char strings? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: to_hash()] [Hash algorithm] The hash_str() function is imported from util module - if it uses a cryptographically weak hash (like FNV or djb2), can attackers pre-compute collisions to create indistinguishable coin types? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: OptionalAggregatorWrapperResource] [Empty vec] The vec field can be empty - if a coin's supply is intentionally untracked (vec is empty), does the indexer correctly distinguish this from zero supply or missing data? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: AggregatorWrapperResource] [Multiple aggregators] The vec can contain multiple AggregatorResource elements - if multiple aggregators are present, does get_aggregator_metadata() correctly select the first, or should it aggregate them causing supply miscalculation? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: IntegerWrapperResource] [Multiple values] Similar to aggregators, the vec can have multiple IntegerResource elements - does get_supply() correctly handle this, or can multiple values cause supply duplication? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Enum: CoinResource] [Exhaustive matching] The enum has two variants but pattern matching in from_resource uses separate conditionals - can future variants be added without compiler errors, causing silent mishandling of new coin resource types? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Enum: CoinEvent] [Event variant safety] The enum has WithdrawCoinEvent and DepositCoinEvent - if the framework adds new event types (e.g., MintEvent), will the indexer silently ignore them causing incomplete event tracking? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: CoinInfoResource] [String injection] The name and symbol fields are arbitrary strings - can they contain SQL injection payloads, XSS vectors, or format string exploits that are executed when the indexer stores/displays them? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: EventGuidResource] [Address injection] The addr field is a String - can malformed addresses containing newlines, nulls, or control characters cause log injection or downstream parsing errors? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: AggregatorResource] [Key format] The key field is unvalidated String - can attackers inject JSON, SQL, or other payloads in table keys that get executed during aggregator value lookups? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: CoinStoreResource] [Event handle race] The deposit_events and withdraw_events contain guid fields - can concurrent transactions to the same coin store cause guid creation_num collisions if event counting is not atomic? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: IntegerResource] [BigDecimal mutation] If BigDecimal supports interior mutability, can concurrent reads of the value field while it's being deserialized cause data races or torn reads? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: from_resource()] [Error recovery] When serde deserialization fails, the error includes raw JSON data - can the indexer recover and continue processing, or does a single malformed coin resource crash the entire indexing pipeline? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: from_write_resource()] [Nested error context] The function nests multiple context() calls - can deeply nested errors cause stack overflow when error traces are generated, especially for large WriteResource objects? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: from_event()] [Partial failure] If WithdrawEvent deserialization succeeds but the amount field is invalid, does the indexer record a withdraw with zero amount, skip it, or fail the entire transaction indexing? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: from_move_type()] [Type parameter handling] Move structs can have generic type parameters (e.g., CoinStore<CoinType>) - does the function correctly preserve type parameters in coin_type string, or can parameter erasure cause different coin stores to appear identical? (Critical)"
]