[
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Function: From<FeatureFlag> for AptosFeatureFlag] [Cryptographic features] Features like Bls12381Structures, Bn254Structures, BulletproofsNatives enable cryptographic operations. Could enabling these without proper validation allow malicious transactions to bypass signature checks or forge proofs? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Function: From<FeatureFlag> for AptosFeatureFlag] [Resource safety] Features like ResourceGroups, SaferResourceGroups, EnableResourceAccessControl affect Move's resource model. Can enabling/disabling these mid-chain cause resource duplication or loss of funds? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Function: From<FeatureFlag> for AptosFeatureFlag] [Account abstraction] KeylessAccounts, AccountAbstraction, DerivableAccountAbstraction enable new authentication methods. Can malicious activation of these features allow unauthorized access to existing accounts? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Function: From<FeatureFlag> for AptosFeatureFlag] [Gas mechanics] CollectAndDistributeGasFees, ChargeInvariantViolation, EmitFeeStatement modify gas handling. Can manipulating these through governance cause incorrect gas charging, enabling DoS or fund theft? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Function: From<FeatureFlag> for AptosFeatureFlag] [Staking features] DelegationPools, DelegationPoolPartialGovernanceVoting, CommissionChangeDelegationPool affect staking. Can malicious feature activation allow validators to steal delegated stake or manipulate voting power? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Function: From<FeatureFlag> for AptosFeatureFlag] [Transaction features] TransactionPayloadV2, OrderlessTransactions, AllowSerializedScriptArgs change transaction processing. Could enabling these create replay attack vectors or transaction malleability issues? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Function: From<FeatureFlag> for AptosFeatureFlag] [Consensus features] ReconfigureWithDkg, JwkConsensus affect consensus and validator coordination. Can activating these features mid-epoch cause consensus failures or validator set desynchronization? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Function: From<AptosFeatureFlag> for FeatureFlag] [Exhaustiveness] The comment at line 420 says this is just for ensuring 1-1 mapping. If AptosFeatureFlag adds a new variant without updating this file, could missing match arms cause panics when reading on-chain features? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Function: From<AptosFeatureFlag> for FeatureFlag] [Conversion asymmetry] Are the two From implementations truly symmetric? Could subtle differences in the match arms cause round-trip conversion (FeatureFlag -> AptosFeatureFlag -> FeatureFlag) to produce different results? (Medium)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Function: has_modified()] [Logic inversion] The has_modified() method at line 605 checks if ANY enabled feature is not on-chain enabled OR ANY disabled feature IS on-chain enabled. Could this logic be inverted or manipulated to hide malicious feature changes from detection? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Function: has_modified()] [Partial detection] Does has_modified() detect all types of modifications, or could an attacker craft a proposal that modifies features in a way that this check misses? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Function: has_modified()] [Clone overhead] The method clones features at lines 608 and 612 for each comparison. Could this be exploited in a DoS attack with extremely large feature lists to cause performance degradation? (Low)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Function: From<&AptosFeatures> for Features] [Iteration order] The implementation at line 620 uses FeatureFlag::iter() from strum. Is the iteration order deterministic and consistent across all validator nodes? Could non-deterministic ordering cause state divergence? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Function: From<&AptosFeatures> for Features] [Missing features] If AptosFeatures contains feature flags that don't have corresponding FeatureFlag enum variants, are they silently ignored? Could this hide malicious on-chain feature activations? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Function: From<&AptosFeatures> for Features] [Conversion panics] The conversion from FeatureFlag to AptosFeatureFlag (line 621) could panic if the mapping is incomplete. Could this be exploited to crash validators during feature flag synchronization? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Enum: FeatureFlag] [Naming collision] The enum uses snake_case serde rename (line 53). Could malicious JSON input with crafted feature names cause deserialization to map to wrong features or bypass validation? (Medium)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Enum: FeatureFlag] [Enum ordering] Adding new FeatureFlag variants changes the derived Hash and PartialEq behavior. Could this cause existing governance proposals in the mempool to become invalid or behave differently? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Enum: FeatureFlag] [Feature count] With 106 feature flags, could integer overflow occur when counting or processing all features in various operations? (Low)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Enum: FeatureFlag] [Clone semantics] FeatureFlag derives Clone. Are there any assumptions that feature flags are immutable singletons? Could cloning cause issues with reference equality checks elsewhere in the codebase? (Low)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Struct: Features] [Invariant violation] The Features struct can have a feature in both enabled and disabled vectors simultaneously. Is this invariant enforced, or could it cause undefined behavior in on-chain execution? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Struct: Features] [Serialization attack] Features uses serde with default attributes. Could a malicious serialized Features object with crafted field values bypass validation when deserialized? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Struct: Features] [Empty vs null] The is_empty() method checks both vectors are empty. Could there be a semantic difference between an empty Features and a missing/null Features that causes security issues? (Medium)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Struct: Features] [Vector capacity] Are there limits on the size of enabled/disabled vectors? Could unbounded growth cause memory exhaustion in governance proposal storage? (Medium)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Multi-feature] [VM format conflicts] Could enabling VMBinaryFormatV9 while VMBinaryFormatV6/V7/V8 are also enabled cause validators to disagree on which bytecode version to execute? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Multi-feature] [Keyless account variants] KeylessAccounts, KeylessButZklessAccounts, KeylessAccountsWithPasskeys, and FederatedKeyless provide different keyless authentication modes. Can conflicting combinations compromise account security? (Critical)"
]