[
  "[File: types/src/account_config/events/burn_token.rs] [Struct: BurnToken.amount] [Minimum Burn] Although Move enforces amount > 0, if a BurnToken with amount=0 is somehow created, could it cause division-by-zero errors in percentage calculations or break invariants expecting positive burns? (Low)",
  "[File: types/src/account_config/events/burn_token.rs] [Struct: BurnToken.id] [Property Version Wraparound] If property_version wraps around from u64::MAX to 0, could this create token ID collisions where a new token has the same ID as an old burned token? (Medium)",
  "[File: types/src/account_config/events/burn_token.rs] [Struct: BurnToken.id] [Empty String Fields] Can TokenDataId have empty strings for collection or name fields, and would such events cause issues in indexer queries that assume non-empty identifiers? (Low)",
  "[File: types/src/account_config/events/burn_token.rs] [Function: try_from_bytes()] [Gas Exhaustion] When events are deserialized during transaction execution, can an attacker craft events with maximum-size String fields in TokenDataId that consume excessive gas, preventing transaction completion? (Medium)",
  "[File: types/src/account_config/events/burn_token.rs] [Integration: Indexer] [Indexer DoS] Can an attacker emit massive numbers of BurnToken events in a single transaction, overwhelming indexer capacity and causing event processing delays or failures? (Medium)",
  "[File: types/src/account_config/events/burn_token.rs] [Struct: BurnToken] [Hash Collision] If BurnToken instances are used as keys in hash maps or for content addressing, could crafted events with specific AccountAddress and TokenId values cause hash collisions leading to event overwrites? (Low)",
  "[File: types/src/account_config/events/burn_token.rs] [Integration: Event Hashing] [Preimage Attack] If event signatures or Merkle tree leaves are derived from BurnToken serialization, could an attacker find preimages that produce identical hashes for different burn events? (Low)"
]