[
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Replay Protection Weakness] If replay protection mechanisms use time windows based on duration_since_epoch(), can clock manipulation extend or shrink these windows, potentially enabling transaction replay attacks? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Gas Price Manipulation] If gas price calculations include time-based adjustments using duration_since_epoch(), can validators with manipulated clocks charge incorrect gas amounts, either stealing from users or causing transaction rejections? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [State Expiry Attack] If state expiry or pruning decisions use duration_since_epoch(), can time manipulation cause premature deletion of active state or indefinite retention of expired state, leading to state corruption? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Time-Locked Transactions] For transactions with time-lock conditions (execute after specific timestamp), can validators with fast-forwarded clocks execute time-locked transactions prematurely, breaking time-lock smart contract guarantees? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Reward Calculation Manipulation] If validator reward calculations use duration_since_epoch() to measure uptime or performance windows, can time manipulation allow validators to claim unearned rewards or deny rewards to honest validators? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Stake Unlock Bypass] If stake unlock periods use duration_since_epoch() for time-based locks, can validators with fast-forwarded clocks unlock their stake prematurely, potentially enabling quick exits before slashing penalties apply? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Performance Tracking Manipulation] If validator performance metrics (proposal success rate, vote participation) are tracked over time windows using duration_since_epoch(), can time manipulation distort performance data and affect validator selection? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Epoch Reward Distribution] If epoch-based reward distribution depends on duration_since_epoch() for epoch duration calculations, can time desynchronization cause validators to calculate different reward amounts, leading to consensus failure on reward transactions? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Governance Proposal Timing] If governance proposal voting periods use duration_since_epoch(), can time manipulation extend or shorten voting windows, potentially passing malicious proposals before the community can react? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Upgrade Activation Exploit] If protocol upgrade activation depends on reaching a specific timestamp using duration_since_epoch(), can validators with manipulated clocks activate upgrades at inconsistent times, causing network splits between old and new protocol versions? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Feature Flag Time-Gating] If feature flags have time-based activation using duration_since_epoch(), can time manipulation cause validators to disagree on which features are active, leading to execution divergence? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Emergency Pause Bypass] If emergency pause mechanisms have time-based cooldowns using duration_since_epoch(), can attackers with fast-forwarded clocks bypass cooldowns and repeatedly trigger emergency stops? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [NTP Attack Vector] Since duration_since_epoch() relies on system time which may sync via NTP, can attackers performing NTP spoofing attacks on validator infrastructure manipulate consensus timing across multiple validators simultaneously? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Container Time Isolation] If validators run in containers/VMs with independent time sources, can container escape or VM time manipulation attacks alter duration_since_epoch() behavior without affecting the host system's clock? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Leap Second Handling] How does duration_since_epoch() handle leap seconds inserted by system time sources, and can leap second transitions cause temporary time inconsistencies across validators leading to consensus hiccups? (Low)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Timezone Confusion] Although Duration is timezone-agnostic, can incorrect timezone handling in code that uses duration_since_epoch() cause validators in different timezones to interpret absolute timestamps differently? (Low)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Hardware Clock Drift] For validators with hardware clock drift (seconds per day), can accumulated drift over weeks/months cause significant timing discrepancies that eventually break consensus timing assumptions? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Non-Monotonic Time] If system time moves backwards (NTP adjustment, manual clock change), can successive calls to duration_since_epoch() return decreasing values, breaking assumptions of monotonically increasing timestamps in consensus protocols? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Event Ordering Violation] If event ordering relies on timestamps from duration_since_epoch() and clocks move backwards, can events appear to happen in reverse chronological order, causing state machine errors? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch_at()] [Historical Timestamp Forgery] Can callers construct SystemTime values representing historical timestamps and pass them to duration_since_epoch_at() to create fake historical events or backdated transactions? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Timeout Expiry Inconsistency] If timeout expiry is checked by comparing duration_since_epoch() against a deadline, can backwards time movement cause timeouts to appear unexpired even after their actual expiry time has passed? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Mock Time Testing] Does the codebase provide mock implementations of duration_since_epoch() for deterministic testing, or do tests rely on actual system time, making consensus timing bugs hard to reproduce? (Low)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Cross-Validator Time Validation] Are there runtime checks that detect when validators have clock skew exceeding acceptable bounds, or can validators with severely wrong clocks remain active and disrupt consensus? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch_at()] [Input Sanitization] Does any caller of duration_since_epoch_at() validate that the system_time parameter is reasonable (not far past/future), or can arbitrary SystemTime values be passed without validation? (Low)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Consensus Module Dependency] How many critical consensus modules depend on duration_since_epoch(), and if this function behaves incorrectly, what is the blast radius across the codebase? (Analysis)"
]