[
  "[File: aptos-core/types/src/stake_pool.rs] [Struct: StakePool] [Cross-field validation] Can active stake be non-zero while locked_until_secs is in the far future, but operator_address is set to zero address, indicating a misconfigured stake pool that can neither operate nor withdraw? (High)",
  "[File: aptos-core/types/src/stake_pool.rs] [Struct: StakePool] [Cross-field validation] If all stake fields (active, inactive, pending_active, pending_inactive) are zero but event handles have non-zero counters, does this indicate past operations that should be impossible on an empty pool? (Low)",
  "[File: aptos-core/types/src/stake_pool.rs] [Struct: StakePool] [Cross-field validation] Can operator_address and delegated_voter both be zero addresses, creating a stake pool with no authorized operators or voters that has funds but cannot be managed? (Medium)",
  "[File: aptos-core/types/src/stake_pool.rs] [Function: get_governance_voting_power()] [Voting power inflation] By setting pending_inactive to a large value while maintaining high active stake, can an attacker temporarily inflate their voting power to pass malicious governance proposals before the stake actually unlocks? (Critical)",
  "[File: aptos-core/types/src/stake_pool.rs] [Function: get_governance_voting_power()] [Time-of-check-time-of-use] Can an attacker initiate a stake unlock to set pending_inactive high, vote on governance proposals with inflated power including pending_inactive, then cancel the unlock to keep their active stake, gaming the voting system? (High)",
  "[File: aptos-core/types/src/stake_pool.rs] [Function: get_governance_voting_power()] [Voting power exclusion] Does the formula correctly exclude inactive stake from voting power, or can recently unlocked funds in the inactive field still be counted towards voting if timing of state queries is manipulated? (Medium)",
  "[File: aptos-core/types/src/stake_pool.rs] [Function: get_governance_voting_power()] [Double-counting attack] During epoch transition when pending_active moves to active, can both fields be non-zero simultaneously in a way that causes get_governance_voting_power() to double-count the same stake? (Critical)",
  "[File: aptos-core/types/src/stake_pool.rs] [Struct: StakePool] [Field: active] When rewards are distributed and added to the active field, can overflow occur if active is already near u64::MAX, causing the reward addition to wrap and result in apparent stake loss? (Critical)",
  "[File: aptos-core/types/src/stake_pool.rs] [Struct: StakePool] [Reward calculation] Can an attacker manipulate the ratio of active to total stake by keeping large amounts in pending_inactive, causing them to receive disproportionate rewards relative to their actual active stake? (High)",
  "[File: aptos-core/types/src/stake_pool.rs] [Function: get_total_staked_amount()] [Reward distribution] If rewards are calculated based on total staked amount including inactive stake, but only distributed to active stake, can this create accounting discrepancies that enable reward theft? (High)",
  "[File: aptos-core/types/src/stake_pool.rs] [Struct: StakePool] [Field: locked_until_secs] Can locked_until_secs be decremented through repeated IncreaseLockupEvent emissions that actually decrease the lock time due to integer overflow in the Move module? (High)",
  "[File: aptos-core/types/src/stake_pool.rs] [Struct: StakePool] [Field: locked_until_secs] If the current blockchain timestamp overflows or wraps (e.g., year 2038 problem for u64 seconds), can all stake pools become permanently locked or immediately unlocked depending on comparison logic? (Critical)",
  "[File: aptos-core/types/src/stake_pool.rs] [Struct: StakePool] [Field: locked_until_secs] Can an attacker exploit time-based attacks by setting locked_until_secs to 1 (Unix epoch start) to immediately unlock stake that should be subject to lock periods? (High)",
  "[File: aptos-core/types/src/stake_pool.rs] [Struct: StakePool] [Concurrency] Can two transactions reading the same StakePool concurrently see different values for active, pending_active, etc., leading to inconsistent voting power or stake calculations across different parts of the system? (High)",
  "[File: aptos-core/types/src/stake_pool.rs] [Function: get_total_staked_amount()] [Race condition] Can get_total_staked_amount() be called while a reward distribution transaction is in progress, reading a partially updated state where some but not all stake fields have been modified? (Medium)",
  "[File: aptos-core/types/src/stake_pool.rs] [Function: get_governance_voting_power()] [Race condition] Can concurrent calls to get_governance_voting_power() during epoch transition return different values for the same pool, causing governance vote tallying to be inconsistent? (High)",
  "[File: aptos-core/types/src/stake_pool.rs] [Function: get_total_staked_amount()] [Zero-value edge case] If all stake fields are zero, does get_total_staked_amount() return 0 correctly, or can uninitialized memory or default values cause it to return non-zero for an empty pool? (Low)",
  "[File: aptos-core/types/src/stake_pool.rs] [Function: get_governance_voting_power()] [Zero-value edge case] If only inactive stake is non-zero (all other fields are 0), does get_governance_voting_power() correctly return 0, or can it incorrectly include inactive stake in the calculation? (Medium)",
  "[File: aptos-core/types/src/stake_pool.rs] [Struct: StakePool] [Zero-address edge case] Can operator_address or delegated_voter be set to AccountAddress::ZERO, and if so, does this cause undefined behavior in permission checks or consensus operations? (High)",
  "[File: aptos-core/types/src/stake_pool.rs] [Struct: StakePool] [Field: active] Can active be set to u64::MAX, and if so, does any attempt to add rewards or additional stake cause overflow that wraps the value, appearing as stake loss? (Critical)",
  "[File: aptos-core/types/src/stake_pool.rs] [Struct: StakePool] [Field: pending_inactive] Can pending_inactive be set to u64::MAX to grief the stake pool, making it impossible to unlock any additional stake without overflow in subsequent operations? (High)",
  "[File: aptos-core/types/src/stake_pool.rs] [Function: get_total_staked_amount()] [Maximum value attack] If three of four stake fields are set to u64::MAX/4 and the fourth to u64::MAX/4 + 1, will the sum overflow and wrap, returning an incorrect total that appears as if most stake has disappeared? (Critical)",
  "[File: aptos-core/types/src/stake_pool.rs] [Struct: StakePool] [Move integration] Can this Rust StakePool struct get out of sync with the Move struct definition in aptos-framework, causing deserialization failures or field mismatches when reading on-chain state? (High)",
  "[File: aptos-core/types/src/stake_pool.rs] [Struct: StakePool] [Type mismatch] If the Move version of StakePool adds new fields that aren't in this Rust struct, will deserialization fail gracefully or silently drop fields, potentially losing critical security state? (High)",
  "[File: aptos-core/types/src/stake_pool.rs] [Struct: StakePool] [Move resource safety] Does this struct properly represent a Move resource that cannot be copied or dropped, or can Rust code accidentally clone the struct in a way that violates Move's resource semantics? (Medium)"
]