[
  "[File: config/src/config/state_sync_config.rs] [Field: max_subscription_stream_lag_secs] [Lag Exploitation] Can an attacker maintain subscription lag at exactly 9 seconds (just under 10-second limit) to keep streams alive while preventing actual progress? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: progress_check_interval_ms (streaming)] [Progress Faking] Can the 50ms progress check interval be exploited to show fake progress through minimal state changes, hiding actual synchronization stalls? (Low)",
  "[File: config/src/config/state_sync_config.rs] [Field: enable_dynamic_prefetching] [Prefetch Thrashing] Can toggling dynamic prefetching on and off cause constant prefetch value recalculation, wasting CPU and network resources? (Low)",
  "[File: config/src/config/state_sync_config.rs] [Field: initial_prefetching_value] [Cold Start Attack] Can an attacker exploit the initial value of 3 prefetch requests during node startup to overwhelm cold nodes with data they cannot process? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_in_flight_subscription_requests] [Subscription Starvation] Can the limit of 9 in-flight subscription requests (designed for 3 blocks/sec * 3 seconds) be exploited during high block production rates to cause permanent lag? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_prefetching_value] [Prefetch Amplification] Can an attacker manipulate network conditions to drive prefetching value to maximum (30), then suddenly drop connections, wasting massive resources on useless prefetches? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: min_prefetching_value] [Prefetch Starvation] Can forcing prefetch value down to minimum (3) through repeated timeouts prevent nodes from ever catching up to chain head? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: prefetching_value_increase] [Slow Ramp Up] Can the conservative increase of 1 per success be exploited by intermittent attacks that prevent prefetch value from reaching optimal levels? (Low)",
  "[File: config/src/config/state_sync_config.rs] [Field: prefetching_value_decrease] [Aggressive Reduction] Can the decrease of 2 per timeout be exploited to rapidly collapse prefetching effectiveness with minimal timeout attacks? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: timeout_freeze_duration_secs] [Freeze Lock] Can the 30-second freeze duration be exploited to lock prefetching at suboptimal values for extended periods, degrading sync performance? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: additional_polls_per_peer_bucket] [Polling Amplification] Can the additional polls per bucket mechanism be exploited to exponentially increase polling load as peer count grows? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: min_polls_per_second] [Minimum Polling DoS] Can forcing minimum 5 polls per second even when unnecessary waste bandwidth and CPU on redundant summary requests? (Low)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_num_in_flight_priority_polls] [Priority Starvation] Can filling all 30 priority poll slots with slow responses starve time-critical priority data requests? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_num_in_flight_regular_polls] [Regular Poll Exhaustion] Can an attacker consume all 30 regular poll slots to prevent discovery of new data from honest peers? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_polls_per_second] [Rate Limit Bottleneck] Can the 20 polls/second limit be insufficient during high-throughput periods, causing nodes to miss critical state updates? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: peer_bucket_size] [Bucket Manipulation] Can an attacker game the 10-peer bucket size to ensure malicious peers are always polled while honest peers are neglected? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: poll_loop_interval_ms] [Loop Timing] Can the 100ms poll loop interval create timing windows where critical state changes are missed between poll executions? (Low)",
  "[File: config/src/config/state_sync_config.rs] [Field: enable_multi_fetch] [Multi-fetch Bypass] When multi-fetch is disabled, can attackers exploit the single-source fallback to provide malicious data without cross-validation? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: additional_requests_per_peer_bucket] [Request Multiplication] Can the additional requests per bucket cause request amplification that overwhelms both the requesting node and peer nodes? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: min_peers_for_multi_fetch] [Minimum Peer Bypass] Can an attacker manipulate perceived peer availability to drop below 2 peers, disabling multi-fetch validation entirely? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_peers_for_multi_fetch] [Sybil Defense] Is the limit of 3 peers for multi-fetch sufficient to prevent Sybil attacks where an attacker controls multiple responding peers? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: multi_fetch_peer_bucket_size] [Bucket Gaming] Can an attacker manipulate the 10-peer bucket size to ensure malicious peers dominate multi-fetch responses? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: latency_filtering_reduction_factor] [Best-Only Attack] Can the 50% reduction factor (factor of 2) be exploited by attackers running low-latency malicious nodes that always get selected? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: min_peer_ratio_for_latency_filtering] [Ratio Bypass] Can an attacker manipulate peer ratios to stay just below the 5:1 threshold, avoiding latency filtering? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: min_peers_for_latency_filtering] [Filtering Threshold] Can an attacker reduce perceived peer count below 10 to disable latency filtering, allowing slow/malicious peers to participate? (Medium)"
]