[
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/uri_parser.rs] [Function: parse()] [Metric Gaming] Can malicious NFT creators intentionally craft URIs that increment specific PARSE_URI_TYPE_COUNT metrics at lines 23, 67 to game monitoring dashboards or trigger false alerts? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/uri_parser.rs] [Function: parse()] [Gateway Selection Bias] Does hardcoding 'https://ipfs.com/ipfs/' at line 28 create a single point of failure, allowing attackers to DoS this specific gateway and prevent the crawler from accessing any NFT metadata? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/uri_parser.rs] [Function: parse()] [HTTP Client Mismatch] Can differences between how parse() constructs URIs and how the HTTP client interprets them lead to security vulnerabilities where validated URIs reach unintended endpoints? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/uri_parser.rs] [Function: format_capture()] [Database Injection] If the returned URI from lines 68-74 is used in SQL queries or database operations without sanitization, can attackers inject malicious SQL through crafted CIDs or paths? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/uri_parser.rs] [Function: parse()] [Cache Poisoning] Can attackers craft URIs that appear different to parse() but resolve to the same content, poisoning HTTP caches and causing the crawler to fetch stale or malicious metadata? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/uri_parser.rs] [Function: parse()] [Content Type Confusion] Does the returned URI indicate the expected content type (JSON, image), or can attackers return HTML/JavaScript that gets executed if the crawler doesn't validate content types? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/uri_parser.rs] [Function: parse()] [Missing TLD Validation] Does the redirect regex at line 43 validate top-level domains, or can attackers use invalid/malicious TLDs (*.ipfs.xxx) that still match the pattern? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/utils/uri_parser.rs] [Function: parse()] [Query Parameter Pollution] If the original URI at line 18 already contains query parameters, does the auth token at line 73 get appended correctly, or can existing params interfere with authentication? (Medium)"
]