[
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Conditional Compilation Bypass] The #[cfg(feature = 'failpoints')] directive controls compilation - can an attacker exploit binary patching, shared library injection, or memory modification to enable the failpoints code path even when compiled without the feature? (High)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Context Poisoning] Can an attacker corrupt the Arc<Context> by exploiting memory safety issues elsewhere, causing failpoints_enabled() to return true even on mainnet, then configure failpoints to halt consensus? (High)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Enum Confusion] If ApiConfig uses enums for boolean flags, can an attacker exploit unsafe transmute or memory corruption to set invalid enum discriminants that bypass the check? (Medium)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Default Value Attack] If failpoints_enabled defaults to true in some code path but the sanitizer expects false, can an attacker trigger the uninitialized default by exploiting config parsing errors? (Medium)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Consensus Halt] Can an attacker configure failpoints in consensus/round_manager.rs to force all validators to panic during vote processing, causing total loss of liveness and network halt requiring manual intervention? (Critical)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Double-Spending via Failpoints] Can an attacker selectively crash validators during block commit by triggering failpoints in execution layer, creating a fork where conflicting transactions are committed on different validator sets? (Critical)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Validator Slashing] Can an attacker configure failpoints to cause a validator to violate safety rules (double-sign, vote equivocation), triggering automatic slashing and theft of staked funds? (Critical)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Epoch Transition Attack] Can an attacker trigger failpoints during epoch transitions to corrupt validator set updates, causing the new epoch to start with wrong validators and enabling 51% attacks? (Critical)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Leader Election Manipulation] Can an attacker use failpoints to crash validators in a targeted sequence, manipulating leader election to ensure a compromised validator proposes blocks repeatedly? (Critical)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Quorum Certificate Forgery] Can an attacker trigger failpoints in signature verification code to bypass QC validation, allowing them to forge quorum certificates and commit invalid blocks? (Critical)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Network Partition] Can an attacker configure different failpoints on different validator subsets to create permanent network partitions where validators cannot reach consensus? (Critical)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Proposer Griefing] Can an attacker enable failpoints in proposal generation to cause honest validators to produce invalid proposals, wasting their turn and degrading network throughput? (High)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Vote Censorship] Can an attacker use failpoints to selectively drop votes from specific validators, preventing them from participating in consensus and reducing security margin? (High)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Timeout Manipulation] Can an attacker trigger failpoints in timeout certificate generation to force premature round changes, causing validators to skip valid proposals and degrade finality? (High)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Synchronization Attack] Can an attacker configure failpoints in state sync to prevent lagging validators from catching up, permanently reducing the validator set size below safety threshold? (High)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Randomness Bias] Can an attacker trigger failpoints in VRF generation to bias leader selection randomness, increasing probability of their controlled validators being chosen as leaders? (Medium)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [State Root Divergence] Can an attacker configure failpoints in AptosVM execution to cause validators to compute different state roots for the same transaction, creating permanent forks? (Critical)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Merkle Tree Corruption] Can an attacker trigger failpoints in Jellyfish Merkle tree operations to corrupt the state tree structure, making historical state unverifiable and breaking state proofs? (Critical)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Gas Metering Bypass] Can an attacker configure failpoints in gas calculation code to allow transactions to execute indefinitely without gas limits, causing DoS and enabling infinite loops? (Critical)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Write Set Corruption] Can an attacker trigger failpoints during write set application to cause partial state updates, violating atomicity and corrupting account balances? (Critical)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Resource Double-Spend] Can an attacker use failpoints in Move VM resource management to allow resources to be moved twice, breaking linear type guarantees and enabling APT token duplication? (Critical)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Storage Rollback] Can an attacker configure failpoints in AptosDB commit path to cause successful transactions to be rolled back silently, leading to fund loss for transaction senders? (Critical)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Pruning Disaster] Can an attacker trigger failpoints in ledger pruning to delete recent, unprunable transactions, causing irreversible data loss and inability to serve state proofs? (High)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Cache Poisoning] Can an attacker use failpoints to corrupt gas schedule cache, execution config cache, or state caches with invalid values that persist across requests? (High)",
  "[File: aptos-core/api/src/set_failpoints.rs] [Function: set_failpoint_poem()] [Transaction Ordering] Can an attacker configure failpoints in parallel execution (Block-STM) to violate transaction ordering invariants, causing reads to see future writes and breaking serializability? (High)"
]