[
  "[File: aptos-core/config/src/utils.rs] [Function: open_counter_file()] [Tmpfs Race] If /tmp is mounted as tmpfs and system reboots, do stale lock files from previous boot persist and cause validators to fail startup until manual intervention? (Medium)",
  "[File: aptos-core/config/src/utils.rs] [Function: bind_port_from_counter()] [Counter Increment] Does counter += 1 (line 177) properly handle the case where counter is u16::MAX, or can overflow cause counter to wrap to 0 unexpectedly? (Low)",
  "[File: aptos-core/config/src/utils.rs] [Function: bind_port_from_counter()] [Array Index] When indexing PORT_VECTOR[counter as usize] (line 176), is there guaranteed protection against counter > len() due to concurrent modifications or counter file corruption? (Medium)",
  "[File: aptos-core/config/src/utils.rs] [Constant: MAX_PORT_RETRIES] [Retry Limit] Is 1000 retries sufficient during port exhaustion scenarios with many validators restarting, or can legitimate validators panic due to insufficient retry attempts? (Low)",
  "[File: aptos-core/config/src/utils.rs] [Constant: UNIQUE_PORT_RANGE] [Port Range Exhaustion] With 20,000 ports and potentially hundreds of validator nodes, can port exhaustion occur during mass restart scenarios causing some validators to fail startup? (Medium)",
  "[File: aptos-core/config/src/utils.rs] [Function: get_available_port()] [Production vs Test Mode] If NEXTEST_RUN_ID is accidentally set in production environments, does switching from random to unique port allocation mode introduce file system attack surface that validators aren't designed to handle? (High)",
  "[File: aptos-core/config/src/utils.rs] [Function: get_genesis_txn()] [Null Genesis] If config.execution.genesis is None (line 222), does returning None cause validators to start without genesis transaction, potentially joining wrong network or creating fork? (Critical)",
  "[File: aptos-core/config/src/utils.rs] [Function: get_available_port()] [Port Reuse Semantics] Do callers of get_available_port() correctly use SO_REUSEADDR when binding to the returned port, or can TIME_WAIT state still cause binding failures in rapid restart scenarios? (Medium)",
  "[File: aptos-core/config/src/utils.rs] [Function: lock_path()] [Windows Path] On Windows systems, does /tmp/aptos-port-counter path work correctly, or can path format differences cause lock files to be created in current directory exposing sensitive data? (Medium)",
  "[File: aptos-core/config/src/utils.rs] [Function: try_bind()] [Platform TCP Behavior] Does the TIME_WAIT state behavior (comment lines 88-90) work identically on Linux, macOS, and Windows, or can platform differences cause ports to be reused too quickly? (Low)",
  "[File: aptos-core/config/src/utils.rs] [Function: try_bind()] [Localhost Resolution] Does binding to 'localhost' (line 85) consistently resolve to 127.0.0.1 on IPv4 and ::1 on IPv6, or can DNS/hosts file manipulation cause binding to external interfaces? (Medium)",
  "[File: aptos-core/config/src/utils.rs] [Function: Drop::drop()] [Lock File Stale] If validator crashes before Drop executes, how are stale lock files cleaned up, and can accumulated stale locks eventually prevent all validators from starting? (High)",
  "[File: aptos-core/config/src/utils.rs] [Function: Drop::drop()] [Signal Handling] Does SIGTERM/SIGINT signal handling ensure Drop::drop() is called, or can graceful shutdown bypasses leave lock files that permanently block subsequent starts? (Medium)",
  "[File: aptos-core/config/src/utils.rs] [Function: open_counter_file()] [Lock File Ownership] If validator process changes UID/GID after startup, can it still delete its own lock file in Drop::drop(), or will permission denied cause panic? (Low)",
  "[File: aptos-core/config/src/utils.rs] [Function: try_bind()] [Connection Timing] Between TcpListener::bind() (line 85) and TcpStream::connect() (line 91), can a local attacker rapidly scan and bind to the same port causing connection refused and forcing retry? (Low)",
  "[File: aptos-core/config/src/utils.rs] [Function: get_random_port()] [Retry Timing] Does the retry loop (lines 73-77) have backoff or delay between attempts, or can rapid retries amplify CPU load during port exhaustion scenarios? (Low)",
  "[File: aptos-core/config/src/utils.rs] [Function: bind_port_from_counter()] [Sequential Binding] Since counter increments sequentially, can an attacker observe first bound port and pre-bind to subsequent ports in sequence to maximize chance of causing conflicts? (Medium)",
  "[File: aptos-core/config/src/utils.rs] [Function: get_genesis_txn()] [Genesis Reference] Does returning a reference to Transaction from config (line 222) allow callers to modify genesis transaction, potentially causing validators to start with different genesis states? (Critical)",
  "[File: aptos-core/config/src/utils.rs] [Function: get_genesis_txn()] [Config Corruption] If NodeConfig is modified after genesis transaction is retrieved, can this cause validators to have inconsistent genesis state and fork the network? (High)",
  "[File: aptos-core/config/src/utils.rs] [Function: get_local_ip()] [Multiple IPs] If a validator host has multiple non-loopback IPs (e.g., public and private), does find() return a consistent choice, or can non-deterministic selection cause validators to advertise unreachable addresses? (Medium)",
  "[File: aptos-core/config/src/utils.rs] [Function: get_available_port_in_multiaddr()] [Protocol Ordering] Does the order of protocols in the vec![ip_proto, Protocol::Tcp(...)] matter for NetworkAddress parsing, and can incorrect ordering cause address validation failures? (Low)",
  "[File: aptos-core/config/src/utils.rs] [Function: get_unique_port()] [Counter File Truncation] If set_len(0) (line 135) succeeds but subsequent write_u16() writes incomplete data due to disk full, does next read interpret partial counter correctly or cause systematic errors? (Medium)",
  "[File: aptos-core/config/src/utils.rs] [Function: open_counter_file()] [Retry Sleep Accumulation] With 100 attempts and 100ms sleep, does the total 10-second wait during lock contention cause validator startup timeouts if orchestration systems expect faster initialization? (Low)",
  "[File: aptos-core/config/src/utils.rs] [Function: bind_port_from_counter()] [Log Information Leakage] Do the info!() logs on line 187-190 leak sensitive information about port allocation patterns that could help attackers predict validator network topology? (Low)",
  "[File: aptos-core/config/src/utils.rs] [Function: get_unique_port()] [Warn Log Action] When counter read fails and warn!() is issued (line 126-129), is there any alerting or monitoring that catches this condition before systematic port conflicts occur? (Low)"
]