[
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: decode_bcs()] [Hex Decoding] Can invalid hex characters at line 136 bypass hex::decode validation and cause buffer overflows or incorrect memory access? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: decode_key()] [Cryptographic Bypass] Can attackers provide invalid cryptographic material that passes ValidCryptoMaterial checks but fails signature verification, enabling unauthorized transactions? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: decode_key()] [Key Confusion] Does from_encoded_string properly validate key types, or can Ed25519 keys be decoded as Secp256k1 keys causing signature verification bypasses? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: decode_key()] [Error Masking] Does the generic error conversion hide specific validation failures that could help attackers understand which key formats are accepted? (Low)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: native_coin()] [Currency Confusion] Can the hardcoded APT symbol and decimals (lines 149-150) be exploited if a malicious contract creates a conflicting currency with the same metadata? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: native_coin_tag()] [Type Tag Manipulation] Can attackers craft malicious TypeTag::Struct variants that match the native coin tag but point to different module addresses? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: is_native_coin()] [Address Hardcoding] Does comparing against AccountAddress::TEN at line 178 properly handle all native coin representations, or can attackers use alternative representations to bypass checks? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: native_coin()] [Backward Compatibility] The comment at line 154 mentions skipping 0xA for backwards compatibility - can this inconsistency be exploited to confuse currency resolution? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: usdc_currency()] [Address Hardcoding] Can attackers exploit the hardcoded USDC address at line 183 to create phishing attacks or currency confusion if the actual USDC moves to a different address? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: usdc_testnet_currency()] [Network Confusion] Can transactions be crafted that confuse mainnet USDC with testnet USDC due to similar handling, enabling cross-network attacks? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: usdc_currency()] [Decimal Mismatch] Is the hardcoded 6 decimals at line 182 guaranteed to match the actual USDC implementation, or can decimal mismatches cause fund loss during conversions? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: find_coin_currency()] [Type Confusion] Can an attacker register a malicious currency with a move_type that collides with legitimate currencies, causing the wrong currency to be returned? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: find_coin_currency()] [String Comparison] Does comparing move_type strings at line 217 handle canonical vs non-canonical TypeTag representations correctly, or can formatting differences cause lookups to fail? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: find_fa_currency()] [Address Parsing] Can the unwrap_or(false) at line 242 hide AccountAddress parsing errors that should fail loudly, allowing invalid addresses to be treated as non-matches? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: find_fa_currency()] [Cache Bypass] The TODO comment at line 239 mentions caching - can the lack of caching enable performance degradation attacks through repeated expensive string-to-address conversions? (Low)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: find_fa_currency()] [Native Coin Priority] Does checking is_native_coin first at line 228 create a priority that could be exploited if an attacker registers a currency at AccountAddress::TEN? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: find_coin_currency()] [Iterator Safety] Can the .find().cloned() pattern at lines 209-222 be exploited with a malicious HashSet that returns different results on repeated iterations? (Low)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: get_block_index_from_request()] [Priority Confusion] When both index and hash are provided (lines 264-267), using index without validating hash consistency allows attackers to request mismatched block data? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: get_block_index_from_request()] [Hash Parsing] Can malformed block hashes at line 279 cause BlockHash::from_str to panic or return incorrect block heights? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: get_block_index_from_request()] [Latest Block Race] When fetching the latest block height (lines 283-290), can race conditions cause the returned block to be pruned before it's accessed? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: get_block_index_from_request()] [Network Call] Does the rest_client().get_ledger_information() call properly handle network failures, or can intermittent errors cause incorrect block resolution? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: get_block_index_from_request()] [State Consistency] Can the block_height from state at line 289 represent a pruned block, causing subsequent operations to fail? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Struct: BlockHash::new()] [Integer Validation] Does BlockHash::new accept invalid block heights like u64::MAX that could cause overflow in arithmetic operations downstream? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: BlockHash::block_height()] [Chain ID Validation] Can an attacker exploit the chain_id mismatch check at line 316 to cause denial of service by repeatedly sending requests with wrong chain IDs? (Low)",
  "[File: aptos-core/crates/aptos-rosetta/src/common.rs] [Function: BlockHash::from_str()] [Parsing Attack] Can specially crafted strings with multiple hyphens bypass the validation at line 365-370, allowing invalid BlockHash creation? (Medium)"
]