[
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: check_remaining_voting_power()] [Partial voting abuse] In partial governance voting scenarios, can repeated calls to this function with small specified_voting_power values allow voting power to be spread across multiple proposals simultaneously? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: check_remaining_voting_power()] [Dust attack] Can an attacker submit thousands of votes with specified_voting_power=Some(1) to fragment voting power into dust amounts, making vote tallying expensive and potentially causing consensus timeouts? (Medium)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: check_remaining_voting_power()] [Delegation pool bypass] For delegation pools, does this function properly track individual delegator voting power, or can pool operators exploit it to vote with more power than delegators authorized? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: check_remaining_voting_power()] [Type coercion] Can passing specified_voting_power with values that cause type coercion issues (e.g., very large numbers close to u64::MAX) lead to unexpected voting power assignments? (Medium)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: check_remaining_voting_power()] [Validator collusion] Can Byzantine validators collude to provide different remaining_voting_power values to different callers, causing vote count discrepancies that could halt governance or enable double-voting? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: check_remaining_voting_power()] [Memory exhaustion] Can attackers cause the println! at lines 22-24 to be invoked repeatedly in a tight loop, exhausting stdout buffers or log storage on validator nodes? (Low)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: check_remaining_voting_power()] [Atomic violation] Is the voting power check and return atomic with respect to the on-chain state update? Can non-atomic operations lead to voting power being spent twice in concurrent governance votes? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: check_remaining_voting_power()] [Flash loan attack] Can an attacker use flash loans or similar mechanisms to temporarily boost their stake, call this function to lock voting power, then repay the loan, allowing voting without sustained economic stake? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [Feature flag bypass] Can an attacker manipulate the Client object to return incorrect feature flag values, enabling or disabling partial governance voting contrary to on-chain consensus? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [Race condition] If this async function is called concurrently during a feature flag transition, can race conditions cause different validators to see different feature flag states, leading to consensus divergence on governance rules? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [TOCTOU vulnerability] Is there a time-of-check-time-of-use vulnerability where the feature flag state changes between checking at line 34 and actually processing a governance vote, allowing rules to be bypassed? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [State inconsistency] Can validators see different feature flag states due to network delays or state propagation issues, causing some to enforce partial voting rules while others don't, breaking consensus? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [Error handling bypass] If get_feature_flag() fails with an error, does the function default to enabled or disabled? Can attackers exploit error conditions to bypass governance restrictions? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [Network partition] During network partitions, can different sets of validators see different feature flag values, causing governance to split into multiple incompatible voting systems? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [Client manipulation] Can a malicious or compromised Client implementation return false feature flag values to specific validators, allowing targeted attacks on governance consensus? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [Cache poisoning] If feature flag results are cached, can attackers poison the cache to make validators enforce stale or incorrect governance rules? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [Async timing attack] Can the async nature of this function create timing windows where governance transactions are processed with inconsistent feature flag states, causing double-voting or vote invalidation? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [Denial of service] Can repeated calls to this async function cause resource exhaustion on the Client, leading to governance system unavailability during critical voting periods? (Medium)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [Feature flag rollback] If the feature flag is toggled off after votes are cast under partial governance rules, can this cause vote invalidation or allow double-voting when the flag is re-enabled? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [Authority bypass] Does this function verify that the Client has proper authority to query feature flags, or can any client forge feature flag responses to manipulate governance rules? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [State transition attack] During epoch changes or validator set updates, can inconsistent feature flag reads cause governance votes to be processed with mixed rules, invalidating vote counts? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [Await exploitation] Can attackers exploit the .await at line 34 by causing delays or timeouts that allow them to manipulate governance timing, such as extending voting periods or causing votes to be processed in wrong epochs? (Medium)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [Concurrent access] If multiple governance transactions call this function simultaneously, can concurrent access to the Client lead to incorrect or inconsistent feature flag reads? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [Fallback behavior] What is the secure default if the feature flag query fails? Can attackers trigger failures to force the system into an insecure fallback state? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_partial_governance_voting_enabled()] [Version skew] Can validators running different software versions interpret the PARTIAL_GOVERNANCE_VOTING feature flag differently, causing governance consensus failures? (High)"
]