[
  "[File: sdk/src/coin_client.rs] [Rust Safety] [Lifetime Bounds] Are all lifetime annotations ('a) correct and sufficient to prevent dangling references or use-after-free bugs? (High)",
  "[File: sdk/src/coin_client.rs] [Rust Safety] [Panic Safety] Do all .unwrap() calls have proper preconditions guaranteed, or could some panic in production causing denial of service? (Medium)",
  "[File: sdk/src/coin_client.rs] [Rust Safety] [Error Handling] Does Result<> error handling properly propagate all errors, or could some errors be silently dropped causing unexpected behavior? (Medium)",
  "[File: sdk/src/coin_client.rs] [Rust Safety] [Drop Safety] If CoinClient is dropped while transactions are pending, are cleanup operations properly handled or could this leak resources? (Low)",
  "[File: sdk/src/coin_client.rs] [Rust Safety] [Send/Sync Bounds] Is CoinClient properly Send + Sync for multi-threaded usage, or could concurrent access violate thread safety? (Medium)",
  "[File: sdk/src/coin_client.rs] [Edge Case] [Amount Zero] What happens if amount=0 is transferred - does it waste gas, fail validation, or execute successfully as a no-op? (Low)",
  "[File: sdk/src/coin_client.rs] [Edge Case] [Amount Maximum] Can transferring u64::MAX amount cause overflow in recipient balance, transaction fees calculation, or VM execution? (High)",
  "[File: sdk/src/coin_client.rs] [Edge Case] [Gas Maximum] What happens if max_gas_amount is set to u64::MAX - does it cause overflow in fee calculations or allow unlimited execution? (Medium)",
  "[File: sdk/src/coin_client.rs] [Edge Case] [Timeout Minimum] If timeout_secs=0, does the transaction expire immediately making it impossible to include on-chain? (Low)",
  "[File: sdk/src/coin_client.rs] [Edge Case] [Timeout Maximum] If timeout_secs=u64::MAX, could timestamp overflow create transactions that never expire or have invalid expiration timestamps? (Low)",
  "[File: sdk/src/coin_client.rs] [Edge Case] [Empty Coin Type] What happens if coin_type is an empty string '' - does TypeTag parsing fail gracefully or cause panic? (Medium)",
  "[File: sdk/src/coin_client.rs] [Edge Case] [System Address] Can funds be transferred to or from system addresses (0x0, 0x1) in ways that violate protocol invariants? (High)",
  "[File: sdk/src/coin_client.rs] [Edge Case] [Uninitialized Account] What happens if to_account doesn't exist on-chain - does transfer fail, auto-create account, or enter undefined state? (Medium)",
  "[File: sdk/src/coin_client.rs] [Edge Case] [Frozen Account] If to_account or from_account is frozen/blocked by governance, can the transfer still be signed and submitted wasting gas? (Low)",
  "[File: sdk/src/coin_client.rs] [DoS] [Sequence Number Exhaustion] Can an attacker rapidly call get_signed_transfer_txn() without submitting to exhaust sequence number space causing account lockout? (Medium)",
  "[File: sdk/src/coin_client.rs] [DoS] [API Rate Limiting] Could rapid transfer() calls overwhelm API client with requests causing rate limiting or service degradation? (Low)",
  "[File: sdk/src/coin_client.rs] [DoS] [Memory Exhaustion] Can creating many CoinClient instances or calling transfer() repeatedly cause memory exhaustion through leaked resources? (Low)",
  "[File: sdk/src/coin_client.rs] [DoS] [Transaction Spam] Could an attacker create many minimal-value transfers to spam the network and waste validator resources? (Low - out of scope)",
  "[File: sdk/src/coin_client.rs] [Concurrency] [Parallel Transfers] If multiple threads call transfer() with different from_accounts concurrently, can shared state in api_client cause race conditions? (Medium)",
  "[File: sdk/src/coin_client.rs] [Concurrency] [Async Interleaving] Can interleaved async operations cause transaction ordering issues where later transactions are submitted before earlier ones? (Medium)",
  "[File: sdk/src/coin_client.rs] [Concurrency] [Atomic Operations] Are sequence number increments in sign_with_transaction_builder() atomic across all code paths including error cases? (High)",
  "[File: sdk/src/coin_client.rs] [State Consistency] [Balance Queries] Can race conditions between get_account_balance() and transfer() lead to incorrect balance assumptions and logic errors? (Medium)",
  "[File: sdk/src/coin_client.rs] [State Consistency] [Transaction Status] Does transfer() returning PendingTransaction guarantee eventual consistency, or could transactions be lost/rejected without notification? (Medium)",
  "[File: sdk/src/coin_client.rs] [Attack] [Front-Running] Can observing pending transactions created by CoinClient allow attackers to front-run transfers by submitting transactions with higher gas prices? (Low - inherent to blockchain)",
  "[File: sdk/src/coin_client.rs] [Attack] [MEV Extraction] Could MEV bots exploit predictable transaction patterns from CoinClient to extract value through sandwich attacks? (Low - inherent to blockchain)"
]