[
  "[File: aptos-core/storage/aptosdb/src/pruner/state_merkle_pruner/state_merkle_metadata_pruner.rs] [Function: maybe_prune_single_version()] [Schema migration] If schema definitions change between software versions, can old pruner instances using old schema definitions corrupt databases expecting new schema format? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/pruner/state_merkle_pruner/state_merkle_metadata_pruner.rs] [Struct: StateMerkleMetadataPruner] [Multiple DB instances] If different StateMerkleMetadataPruner instances point to different Arc<DB> instances, can they diverge in pruning state causing network-wide state inconsistency? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/pruner/state_merkle_pruner/state_merkle_metadata_pruner.rs] [Function: maybe_prune_single_version()] [Byzantine pruning] Can a Byzantine validator deliberately prune nodes that should be retained by manipulating the target_version parameter, causing other validators to fail state verification? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/pruner/state_merkle_pruner/state_merkle_metadata_pruner.rs] [Function: maybe_prune_single_version()] [Selective pruning attack] Can a malicious validator selectively prune only specific branches of the Merkle tree by corrupting stale node indices, causing state divergence while maintaining valid root hash? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/pruner/state_merkle_pruner/state_merkle_metadata_pruner.rs] [Function: maybe_prune_single_version()] [Progress manipulation] If a Byzantine validator can manipulate the DbMetadataValue::Version at line 68 to store false progress, can they cause honest validators to skip pruning critical ranges? (High)",
  "[File: aptos-core/storage/aptosdb/src/pruner/state_merkle_pruner/state_merkle_metadata_pruner.rs] [Function: maybe_prune_single_version()] [Timing attack] Can Byzantine validators deliberately delay pruning operations to cause honest validators to accumulate excessive storage, creating resource exhaustion DoS? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/pruner/state_merkle_pruner/state_merkle_metadata_pruner.rs] [Function: progress()] [Progress information leak] Does exposing current pruning progress at line 81 allow attackers to infer validator state and timing information useful for coordinating attacks? (Low)"
]