[
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [SSRF Attack] Can an attacker provide a malicious URL pointing to internal network resources (e.g., 'http://169.254.169.254/latest/meta-data/', 'http://localhost:5432') to exploit Server-Side Request Forgery and access internal services or cloud metadata endpoints? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [URL Validation] Does the function validate the URL scheme before making requests, or can an attacker use file://, ftp://, or other protocols to access unauthorized resources beyond HTTP/HTTPS? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Timeout Bypass] The timeout is set to MAX_HEAD_REQUEST_RETRY_SECONDS (15 seconds), but can an attacker craft a slow-response server that keeps the connection alive just under the timeout threshold to exhaust connection pools and cause resource exhaustion? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Header Injection] Can an attacker craft URLs with embedded newlines or special characters that could inject additional HTTP headers through the url parameter passed to client.head(url.trim()), potentially bypassing security controls? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [MIME Type Spoofing] The function uses unwrap_or('text/plain') for invalid CONTENT_TYPE headers - can an attacker provide malformed headers to force incorrect MIME type detection and bypass downstream validation that relies on accurate MIME types? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Integer Overflow] The CONTENT_LENGTH header is parsed as u32 (line 34), but HTTP headers can contain arbitrary strings - can an attacker provide extremely large numbers (>u32::MAX) causing parse failure and defaulting to size=0, bypassing size-based validation checks? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Error Handling] When value.to_str() fails on line 28, the function silently defaults to 'text/plain' - can this mask malicious or malformed CONTENT_TYPE headers that should be rejected, allowing dangerous content to pass through? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Redirect Following] The reqwest client is built without explicit redirect policy configuration - does it follow redirects by default, and can an attacker chain redirects to bypass URL allowlists or perform time-of-check-time-of-use attacks? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [DNS Rebinding] Can an attacker exploit DNS rebinding attacks where a domain initially resolves to a safe IP but later resolves to an internal IP (e.g., 127.0.0.1) after initial validation passes? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Unicode Bypass] The function calls url.trim() but doesn't normalize Unicode characters - can an attacker use Unicode homoglyphs, zero-width characters, or RTL overrides in URLs to bypass blocklists or filters? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Size Validation] The function returns size as u32, defaulting to 0 when parsing fails - can callers distinguish between a legitimate 0-byte file and a parsing error, potentially treating malicious content incorrectly? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Client Reuse] A new Client is built for each request (line 18-21) - does this prevent connection pooling and make the service vulnerable to resource exhaustion through rapid repeated calls? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [TLS Validation] The Client::builder() doesn't explicitly configure TLS certificate validation - can an attacker perform MITM attacks using self-signed or invalid certificates if the default configuration is permissive? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [IPv6 Bypass] If URL validation exists elsewhere, can an attacker use IPv6 notation (e.g., http://[::ffff:127.0.0.1]) to bypass IPv4-based blocklists and access internal services? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [URL Encoding] Can an attacker use double-encoding, percent-encoding, or other URL obfuscation techniques to bypass URL validation while still reaching malicious endpoints? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [HTTP Method Confusion] The function uses HEAD requests, but can an attacker exploit servers that return different headers for HEAD vs GET requests, causing metadata validation to pass but actual content download to fail or be malicious? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Content-Type Parsing] The CONTENT_TYPE header extraction doesn't validate the format (should be 'type/subtype') - can malformed MIME types like 'malicious;;;type' or empty strings bypass downstream validation? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Charset Exploitation] Content-Type headers can include charset parameters (e.g., 'text/html; charset=utf-8') - does the function properly handle or strip these, or can attackers inject charset parameters to manipulate parsing? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [HTTP Response Splitting] Can newlines or carriage returns in server response headers cause HTTP response splitting attacks when metadata is subsequently used in HTTP contexts? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Port Bypass] Can an attacker specify non-standard ports (e.g., http://internal-service:6379 for Redis) to access internal services that aren't protected by port-based filtering? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Credentials Leak] Can an attacker provide URLs with embedded credentials (e.g., http://user:pass@example.com) that might be logged or leaked in error messages? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Case Sensitivity] URL schemes and headers are case-insensitive in HTTP - can an attacker use mixed case (e.g., 'HtTp://') to bypass case-sensitive validation? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Negative Content-Length] Can an attacker provide negative numbers in CONTENT_LENGTH header that, after parsing failure, default to 0 and bypass size checks meant to prevent large downloads? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Multiple Headers] HTTP allows multiple headers with the same name - does headers.get() return the first or last value, and can an attacker exploit this with duplicate CONTENT_LENGTH headers (e.g., '1000' followed by '999999999')? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/lib.rs] [Function: get_uri_metadata()] [Timeout Race Condition] Can an attacker exploit timing between when the timeout starts and when the request is actually sent to cause requests to hang longer than MAX_HEAD_REQUEST_RETRY_SECONDS? (Low)"
]