[
  "[File: aptos-core/crates/aptos-batch-encryption/src/schemes/mod.rs] [Module: fptx] [API Confusion] Does the public exposure of three similar encryption schemes (fptx, fptx_succinct, fptx_weighted) create risk of developers accidentally using the wrong scheme for their security requirements, potentially leading to weaker encryption than intended? (Medium)",
  "[File: aptos-core/crates/aptos-batch-encryption/src/schemes/mod.rs] [Module: fptx] [Unimplemented Functions] Given that the FPTX::setup() function is marked as unimplemented, is there a risk that production code could accidentally call this unimplemented function, causing a panic and potential validator crash or consensus failure? (High)",
  "[File: aptos-core/crates/aptos-batch-encryption/src/schemes/mod.rs] [Module: fptx_succinct] [Unimplemented Functions] Similarly, FPTXSuccinct::setup() is unimplemented - does the module declaration provide sufficient warnings or documentation to prevent accidental usage in production consensus code? (High)",
  "[File: aptos-core/crates/aptos-batch-encryption/src/schemes/mod.rs] [Module: all schemes] [API Versioning] Are there any versioning or deprecation mechanisms in place at the module level to prevent breaking changes when upgrading between scheme implementations (fptx vs fptx_weighted)? (Medium)",
  "[File: aptos-core/crates/aptos-batch-encryption/src/schemes/mod.rs] [Module: all schemes] [Type Safety Boundaries] Does the module structure ensure that ciphertexts encrypted with one scheme (e.g., fptx) cannot be accidentally decrypted with a different scheme (e.g., fptx_weighted), which could lead to decryption failures or incorrect plaintext recovery? (High)",
  "[File: aptos-core/crates/aptos-batch-encryption/src/schemes/mod.rs] [Module: fptx vs fptx_weighted] [Threshold Configuration Mismatch] Since FPTX uses ShamirThresholdConfig while FPTXWeighted uses WeightedConfigArkworks, is there proper validation at the API boundary to prevent mixing incompatible threshold configurations that could break threshold decryption? (Critical)",
  "[File: aptos-core/crates/aptos-batch-encryption/src/schemes/mod.rs] [Module: all schemes] [Key Material Leakage] Does the public module interface ensure that sensitive key material (master secret key shares, decryption keys) cannot be accidentally exported or logged through generic trait implementations? (Critical)",
  "[File: aptos-core/crates/aptos-batch-encryption/src/schemes/mod.rs] [Module: fptx_succinct] [Augmented Key Security] The succinct variant uses AugmentedEncryptionKey instead of EncryptionKey - is there documentation or type-level enforcement preventing substitution attacks where a standard key is used where an augmented key is required? (High)",
  "[File: aptos-core/crates/aptos-batch-encryption/src/schemes/mod.rs] [Module: all schemes] [Panic Safety] Given that setup functions are marked unimplemented for FPTX and FPTXSuccinct, does the module design allow these panics to propagate to consensus-critical code paths, potentially causing validator crashes? (Critical)",
  "[File: aptos-core/crates/aptos-batch-encryption/src/schemes/mod.rs] [Module: all schemes] [Documentation] Is there clear documentation at the module level explaining which scheme (fptx/fptx_succinct/fptx_weighted) should be used for validator consensus vs which are purely for testing, to prevent production misuse? (Medium)",
  "[File: aptos-core/crates/aptos-batch-encryption/src/schemes/mod.rs] [Module: all schemes] [Trait Boundary Safety] Since all schemes implement BatchThresholdEncryption trait, could an attacker exploit polymorphism to substitute a weaker scheme at runtime through dynamic dispatch or type erasure? (High)",
  "[File: aptos-core/crates/aptos-batch-encryption/src/schemes/mod.rs] [Module: fptx_weighted] [Virtual Player Mapping] The weighted scheme uses virtual player abstraction - does the module boundary ensure that virtual-to-real player mappings cannot be manipulated to bypass threshold requirements? (Critical)"
]