[
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: convert_move_struct_tag()] [Name Field Overflow] At line 83, struct_tag.name is converted to String - can extremely long resource names (millions of characters) cause memory exhaustion or database column overflow? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_delete_resource()] [Type Mismatch Attack] At line 69, can an attacker delete a resource using a different type string than was used to create it, causing the indexer to store incorrect type information for deleted resources? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Type String Length] Are there any length restrictions on the type_ field, and can unbounded Move type signatures with hundreds of nested generic parameters cause database performance degradation? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: convert_move_struct_tag()] [Generic Type Bomb] At lines 84-93, generic_type_params are recursively serialized - can an attacker create circularly referenced or infinitely recursive generic types causing the indexer to hang or crash? (Critical)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: convert_move_struct_tag()] [Type Parameter Overflow] When iterating over generic_type_params, is there a limit on the number of parameters, or can an attacker provide thousands of generic parameters causing excessive memory allocation? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: convert_move_struct_tag()] [Error Propagation] At line 92, when conversion to JSON Value fails for any generic parameter, unwrap_or(None) returns None for the entire generic_type_params - does this lose all type information instead of just the failing parameter? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Generic Inconsistency] If generic_type_params conversion fails and returns None at line 51, but the type_ string at line 47 includes generic parameters, does this create inconsistent indexer state? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: convert_move_struct_tag()] [Type Deserialization] When generic_type_params is stored as JSON and later retrieved, can malformed JSON cause deserialization errors in applications querying the indexer database? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_delete_resource()] [Deletion Without Write] Can an attacker trigger from_delete_resource() for a resource that was never written, creating a database entry with is_deleted=true but no prior write entry, breaking indexer invariants? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Double Write Attack] If the same resource is written twice in one transaction with different write_set_change_index values, does the indexer correctly store both entries or does one overwrite the other? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Struct: MoveResource] [Transaction Block Height Mismatch] Can transaction_block_height be inconsistent with the actual block height of the transaction, and does the indexer validate this relationship? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Data Null Inconsistency] If is_deleted is false at line 53, data must be Some(value) - but is this invariant enforced, or can bugs cause is_deleted=false with data=None creating invalid state? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_delete_resource()] [Deleted Resource Query] When is_deleted=true, applications querying for active resources must filter this out - but is this filtering documented and enforced, or can apps incorrectly treat deleted resources as active? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: convert_move_struct_tag()] [Module Extraction] At line 82, does struct_tag.module properly handle Move addresses with special characters or escape sequences that could break module name extraction? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: convert_move_struct_tag()] [Name Parsing] Can struct_tag.name contain characters that are invalid in Move identifiers, and does the conversion validate this or allow malformed names into the database? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Parsed Data Reuse] At lines 42-51, parsed_data is cloned multiple times - is this efficient for large struct tags, and could deeply nested types cause excessive memory allocation during cloning? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Struct: MoveResource] [SQL Injection] The Diesel Insertable trait - when string fields (name, type_, address, module) are inserted, does Diesel properly parameterize queries or could malicious Move resource names inject SQL? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Struct: MoveResource] [Database Transaction Safety] Are MoveResource insertions part of a database transaction, and if a batch insertion fails midway, does the indexer roll back partial changes to maintain consistency? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Struct: MoveResource] [Concurrent Write Conflict] If two indexer instances write the same MoveResource simultaneously, does the database use appropriate locking to prevent lost updates or corruption? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Struct: MoveResource] [Column Size Limits] Are there database column size limits for String and JSON fields, and if exceeded, does insertion fail gracefully or cause data truncation and corruption? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Struct: MoveResource] [Index Performance] With high write throughput, can the composite primary key index become a bottleneck, and are there missing indexes on commonly queried fields like address or type_ causing performance degradation? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Clone Performance] At line 48, parsed_data.name.clone() and similar clones - for extremely large module/name strings, does excessive cloning cause memory pressure and slow indexing? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [String Allocation] Multiple String conversions (lines 47, 48, 49, 50) - can an attacker cause excessive memory allocation by submitting transactions with many large Move resources in a single block? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Struct: MoveResource] [Memory Leak] Are MoveResource instances properly dropped after database insertion, or can memory leaks accumulate over millions of indexed resources causing indexer OOM crashes? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: convert_move_struct_tag()] [Iterator Allocation] At lines 84-93, the iterator over generic_type_params - for Move types with hundreds of generic parameters, does the collect() operation cause excessive temporary allocations? (Low)"
]