[
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: MAX_FUNCTION/STRUCT_DEFINITIONS_REACHED] [Definition limits] Codes 1119-1120 limit definitions - can these limits be bypassed through dynamic code generation or linking? (Low)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: UNSTABLE_BYTECODE_REJECTED] [Bytecode stability] Code 1125 rejects unstable bytecode - can testnet bytecode be replayed on mainnet before this check is enabled, or can bytecode version confusion occur? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: USER_DEFINED_NATIVE_NOT_ALLOWED] [Native function injection] Code 1127 prevents user-defined natives - can attackers use FFI, dynamic linking, or other mechanisms to inject native code that bypasses this check? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: FEATURE_NOT_ENABLED] [Feature flag race] Code 1131 aborts when features aren't enabled - can timing races in feature activation cause some validators to accept transactions that others reject? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: INVALID_INIT_MODULE] [Init function bypass] Code 1134 validates init_module function - can attackers craft init functions that appear valid but perform malicious initialization? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: FRIEND_NOT_FOUND_IN_MODULE_BUNDLE] [Bundle validation] Code 1135 checks friend modules in bundles - can attackers split module bundles across transactions to bypass friend resolution checks? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: EMPTY_VALUE_STACK] [Stack invariant] Code 2003 detects empty stack - if this invariant is violated, does it indicate a verifier bug that could be exploited to corrupt VM state? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: PC_OVERFLOW] [Program counter overflow] Code 2005 catches PC overflow - can attackers cause PC overflow through jump table manipulation or computed gotos? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: VERIFICATION_ERROR] [Post-verification failure] Code 2006 indicates verification failed after passing initial checks - what causes this, and can it be triggered deliberately to test for verifier bugs? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: STORAGE_ERROR] [Storage invariant violation] Code 2008 indicates storage errors - can attackers corrupt storage to trigger this consistently, effectively freezing affected accounts? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: INTERNAL_TYPE_ERROR] [Type system invariant] Code 2009 detects internal type errors - if type system invariants are violated, can this lead to type confusion attacks or memory safety violations? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: EVENT_KEY_MISMATCH] [Event integrity] Code 2010 detects event key mismatches - can attackers forge events by manipulating event keys to make events appear from different sources? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: UNREACHABLE] [Code path invariant] Code 2011 marks supposedly unreachable code - if this code is reached, does it indicate exploitable verifier bugs or incorrect assumptions about code paths? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: VM_STARTUP_FAILURE] [Initialization vulnerability] Code 2012 indicates VM startup failure - can attackers corrupt VM initialization state to cause persistent failures or state inconsistency? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: UNEXPECTED_ERROR_FROM_KNOWN_MOVE_FUNCTION] [Trusted function failure] Code 2015 detects errors from supposedly safe functions - can system module functions be exploited to return unexpected errors that bypass security checks? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: VERIFIER_INVARIANT_VIOLATION] [Verifier bug indication] Code 2016 indicates verifier invariant violation - if triggered in production, does this expose exploitable verifier bugs that could compromise consensus? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: UNEXPECTED_DESERIALIZATION_ERROR] [Deserialization invariant] Code 2018 detects unexpected deserialization errors - can attackers craft data that deserializes differently across validators? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: FAILED_TO_SERIALIZE_WRITE_SET_CHANGES] [Write set serialization] Code 2019 handles serialization failures - can write sets become corrupted such that they can't be serialized, causing transaction processing to hang? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: TYPE_RESOLUTION_FAILURE] [Linking failure post-verification] Code 2021 indicates type resolution failed after verification - can attackers exploit timing windows where modules are verified but dependencies change before execution? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: DUPLICATE_NATIVE_FUNCTION] [Native function collision] Code 2022 detects duplicate native functions - can attackers register native functions with the same name to shadow system natives? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: DELAYED_FIELD_OR_BLOCKSTM_CODE_INVARIANT_ERROR] [Parallel execution invariant] Code 2023 handles delayed field and BlockSTM invariant violations - can this be triggered deliberately to force sequential execution fallback as a DoS attack? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: SPECULATIVE_EXECUTION_ABORT_ERROR] [Speculation attack] Code 2024 indicates speculative execution needs retry - can attackers craft transactions that always cause speculation failures, forcing expensive re-execution? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: ACCESS_CONTROL_INVARIANT_VIOLATION] [Access control bypass] Code 2025 detects access control invariant violations - if access control can be violated, can attackers access resources they shouldn't have permission for? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: MALFORMED] [Bytecode malformation] Code 3001 catches malformed bytecode - is this check comprehensive enough to prevent all malformed bytecode attacks, or can some forms slip through? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: BAD_MAGIC] [Magic number bypass] Code 3002 validates magic numbers - can attackers use corrupted magic numbers that still parse as valid to cause confusion in multi-version scenarios? (Medium)"
]