[
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: KEYWORDS] [Use import abuse] The 'use' keyword at line 31 imports modules - can attackers exploit use statement ordering or shadowing to import malicious modules that override legitimate ones, particularly system modules like aptos_framework? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [Include directive injection] The 'include' keyword at line 49 includes specifications - can attackers exploit path traversal or injection in include directives to incorporate malicious specifications from unexpected locations, bypassing security reviews? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [Update operator timing] The 'update' keyword at line 64 modifies state in specs - if spec execution is not properly isolated from runtime, can attackers use update in specifications to actually modify state during verification, bypassing normal transaction processing? (Critical)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [Apply function abuse] The 'apply' keyword at line 39 applies schemas - can attackers craft recursive apply chains that cause infinite expansion during verification, DoSing the formal verification tool and preventing security analysis? (Low)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [Decreases termination bypass] The 'decreases' keyword at line 43 proves loop termination - can attackers provide false decreases clauses that pass verification but allow infinite loops, causing validators to hang during transaction execution? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [Emits event verification] The 'emits' keyword at line 44 specifies event emissions - if not properly enforced, can attackers bypass event emission requirements to hide malicious transactions from event indexers and monitoring systems? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [Except error handling] The 'except' keyword at line 46 handles exceptions in specs - can attackers use overly broad except clauses to mask specification violations that would otherwise be caught by formal verification? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [Internal visibility bypass] The 'internal' keyword at line 50 may control internal visibility - if not consistently enforced across all compiler passes, can attackers access internal functions that should be hidden, bypassing encapsulation? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [Local vs global scope] The 'local' keyword at line 51 may specify local scope - can scope confusion between 'local' and 'global' keywords allow attackers to access variables from wrong scopes, leaking sensitive data or corrupting state? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [Min value constraints] The 'min' keyword at line 52 may specify minimum values - if constraint validation is incomplete, can attackers bypass min constraints to supply negative or zero values where positive values are required, causing divide-by-zero or underflow? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [Modifies state tracking] The 'modifies' keyword at line 53 declares which state a function modifies - can attackers omit modified state from modifies clauses to bypass verification checks that ensure state modifications are authorized? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [Post-condition bypass] The 'post' keyword at line 57 defines postconditions - can attackers craft tautological postconditions that always pass but don't actually enforce security properties, allowing violations to go undetected? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [Package namespace conflicts] The 'package' keyword at line 55 may define package boundaries - can attackers create malicious packages with names that collide with system packages to intercept calls intended for legitimate packages? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [Requires precondition weakness] The 'requires' keyword at line 59 defines preconditions - can attackers provide weak requires clauses that don't fully specify required conditions, allowing invalid inputs that cause unexpected behavior or state corruption? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [To type conversion] The 'to' keyword at line 63 may perform type conversions - if type conversion validation is weak, can attackers exploit 'to' conversions to bypass type safety and convert between incompatible types, causing memory safety violations? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [Where clause injection] The 'where' keyword at line 65 adds constraints - can attackers inject malicious where clauses that weaken generic type constraints, allowing instantiation of generics with types that violate safety properties? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: CONTEXTUAL_KEYWORDS] [With context abuse] The 'with' keyword at line 66 may provide additional context - can attackers supply malicious context through 'with' clauses to change execution behavior or bypass security checks that rely on context validation? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: KEYWORDS] [If-else branch prediction] The 'if' and 'else' keywords (lines 18, 13) control branching - can attackers exploit branch prediction or speculative execution by crafting deeply nested if-else chains that leak secret data through timing side channels? (Low)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: KEYWORDS] [While loop gas metering] The 'while' keyword at line 32 creates loops - if gas metering is applied per-iteration rather than per-bytecode, can attackers craft while loops with expensive per-iteration costs that appear cheap, exhausting validator resources? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: KEYWORDS] [Break/continue control flow] The 'break' and 'continue' keywords (lines 9, 11) control loop flow - can attackers exploit these to create complex control flow that confuses formal verification or static analysis tools, hiding malicious behavior? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: KEYWORDS] [Let binding scope] The 'let' keyword at line 20 creates bindings - can attackers exploit shadowing through nested let bindings to hide which variable is actually being used, causing confusion in security audits? (Low)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: KEYWORDS] [As cast safety] The 'as' keyword at line 8 performs type casts - if cast validation is incomplete, can attackers use 'as' to perform unsafe casts that bypass type checking, potentially causing memory corruption or type confusion? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: KEYWORDS] [Invariant location] The 'invariant' keyword at line 19 declares invariants - if invariants can be placed in unexpected locations, can attackers define invariants that are never actually checked, providing false security guarantees? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: KEYWORDS] [Module isolation] The 'module' keyword at line 22 defines modules - can attackers exploit module boundary violations to access private state across modules, breaking encapsulation and accessing unauthorized resources? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/keywords.rs] [Array: BUILTINS] [Assert gas cost] The 'assert' builtin at line 72 has an implicit gas cost - can attackers place asserts in gas-expensive contexts to cause unexpected gas exhaustion, DoSing contract functionality or causing failed transactions? (Medium)"
]