[
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Function: StakingContract.get_balance()] [Null distribution_pool] Can distribution_pool in StakingContract be in an uninitialized state with all fields at 0, causing get_balance() to always return None even when the staking contract has principal? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: StakingContract] [Pool_address validation] Is pool_address in StakingContract validated to be a valid stake pool on-chain, or can it point to arbitrary addresses, causing Rosetta to query non-staking resources as stake pools? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: RESET_LOCKUP_FUNCTION] [Lockup bypass] Can repeated calls to RESET_LOCKUP_FUNCTION be used to bypass lockup periods by resetting the timer, and does Rosetta properly track these resets in its event processing? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: DISTRIBUTE_STAKING_REWARDS_FUNCTION] [Distribution without rewards] Can DISTRIBUTE_STAKING_REWARDS_FUNCTION be called when no rewards have accrued, causing 0-value DistributeEvent emissions that spam event logs and obscure real distributions? (Low)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: DELEGATION_POOL_ADD_STAKE_FUNCTION] [Minimum stake bypass] Does Rosetta enforce minimum delegation amounts when parsing DELEGATION_POOL_ADD_STAKE_FUNCTION calls, or can dust delegations be used to fill up the shareholders list and DoS the delegation pool? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: DELEGATION_POOL_UNLOCK_FUNCTION] [Unlock more than staked] Can DELEGATION_POOL_UNLOCK_FUNCTION be called with amounts exceeding the delegator's active stake, and does Rosetta detect this as an invalid operation or misreport the pending withdrawal amount? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: DELEGATION_POOL_WITHDRAW_FUNCTION] [Withdrawal before unlock] Does Rosetta track the lockup cycle requirement between DELEGATION_POOL_UNLOCK_FUNCTION and DELEGATION_POOL_WITHDRAW_FUNCTION, or can it misreport withdrawals as successful before the unlock period completes? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: AddDelegationEvent] [Delegator_address spoofing] Can AddDelegationEvent claim delegation from an address that didn't sign the transaction, causing Rosetta to attribute staking activity to the wrong account and confuse delegation tracking? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: UndelegationEvent] [Amount_unlocked validation] If amount_unlocked in UndelegationEvent exceeds the delegator's total active shares, does this indicate a state inconsistency that Rosetta should flag, or would it silently report impossible undelegation amounts? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [All structs] [Derive Deserialize] All structs use serde Deserialize - can specially crafted Move bytecode create resources with recursive struct references causing infinite deserialization loops and Rosetta API hangs? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [All structs] [Missing validation] Does serde deserialization enforce any business logic constraints (e.g., commission_percentage ≤ 100), or can on-chain state violate invariants that Rust structs don't validate post-deserialization? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: Pool] [Large vector allocation] Can a malicious Pool resource have shares vector with length = u64::MAX - 1, causing Rosetta to attempt massive memory allocation during deserialization and crash with OOM? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: Store] [Event handle limits] Do EventHandle fields in Store have bounded counters, or can their internal sequence numbers overflow after 2^64 events, causing event enumeration to restart from 0 and duplicate event queries? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: StakingContract] [Clone safety] StakingContract derives Clone - if multiple clones of owner_cap exist in memory, can this lead to capability duplication attacks where the same capability is used to authorize conflicting operations? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: Pool] [Clone cost] Pool derives Clone and contains Vec fields - can cloning large Pool structs with millions of shareholders cause memory exhaustion in Rosetta's request handling, enabling DoS via complex balance queries? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: Capability] [Copy semantics] Capability derives Copy - is it safe to bitwise copy pool_address, or should Capability be non-copyable to prevent accidental capability duplication in Rosetta's codebase? (Low)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: TRANSFER_FUNCTION] [Generic transfer confusion] Since multiple modules define 'transfer' functions, does Rosetta properly namespace checks to prevent parsing aptos_account::transfer as coin::transfer, misclassifying account creation as coin transfer? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: TRANSFER_COINS_FUNCTION] [Amount parameter] Does Rosetta validate that TRANSFER_COINS_FUNCTION amount parameter is positive and non-zero, or can 0-amount transfers be used to spam transaction history without actual value movement? (Low)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: CREATE_ACCOUNT_FUNCTION] [Account creation cost] Does Rosetta track the APT cost of CREATE_ACCOUNT_FUNCTION calls, or can the account creation fee be hidden from balance change calculations, causing deposit amounts to appear higher than actual? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: BALANCE_FUNCTION] [View function assumptions] Does BALANCE_FUNCTION constant represent a view function that Rosetta calls, and can view functions have side effects or stale data that causes reported balances to differ from actual on-chain state? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: SWITCH_OPERATOR_WITH_SAME_COMMISSION_FUNCTION] [Commission persistence] Does SWITCH_OPERATOR_WITH_SAME_COMMISSION_FUNCTION guarantee commission_percentage is unchanged, or can there be a race condition where commission updates slip in during operator switch, bypassing commission lock periods? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: UPDATE_VOTER_FUNCTION] [Voter authority] Can UPDATE_VOTER_FUNCTION be called by the operator to change voter without owner consent, and does Rosetta's event parsing correctly attribute voter changes to the calling party for accountability? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: ResetLockupEvent] [Lockup reset abuse] Can repeated ResetLockupEvent emissions indicate lockup period manipulation, and does Rosetta flag suspicious patterns of lockup resets that might indicate attempt to keep funds perpetually locked? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: SwitchOperatorEvent] [Operator rotation tracking] If SwitchOperatorEvent shows rapid operator rotation (10+ switches per epoch), does Rosetta surface this as suspicious activity that might indicate compromised stake pool management? (Low)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: OBJECT_MODULE] [Object ownership] Does OBJECT_MODULE constant usage properly handle object ownership transfers, or can objects be transferred without corresponding ownership change events being parsed by Rosetta? (High)"
]