[
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: expand()] [Vector allocation overflow] Does vec![0u8; length] properly check for allocation overflow when length approaches usize::MAX, or can it wrap around creating a small vector that gets filled with truncated key material? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Constant: MINIMUM_SEED_LENGTH] [Constant modification] Can malicious code at compile-time modify the MINIMUM_SEED_LENGTH constant through unsafe code or macro manipulation, reducing the minimum from 16 bytes to enable weak seed acceptance? (Medium)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: expand()] [Length truncation] On 32-bit platforms, can length parameter truncation when converting from usize to smaller integer types in the underlying hkdf crate cause derived keys to be shorter than expected? (Low)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Type: DMinimumSize] [Hash output constraint] Can the IsGreaterOrEqual<DMinimumSize, Output = True> constraint be bypassed at compile-time by instantiating Hkdf with a custom hash function that claims to output ≥32 bytes but actually outputs less? (Critical)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Struct: Hkdf<D>] [Trait bound bypass] Can the D: Update + BlockInput + FixedOutput + Reset + Default + Clone trait bounds be satisfied by a malicious hash function implementation that has cryptographic weaknesses (e.g., length extension, collision attacks)? (Critical)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Type: D::OutputSize] [Output size manipulation] Can a malicious implementation of D::OutputSize::ArrayLength<u8> lie about the actual output size, causing buffer overflows or underflows when copying hash outputs? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Type: D::BlockSize] [Block size attack] Can instantiating Hkdf with a hash function having unusual block size (e.g., 1 byte or extremely large) cause performance issues or cryptographic weaknesses in the HMAC operations? (Medium)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Trait: FixedOutput] [Non-fixed output] Can a hash function that implements FixedOutput but actually produces variable-length outputs based on input cause inconsistent key lengths across different derivation operations? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: extract_then_expand_no_ikm()] [RFC 5869 violation] Does extract_then_expand_no_ikm() violate RFC 5869 requirements by accepting empty ikm, potentially breaking security proofs that assume non-empty initial key material? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: extract()] [Extract phase weakness] Can calling extract() multiple times with the same salt but different ikm values create related-key vulnerabilities where attackers can deduce relationships between derived PRKs? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: expand()] [Expand phase limitation] Does expand() properly enforce the RFC 5869 requirement that multiple outputs from the same PRK/info are independent, or can sequential expand() calls leak information about the PRK through output correlations? (Medium)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: extract_then_expand()] [One-shot operation] Does extract_then_expand() properly implement the extract-then-expand paradigm, or can optimization shortcuts create vulnerabilities where extract and expand phases interfere with each other? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: extract_no_ikm_check()] [HMAC initialization] Does extract_no_ikm_check() properly initialize the underlying HMAC with the salt as key, or can incorrect initialization orders cause the salt and ikm to be swapped, breaking HKDF security properties? (Critical)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: extract_then_expand()] [Hierarchical key derivation] Can an attacker derive parent keys from child keys by reversing the HKDF operations, breaking hierarchical key derivation schemes (like BIP32) built on top of this implementation? (Critical)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: expand()] [Key path traversal] Can manipulating the info parameter enable traversal up the key derivation hierarchy, allowing derivation of sibling or parent keys from a compromised child key? (Critical)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: extract()] [Master seed exposure] If the master seed (ikm) used in extract() is compromised, can an attacker derive all past and future keys, or does the salt provide sufficient forward secrecy? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: extract_then_expand()] [Cross-domain derivation] Can keys derived for one domain (e.g., validator consensus keys) be used to derive or infer keys for another domain (e.g., transaction signing keys) through shared PRK values? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: expand()] [Child key index] For hierarchical derivation using info as child index, can integer overflow in child indices cause wrapping that creates key collisions between different derivation paths? (Medium)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: extract()] [DH shared secret] When using extract() with a Diffie-Hellman shared secret as ikm, can small-subgroup attacks or invalid curve point attacks on the DH exchange weaken the derived session keys? (Critical)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: extract_then_expand()] [KDF for key agreement] Does extract_then_expand() properly bind session-specific information (nonces, identities) through salt/info parameters when deriving session keys from DH shared secrets? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: extract()] [Weak DH validation] If ikm contains a weak Diffie-Hellman shared secret (e.g., all zeros from invalid DH exchange), does extract() detect this and reject the weak input, or proceed with weak key derivation? (Critical)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: expand()] [Session key separation] When expanding DH-derived PRKs into multiple session keys (encryption + MAC), does expand() with different info values provide sufficient cryptographic separation to prevent key reuse attacks? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: extract_then_expand()] [Forward secrecy] Does the HKDF implementation support ephemeral key derivation with forward secrecy, or can long-lived PRK values be reused across sessions, compromising forward secrecy guarantees? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: extract()] [Multi-source entropy] When combining entropy from multiple sources (system events, user input, /dev/urandom) in ikm, can one weak source completely compromise the derived key if other sources have high entropy? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/hkdf.rs] [Function: extract()] [Entropy concatenation] If ikm is formed by concatenating multiple entropy sources, does the order of concatenation matter, and can an attacker manipulating concatenation order weaken the derived keys? (Medium)"
]