[
  "[File: aptos-core/types/src/network_address/mod.rs] [Protocol: NoiseIK] [Public key cloning] x25519::PublicKey is cloned when protocols are cloned. Are there side-channel risks if key material is cloned during sensitive operations? (Low)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Derive: Hash, Eq] [Collision resistance] At line 108, NetworkAddress derives Hash. Can attackers craft different addresses that hash to the same value, causing validator identity confusion in HashMap-based lookups? (Medium)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Derive: PartialEq, Eq] [Comparison semantics] Do the derived equality implementations properly handle all edge cases, such as equivalent addresses with different protocol orderings or DNS names with different capitalization? (Medium)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Function: arb_aptosnet_addr()] [Fuzzing coverage] At lines 570-593, the fuzzing strategy generates arbitrary addresses. Does this cover all edge cases like maximum-length DNS names, all-zero keys, boundary port numbers, and mixed IPv4/IPv6 scenarios? (Low)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Arbitrary for DnsName] [Unicode generation] At lines 732-754, DnsName fuzzing generates Unicode strings then filters. Can this miss ASCII-specific edge cases like control characters that pass ASCII checks but cause issues? (Low)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Function: mock()] [Test data in production] At lines 424-427, mock() creates test addresses with Memory protocol. Can test code accidentally call this in production paths, creating invalid addresses? (Medium)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Protocol: Memory] [Conditional compilation] Memory protocol is meant for testing but has no #[cfg(test)] guard on the enum variant at line 121. Can this allow Memory protocols in production builds if test features are enabled? (High)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Function: to_socket_addrs()] [DNS rebinding] Since DNS resolution happens at connection time (lines 477-482), can attackers use DNS rebinding attacks to redirect validator connections from legitimate to malicious nodes mid-session? (Critical)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Function: to_socket_addrs()] [DNS cache poisoning] Does the implementation cache DNS results, or does it re-resolve on every call? Can attackers poison caches to persistently redirect validator traffic? (High)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Enum: Protocol] [Dns4 vs Dns6 ambiguity] With separate Dns4 (line 118) and Dns6 (line 119) protocols, can attackers register addresses as both, causing some validators to connect via IPv4 and others via IPv6, creating network partitions? (High)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Function: from_protocols()] [Partial stack acceptance] The validation allows addresses without session or handshake layers (lines 293, 301 with allow_empty=true). Under what conditions are incomplete stacks acceptable, and can this be exploited? (High)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Function: parse_aptosnet_protos()] [Complete validation] At lines 863-893, the function validates complete AptosNet stacks. But earlier validation in from_protocols() seems more lenient. Which validation is authoritative, and can attackers exploit the difference? (High)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Function: serialize()] [Format oracle] The function at lines 530-546 behaves differently for human-readable vs binary formats. Can attackers use this as an oracle to determine serialization format and craft format-specific attacks? (Low)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Function: deserialize()] [Polymorphic deserialization] At lines 549-567, different deserialization paths are used based on format. Can attackers craft payloads that deserialize successfully in one format but fail in another, causing validator inconsistencies? (Medium)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Function: from_str()] [Leading whitespace] Before checking for empty string (line 443) or leading '/' (line 451), is input trimmed? Can attackers inject leading/trailing whitespace that bypasses validation? (Low)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Function: from_str()] [Unicode normalization] The function uses split('/') which works on byte boundaries. Can Unicode combining characters or other multi-byte sequences cause split points to occur mid-character, corrupting protocol parsing? (Medium)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Function: Protocol::parse()] [Case sensitivity] Protocol names at lines 637-647 use lowercase matching. Can attackers use mixed case (e.g., '/IP4/' or '/Tcp/') to bypass validation or cause parsing failures? (Low)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Protocol: Ip4] [Loopback addresses] At line 115, any Ipv4Addr is accepted. Can validators advertise 127.0.0.1 addresses that only work locally, preventing other validators from connecting? (Medium)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Protocol: Ip4] [Private IP ranges] Can validators advertise RFC 1918 private IPs (10.x, 172.16.x, 192.168.x) that are only reachable within specific networks, causing connectivity failures for external validators? (Medium)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Protocol: Ip6] [IPv6 scope issues] At line 116, any Ipv6Addr is accepted. Can link-local addresses (fe80::/10) cause routing issues since they're only valid on specific network interfaces? (Medium)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Protocol: Ip6] [IPv4-mapped IPv6] Can attackers use IPv4-mapped IPv6 addresses (::ffff:192.0.2.1) to bypass IP filtering that checks for IPv4 vs IPv6 separately? (Medium)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Protocol: Tcp] [Reserved ports] Can validators advertise well-known ports (0-1023) that require root privileges, preventing validators from binding unless run as root (security anti-pattern)? (Medium)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Protocol: Tcp] [Ephemeral port conflicts] Can validators advertise ephemeral ports (32768-65535) that might be already in use by other applications, causing binding failures? (Low)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Multiple Protocol Types] [DNS + IP combination] Can an address contain both DNS and IP protocols? If so, which takes precedence, and can attackers exploit this to cause different validators to connect to different hosts? (High)",
  "[File: aptos-core/types/src/network_address/mod.rs] [Multiple Protocol Types] [Conflicting transport] The validation ensures only one transport (TCP) at lines 284-286, but what if an attacker somehow bypasses this and includes multiple transport protocols? (Medium)"
]