[
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [Feature flag bypass] Can an attacker manipulate the Client to return incorrect values for DELEGATION_POOL_PARTIAL_GOVERNANCE_VOTING, enabling unauthorized delegation pool voting or blocking legitimate votes? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [Race condition] If delegation pool feature flag checks race with pool creation or voting transactions, can this allow delegation pools to vote under incorrect rules, bypassing governance constraints? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [TOCTOU vulnerability] Between checking the feature flag at lines 40-44 and executing delegation pool votes, can the flag state change, allowing votes to be processed under wrong governance rules? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [State divergence] Can different validators see different delegation pool feature flag states, causing some to accept delegation pool votes while others reject them, breaking consensus? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [Delegation pool attack] If this function returns true incorrectly, can delegation pool operators vote with delegator funds without proper authorization, violating delegator voting preferences? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [Concurrent voting] Can delegation pools and direct stakers vote simultaneously by exploiting race conditions in this feature flag check, allowing double-voting from the same underlying stake? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [Error propagation] If get_feature_flag() fails for delegation pools but succeeds for regular governance, can partial failures cause governance to operate in an inconsistent hybrid state? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [Client compromise] If the Client is compromised, can attackers selectively enable/disable delegation pool voting for specific validators to manipulate governance outcomes? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [Network split] During network partitions, can delegation pools function differently across validator sets, causing governance votes to count differently depending on which validators process them? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [Async timing] Can the async execution at line 44 create timing windows where delegation pool voting rules change mid-transaction, causing votes to be invalidated or double-counted? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [Feature flag ordering] If both PARTIAL_GOVERNANCE_VOTING and DELEGATION_POOL_PARTIAL_GOVERNANCE_VOTING need to be checked, can incorrect ordering allow unauthorized voting combinations? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [Delegation authority] Does this function verify that delegation pool operators have proper authority from delegators before allowing votes, or can pool operators vote against delegator interests? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [State synchronization] Are delegation pool feature flag checks synchronized with on-chain delegation pool state updates, or can stale reads allow voting with outdated authorization? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [Epoch boundary] At epoch boundaries when feature flags may change, can delegation pools exploit timing to vote multiple times or bypass voting restrictions? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [Resource exhaustion] Can repeated async calls to check this feature flag exhaust Client resources, causing delegation pool voting to become unavailable during critical governance decisions? (Medium)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [Consensus divergence] If validators disagree on whether delegation pool partial voting is enabled, can this cause different vote tallies and consensus failures on governance proposals? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Function: is_delegation_pool_partial_governance_voting_enabled()] [Cache inconsistency] If the feature flag result is cached with different TTLs across validators, can cache inconsistencies cause delegation pool votes to be accepted by some validators but rejected by others? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Integration: check_remaining_voting_power() + feature flags] Can attackers exploit the interaction between voting power checks and feature flag states to vote with partial governance rules enabled but full voting power, bypassing both restrictions? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Integration: Both feature flag functions] If is_partial_governance_voting_enabled() and is_delegation_pool_partial_governance_voting_enabled() return conflicting states, which takes precedence? Can this ambiguity be exploited to bypass governance rules? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Module-level: Import statement] Does the wildcard import 'use crate::governance::*' at line 4 expose any internal governance functions that could be abused in conjunction with these utility functions? (Medium)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Module-level: Error handling] None of these functions implement explicit error recovery - if all functions fail simultaneously due to Client errors, can this cause complete governance system failure? (High)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Module-level: Thread safety] Are these functions thread-safe when called from multiple concurrent governance transactions? Can data races cause voting power or feature flag state corruption? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Module-level: State consistency] Do these utility functions maintain consistency with the on-chain governance state, or can out-of-sync utility function results cause governance votes to be processed incorrectly? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Module-level: Validator consensus] If different validators use different versions of this utility file with slight implementation differences, can this cause consensus failures on governance outcomes? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/utils.rs] [Module-level: Replay protection] Do these functions include any replay protection mechanisms, or can old function calls be replayed to manipulate governance state? (High)"
]