[
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Function: subscribe_transaction_output_data_with_proof()] [Index sequence] Does this function (lines 283-295) require that subscription_stream_index increments sequentially, or can gaps in indices cause the subscription to miss data? (High)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Function: subscribe_transaction_or_output_data_with_proof()] [Event flag persistence] Does this function (lines 298-314) ensure that include_events settings persist across the entire subscription lifecycle, or can they change mid-stream causing inconsistent data? (Medium)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Function: is_optimistic_fetch()] [Classification bypass] Can request types that should be classified as optimistic fetches (lines 125-130) be misclassified due to incomplete match patterns, causing incorrect rate limiting or caching behavior? (Medium)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Function: is_optimistic_fetch()] [v2 request handling] Does this function correctly identify GetNewTransactionDataWithProof as an optimistic fetch for proper handling, or could v2 requests bypass optimistic fetch rate limits? (Medium)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Function: is_subscription_request()] [Subscription detection] Can non-subscription requests be misclassified as subscriptions (lines 143-148), causing the server to maintain unnecessary subscription state and leak memory? (Medium)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Function: is_subscription_request()] [Resource accounting] If this function fails to detect all subscription types, can attackers create unlimited subscriptions without proper resource limits, causing memory exhaustion? (High)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Function: is_transaction_data_v2_request()] [Version detection failure] Can incorrect detection of v2 requests (lines 151-155) cause the server to apply wrong validation rules or proof generation logic, leading to invalid responses? (High)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Function: is_transaction_data_v2_request()] [Mixed version handling] Can clients send a mix of v1 and v2 requests that confuse server-side routing logic, potentially bypassing security checks designed for one version? (High)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Derive: Serialize/Deserialize] [Malformed data injection] Can a Byzantine peer send malformed serialized request data that causes Serde to deserialize into requests with inconsistent field values not expressible through normal constructors? (Critical)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Derive: Serialize/Deserialize] [Integer boundary values] Can deserializing u64 fields with boundary values (0, u64::MAX) from untrusted peers cause unexpected behavior in downstream handlers that assume positive or bounded values? (High)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Derive: Serialize/Deserialize] [Enum variant injection] Can a Byzantine peer craft serialized data that deserializes into unexpected DataRequest enum variants not present in the current code version, causing panics or undefined behavior? (Critical)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Derive: Serialize/Deserialize] [Nested struct tampering] Can attackers serialize requests with nested TransactionDataRequestType values that don't match their outer DataRequest variant, causing type confusion? (High)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Derive: Hash, Eq] [Request deduplication bypass] Can attackers craft requests with identical hash values but different field values to bypass request deduplication caches, causing redundant processing and DoS? (Medium)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Derive: Hash, Eq] [Hash collision attack] Can malicious peers generate requests that deliberately collide in hash space to cause pathological performance in hash-based rate limiters or request trackers? (High)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Derive: Eq] [Equality comparison issues] Can requests that are semantically different but structurally equal (same fields but different meanings based on context) be incorrectly treated as duplicates? (Medium)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Multiple request types] [Request interleaving] Can a Byzantine peer send alternating subscription requests and one-off requests to cause the server to context-switch excessively, degrading performance and causing validator slowdown? (High)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Multiple request types] [State cache pollution] Can attackers send carefully crafted sequences of GetServerProtocolVersion and GetStorageServerSummary requests to pollute server caches and force eviction of useful data? (Low)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Multiple request types] [Priority inversion] Can low-priority requests (e.g., GetNumberOfStatesAtVersion) be sent in high volumes to starve critical requests (e.g., GetEpochEndingLedgerInfos) and delay consensus? (High)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Request ordering] [Version drift] If a client sends multiple requests with incrementing known_version values faster than the server can process them, can responses arrive out of order causing the client to apply state changes incorrectly? (High)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Request ordering] [Epoch transition race] Can requests sent during an epoch transition receive responses based on different epochs, causing state divergence when the client applies them sequentially? (Critical)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Variant: GetNumberOfStatesAtVersion] [Invalid version query] Can requesting the number of states at version=u64::MAX or version=0 cause the server to perform expensive tree traversals or return misleading counts? (Medium)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Variant: GetNumberOfStatesAtVersion] [State count accuracy] Can Byzantine peers use this request to probe for information about state tree structure that could be used to craft attacks on Jellyfish Merkle tree operations? (Low)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Variant: GetServerProtocolVersion] [Version downgrade attack] Can attackers repeatedly query protocol versions from multiple servers to identify nodes running older versions, then target them with version-specific exploits? (Low)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Variant: GetServerProtocolVersion] [Protocol version confusion] If different peers report different protocol versions, can a client that mixes responses from multiple servers end up with an inconsistent view of network capabilities? (Medium)",
  "[File: aptos-core/state-sync/storage-service/types/src/requests.rs] [Variant: GetStorageServerSummary] [Information disclosure] Can this request reveal sensitive information about server state (storage capacity, sync status, pruning configuration) that could be used to plan DoS attacks? (Low)"
]