[
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: ViewProposal::execute()] [Hash Collision] Can an attacker submit a proposal with a malicious metadata URL that produces a SHA3-256 collision with legitimate metadata, causing the verification at line 143-144 to incorrectly mark malicious proposals as verified? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: ViewProposal::execute()] [URL Manipulation] Does the metadata URL parsing at line 141 properly validate URL schemes, or can an attacker use file://, data://, or other dangerous schemes to read local files or inject malicious content when fetching metadata? (High)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: ViewProposal::execute()] [Table Handle Manipulation] Can an attacker manipulate the voting_table TableHandle at line 128 by submitting malformed VotingForum data, causing the system to read from an incorrect table and return fraudulent proposal data? (High)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: ViewProposal::execute()] [Metadata Injection] At lines 134-136, can an attacker inject malicious metadata_hash or metadata_location values that bypass verification checks by exploiting the unwrap() calls without proper validation? (Medium)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: ViewProposal::execute()] [UTF-8 Parsing] At line 146, does the String::from_utf8() conversion properly handle invalid UTF-8 sequences in metadata, or can an attacker inject non-UTF8 bytes that cause parsing errors or expose internal state? (Medium)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: get_proposal()] [Proposal ID Overflow] Can an attacker submit a proposal_id at line 274 that causes integer overflow when formatted as a string at line 281, potentially accessing unintended table entries or causing deserialization failures? (Medium)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: get_proposal()] [JSON Deserialization] At lines 285-286, can malformed JSON from the REST API cause the serde_json deserialization to panic or expose sensitive error information through the CliError message? (Low)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: ListProposals::execute()] [Event Parsing Bypass] At lines 196-203, can an attacker submit malformed CreateProposalFullEvent data that causes bcs::from_bytes to fail silently, hiding malicious proposals from the listing without raising alerts? (High)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: ListProposals::execute()] [Event Limit Manipulation] Does the 100-event limit at line 189 properly prevent attackers from flooding the event log with spam proposals to push legitimate proposals out of the visible window? (Medium)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: ListProposals::execute()] [Account Address Validation] Is the hardcoded AccountAddress::ONE at line 185 properly validated, or can node operators modify this to query events from unauthorized governance accounts? (Medium)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: VerifyProposal::execute()] [Hash Mismatch Attack] At lines 260-266, can an attacker exploit the hash comparison to verify a malicious script by submitting a compiled script that matches the onchain hash through a pre-image attack or hash collision? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: VerifyProposal::execute()] [Compilation Bypass] Can an attacker manipulate the CompileScriptFunction at lines 240-242 to produce bytecode that verifies against the hash but executes different logic due to compiler vulnerabilities or non-deterministic compilation? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: VerifyProposal::execute()] [Race Condition] Between compiling the local script and retrieving the onchain proposal at lines 240-257, can an attacker modify the onchain proposal to cause a TOCTOU vulnerability where verification passes but execution uses different bytecode? (High)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: SubmitProposal::execute()] [Script Hash Manipulation] At lines 383-396, can an attacker submit a proposal with a manipulated script_hash that differs from the compiled bytecode, allowing execution of unauthorized code that wasn't properly verified? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: SubmitProposal::execute()] [Metadata Hash Bypass] Can an attacker exploit the metadata_hash calculation at line 396 by providing a URL that serves different content after submission, invalidating the hash verification but allowing the proposal to proceed? (High)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: SubmitProposal::execute()] [Multi-Step Proposal Abuse] At lines 389-398, can an attacker abuse the is_multi_step flag to create proposals that bypass single-step validation checks or exploit differences between create_proposal and create_proposal_v2? (High)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: SubmitProposal::execute()] [Pool Address Spoofing] Can an attacker manipulate the pool_address at line 393 to attribute a proposal to a different stake pool, potentially stealing voting power or reputation from legitimate validators? (High)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: SubmitProposalArgs::compile_proposals()] [Bytecode Verification Gap] At lines 326-339, is there a gap between compiling the proposal and displaying hashes where an attacker could swap the bytecode, causing voters to verify one script but execute another? (Critical)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: SubmitProposalArgs::get_metadata()] [URL Validation Bypass] At lines 358-369, can an attacker bypass URL validation by using URL encoding, unicode normalization, or punycode attacks to inject malicious URLs that appear legitimate? (High)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: SubmitProposalArgs::get_metadata()] [Metadata Size Limit] Does the metadata fetching at lines 343-350 enforce size limits, or can an attacker cause DoS by providing a URL that returns gigabytes of data, exhausting memory or storage? (Medium)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: SubmitProposalArgs::get_metadata()] [JSON Injection] At line 352, can malformed JSON in the metadata file cause serde_json::from_slice to panic or execute with unexpected behavior when deserializing into ProposalMetadata? (Medium)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: get_metadata_from_url()] [SSRF Attack] Can an attacker exploit the reqwest client at lines 422-444 to perform Server-Side Request Forgery by providing internal network URLs (e.g., http://localhost:8080/admin) to access restricted services? (High)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: get_metadata_from_url()] [TLS Validation] Does the tls_built_in_root_certs setting at line 423 properly validate TLS certificates, or can an attacker perform MITM attacks by using self-signed certificates or compromised CAs? (High)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: get_metadata_from_url()] [Redirect Chain Attack] Does the HTTP client properly limit redirect chains, or can an attacker create infinite redirects at line 427 that cause the CLI to hang or consume excessive resources? (Medium)",
  "[File: aptos-core/crates/aptos/src/governance/mod.rs] [Function: get_metadata_from_url()] [Response Size Attack] At lines 436-443, is there a maximum response size enforced, or can an attacker cause memory exhaustion by hosting metadata at a URL that returns an unbounded byte stream? (Medium)"
]