[
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: aggregate_with()] [Conflicting dealers] If two transcripts being aggregated have conflicting dealer sets, does the aggregation properly handle this or can it lead to ambiguous ownership of shares that breaks reconstruction? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: aggregate_with()] [Aggregation commutativity] Is aggregation commutative and associative for weighted transcripts, or can the order of aggregation operations lead to different final states, breaking determinism across validators? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: decrypt_own_share()] [Decryption key reuse] Since the same dk (decryption key) is used for all virtual players of a physical player, can an adversary who compromises one virtual player's share compromise all shares for that player through key correlation attacks? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: decrypt_own_share()] [Share consistency validation] After decrypting multiple shares for a weighted player, is there validation that all shares are consistent and correspond to the same polynomial, or can mismatched shares indicate corruption without being detected? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: decrypt_own_share()] [Partial decryption attack] Can a Byzantine player selectively decrypt only some of their weighted shares and withhold others to disrupt threshold reconstruction while appearing to participate honestly? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: decrypt_own_share()] [Decryption replay attack] Can an attacker capture decrypted shares from one DKG session and replay them in another session to corrupt the new secret or bypass fresh randomness requirements? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: decrypt_own_share()] [Share ordering dependency] Does the order of shares in the returned vectors matter for reconstruction, and can an attacker manipulate share ordering to cause reconstruction failures or incorrect secret recovery? (Medium)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: maul_signature()] [Signature forgery] The maul_signature() function allows modification of signatures - can this be exploited by a Byzantine dealer to forge signatures for shares they didn't actually create, violating accountability? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: maul_signature()] [Dealer impersonation] Can maul_signature() be used to make it appear that a different dealer created the transcript, allowing a malicious node to frame honest dealers or evade detection after creating malicious transcripts? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: maul_signature()] [Replay protection bypass] Does signature mauling affect any replay protection mechanisms, allowing old transcripts to be mauled and reused in new DKG ceremonies? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: maul_signature()] [Aggregation invalidation] If signatures are mauled after aggregation, does this invalidate the aggregated transcript or can mauled signatures cause verification to pass incorrectly? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: deal()] [Threshold conversion error] When calling sc.get_threshold_config() to convert weighted config to unweighted, is the threshold calculated correctly considering weights, or can rounding errors cause the effective threshold to be too low? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: verify()] [Threshold validation gap] Does get_threshold_config() ensure that the unweighted threshold is equivalent to the weighted threshold security guarantee, or can threshold lowering attacks exploit this conversion? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: generate()] [Threshold initialization] When generating a new transcript with generate(), is the threshold properly initialized based on weighted requirements, or can default unweighted thresholds be used inadvertently? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Type: SecretSharingConfig] [Config type mismatch] The type uses WeightedConfigBlstrs but calls get_threshold_config() to get ThresholdConfigBlstrs - can type confusion between these configs lead to incorrect threshold enforcement? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: get_public_key_share()] [Share vector size mismatch] If the returned dpk_share vector has a different size than expected based on weight, can this cause index out of bounds during verification or reconstruction? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: get_public_key_share()] [Public key exposure] By allowing retrieval of all public key shares for a player, does this expose information that could help an adversary statistically analyze or predict the secret shares? (Medium)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: get_dealt_public_key()] [Public key substitution] Can an attacker substitute the dealt public key to cause participants to reconstruct toward a different public key controlled by the attacker instead of the legitimate DKG output? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: get_public_key_share()] [Share consistency across calls] If get_public_key_share() is called multiple times for the same player, are the results consistent, or can non-determinism lead to different validators seeing different public key shares? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: dst()] [Domain separation] The dst() function prepends 'WEIGHTED_' to the inner transcript's DST - is this sufficient domain separation to prevent cross-scheme attacks between weighted and unweighted PVSS? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: dst()] [DST collision] Can an attacker craft a malicious unweighted transcript with a DST that matches the weighted DST after prepending, causing domain separation bypass and cross-protocol attacks? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: scheme_name()] [Scheme identification] The scheme_name() prepends 'generic_weighted_' but this is just for identification - can schemes with similar names be confused during verification leading to security bypasses? (Medium)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Const: AIP_80_PREFIX] [Missing prefix] The AIP_80_PREFIX is set to empty string - does this disable any cryptographic domain separation defined in AIP-80, potentially enabling cross-protocol attacks? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: to_weighted_encryption_keys()] [Memory exhaustion] The Vec::with_capacity() call allocates based on untrusted weight values - can extremely large weights cause memory exhaustion that crashes validator nodes during DKG ceremonies? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/pvss/weighted/generic_weighting.rs] [Function: decrypt_own_share()] [Clone performance attack] The ek.clone() operation is called in a loop based on player weights - can an attacker with high weight cause excessive cloning that degrades performance enough to timeout DKG ceremonies? (Medium)"
]