[
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: from_str() for OperationType] [Input validation bypass] Can an attacker submit operation types with mixed case, trailing/leading whitespace, or special Unicode characters that bypass the to_lowercase().trim() normalization, potentially causing operations to be misclassified or rejected incorrectly? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: from_str() for OperationType] [Type confusion] Does the string matching in from_str() handle all possible Unicode normalization forms (NFC, NFD, NFKC, NFKD), or can an attacker use visually identical Unicode characters to bypass operation type validation and submit unauthorized operations? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: from_str() for OperationType] [Denial of service] Can an attacker submit extremely long operation type strings (e.g., millions of characters) that consume excessive memory during to_lowercase() and trim() processing, causing API crashes or slowdowns? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: from_str() for OperationType] [Missing validation] Are there any operation type strings that should be restricted based on account permissions but aren't validated here, allowing base accounts to initiate staking operations they shouldn't be able to perform? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: Display for OperationType] [Information disclosure] Does the Display implementation reveal internal system state or operation details that could help an attacker understand the system's current configuration or identify attack vectors? (Low)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: all() for OperationType] [Enumeration completeness] Does the all() function return ALL operation types defined in the enum, or are some missing, potentially causing incomplete validation or API documentation that doesn't match actual supported operations? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Enum: OperationType ordering] [Operation ordering attack] Since the comment states 'Order is important here for sorting later', can an attacker exploit the enum ordering (CreateAccount before Withdraw before Deposit) to manipulate transaction processing order and cause race conditions in balance updates? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Enum: OperationType] [Fee extraction attack] Since Fee must 'always be last for ordering', can an attacker manipulate the operation list to place Fee operations in incorrect positions, bypassing fee deduction or causing double-charging of fees? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: from_str() for OperationType] [Error message information leak] Does the error message 'Invalid OperationType: {}' in DeserializationFailed leak sensitive information about the system's internal state or expected inputs that could aid reconnaissance attacks? (Low)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: from_str() for OperationStatusType] [Status spoofing] Can an attacker manipulate status strings with Unicode lookalikes or zero-width characters to make a 'failure' status appear as 'success', causing exchanges to incorrectly credit failed transactions? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: From<OperationStatusType> for OperationStatus] [Logic inconsistency] Is the boolean 'successful' field always consistent with the status string, or can deserialization create states where successful=true but status='failure', causing incorrect transaction processing? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: TryFrom<OperationStatus> for OperationStatusType] [Conversion validation] Does the try_from conversion properly validate that OperationStatus.successful matches the parsed status string, or can inconsistent states bypass validation? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: all() for OperationStatusType] [Missing status types] Are there any intermediate or error states (pending, reverted, etc.) that should be represented but aren't included in the Success/Failure binary, potentially causing status reporting gaps? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: get_stake_balances()] [Integer overflow] In line 347 when calculating 'total_active_stake - commission_amount', can an attacker manipulate commission to be larger than total_active_stake, causing integer underflow and reporting inflated balances to exchanges? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: get_stake_balances()] [Integer overflow] In line 360 when calculating 'stake_pool.get_total_staked_amount() - commission_amount', can malicious validators set commission values that cause underflow, allowing them to extract more funds than they're entitled to? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: get_stake_balances()] [Commission bypass] Lines 342-344 comment 'TODO: I think all of these are off' - are the commission calculations incorrect, allowing validators to extract commission from pending_active, inactive, or pending_inactive balances where commission shouldn't apply? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: get_stake_balances()] [Access control bypass] In lines 304-308, the check 'if owner_account.is_base_account()' rejects stake pool queries for base accounts, but can an attacker craft a non-base AccountIdentifier that bypasses this check and queries unauthorized stake pools? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: get_stake_balances()] [Operator verification bypass] In lines 311-317, operator address verification only occurs 'if owner_account.is_operator_stake()', can an attacker use a different account type to bypass operator matching and access other operators' stake balances? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: get_stake_balances()] [State inconsistency] The function retrieves StakePool at a specific version (line 298) and then makes a view call (lines 325-337) - are these operations atomic, or can the stake pool state change between calls, causing inconsistent balance reporting? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: get_stake_balances()] [Array bounds attack] In lines 338-340, the code accesses staking_contract_amounts_response[0], [1], [2] without checking array length - can an attacker trigger a view function that returns fewer elements, causing a panic or accessing invalid memory? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: get_stake_balances()] [BCS deserialization attack] In lines 333-335, bcs::to_bytes() is called on owner_address and operator_address - can malformed addresses cause serialization failures that leak memory or crash the API? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: get_stake_balances()] [Reward calculation manipulation] In line 339 'accumulated_rewards' is retrieved from staking_contract_amounts_response[1] - can a malicious staking contract return manipulated reward values that don't match actual on-chain state? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: get_stake_balances()] [Commission extraction attack] In line 340 'commission_amount' is retrieved and used in multiple calculations - can validators manipulate commission reporting to show lower amounts in queries while extracting higher amounts in withdrawals? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: get_stake_balances()] [Balance type confusion] Lines 345-365 have multiple conditional branches for different stake types - can an attacker craft an AccountIdentifier that matches multiple conditions simultaneously, causing incorrect balance calculation or double-counting? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/misc.rs] [Function: get_stake_balances()] [Pending active stake manipulation] Line 350 returns stake_pool.pending_active without commission deduction - is this correct, or does it allow operators to inflate reported balances before commission is extracted? (Medium)"
]