[
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Primary key collision] Can two different NFT assets have identical asset_uri values after normalization (e.g., URL encoding differences), causing database constraint violations or data overwrites when inserting? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Diesel Insertable] Does the Diesel Insertable trait properly handle NULL values for Option<String> fields, or can insertion fail with constraint violations if the database schema has NOT NULL requirements? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Unicode handling] Are asset URIs properly normalized for Unicode (NFC vs NFD), or can visually identical URIs with different Unicode representations create duplicate database entries defeating deduplication logic? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Field count mismatch] Does the FieldCount derive macro accurately reflect the actual field count, and can mismatches between the struct and database schema cause silent data corruption during bulk operations? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: get_raw_image_uri()] [Information disclosure] Do the warn! logging statements expose sensitive asset_uri values that might contain authentication tokens, API keys, or PII embedded in query parameters? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: get_raw_animation_uri()] [Log injection] Can malicious asset_uri values containing newlines or ANSI escape codes be injected into logs via the warn! macro, allowing log file corruption or terminal injection attacks? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: get_cdn_json_uri()] [Excessive logging] Are None values for URI fields logged too frequently, potentially causing log flooding and storage exhaustion for NFT collections with many missing metadata fields? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: get_cdn_image_uri()] [Debug information leak] Do the warning logs expose internal crawler state or database structure information that could be valuable for reconnaissance by attackers targeting the indexer service? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: From<ParsedAssetUrisQuery>] [Data loss] Does the From trait implementation properly validate all field conversions from ParsedAssetUrisQuery, or can unsafe type coercions cause data truncation or loss of precision? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: From<ParsedAssetUrisQuery>] [Missing validation] Are the i32 and i64 fields validated during conversion to ensure they're within expected ranges, or can extreme values from the database cause logic errors in the application layer? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: From<ParsedAssetUrisQuery>] [Timestamp loss] Does the conversion from ParsedAssetUrisQuery discard the inserted_at timestamp field, potentially losing critical audit trail information about when assets were first crawled? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Serde Deserialize] Can malicious JSON payloads during deserialization cause integer overflow in retry count fields if the JSON contains numbers exceeding i32 limits? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Serde Serialize] Does serialization properly escape special characters in URI strings, or can malformed URIs break JSON structure when ParsedAssetUris is serialized for API responses? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Deserialize validation] Are there any Serde validators that enforce URI format, retry count bounds, or transaction version validity during deserialization, or can invalid data enter the system? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Thread safety] Is ParsedAssetUris thread-safe when accessed concurrently, or can multiple threads modifying retry counts simultaneously cause data races despite Rust's type system? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Database transaction isolation] If multiple crawler workers update the same ParsedAssetUris record concurrently, can race conditions cause lost updates where one worker's changes overwrite another's modifications? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: increment_json_parser_retry_count()] [TOCTOU] Can there be a time-of-check-time-of-use vulnerability where retry count is checked before incrementing, but another thread modifies it in between, bypassing max retry enforcement? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: set_last_transaction_version()] [Concurrent updates] If two crawler instances process different transactions for the same asset_uri simultaneously, can the last_transaction_version be set out of order, causing newer metadata to be overwritten by older data? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: new()] [Empty string] Can an empty string be passed as asset_uri to new(), creating a database record with an invalid primary key that might cause query failures or constraint violations? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: new()] [Whitespace-only URI] Are whitespace-only asset_uri values (e.g., '   ') properly rejected, or can they create valid records that cause processing errors when the crawler attempts to fetch from blank URLs? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: set_asset_uri()] [URI normalization] Are asset URIs normalized before storage (e.g., lowercasing domain, removing trailing slashes), or can minor variations create duplicate entries for the same logical resource? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Default values] Do the default values (retry_count=0, last_transaction_version=0, do_not_parse=false) create any ambiguity with legitimate states, potentially causing processing errors for genesis or initial records? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [NULL vs empty] Are NULL Option<String> values properly distinguished from Some('') empty strings, or can this ambiguity cause incorrect logic when checking if URIs are present? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Inconsistent state] Can a ParsedAssetUris record exist with raw_image_uri populated but cdn_image_uri=NULL and image_optimizer_retry_count=0, indicating an inconsistent state where optimization was never attempted? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Orphaned CDN] If raw_image_uri is updated but cdn_image_uri isn't cleared, can stale CDN references point to cached versions of old images, serving incorrect NFT metadata to users? (Medium)"
]