[
  "[File: third_party/move/move-core/types/src/vm_status.rs] [Function: keep_or_discard()] [Multiple limit status codes] The function matches on EXECUTION_LIMIT_REACHED, IO_LIMIT_REACHED, STORAGE_LIMIT_REACHED, TOO_MANY_DELAYED_FIELDS, UNABLE_TO_CAPTURE_DELAYED_FIELDS - are all these limit checks enforced consistently, or can an attacker hit multiple limits simultaneously and cause ambiguous status returns? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [Function: keep_or_discard()] [ExecutionFailure status_code dropped] When converting ExecutionFailure to KeptVMStatus::ExecutionFailure, the status_code field is intentionally dropped (only location, function, code_offset, message retained) - can this loss of status code information be exploited to hide specific error types from transaction receipts? (Low)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [Function: keep_or_discard()] [sub_status field dropped] The sub_status field from ExecutionFailure is completely dropped when converting to KeptVMStatus - if critical security information is encoded in sub_status, can attackers exploit this information loss to obscure attack vectors? (Low)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [Function: keep_or_discard()] [StatusType::Unknown handling] Error variants with StatusType::Unknown are discarded (return Err) - can an attacker use status codes in the Unknown range to avoid gas charges while still consuming validator CPU time for execution attempts? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [Function: keep_or_discard()] [StatusType::Validation discarding] Validation errors cause transaction to be discarded without gas charges - can prologue validation be exploited to perform expensive computations that get discarded, allowing free DoS attacks on validators? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [Function: keep_or_discard()] [StatusType::InvariantViolation discarding] Invariant violations cause transaction discarding - can an attacker trigger invariant violations deliberately to test for VM bugs without paying gas, effectively getting free security auditing? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [Enum: AbortLocation] [Module ID spoofing] AbortLocation::Module contains a ModuleId - can an attacker craft a malicious module with the same ModuleId as a system module to make errors appear to come from trusted core modules? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [Module: known_locations] [CORE_CODE_ADDRESS hardcoding] The known_locations module uses CORE_CODE_ADDRESS to create system module IDs - if CORE_CODE_ADDRESS can be manipulated or if address collision is possible, can attackers create modules that appear to be core system modules? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [Function: core_account_module_abort()] [Lazy initialization race] The CORE_ACCOUNT_MODULE uses Lazy::new() for initialization - can race conditions during parallel transaction execution cause multiple initializations or partially initialized module IDs? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [Constant: CORE_ACCOUNT_MODULE_IDENTIFIER] [Identifier validation] Module identifiers like \\",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [Module: known_locations] [Diem legacy modules] The file contains both \\",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: INVALID_SIGNATURE] [Signature validation bypass] INVALID_SIGNATURE (code 1) is a validation error that discards transactions - can an attacker craft transactions with signatures that pass initial checks but fail later, causing inconsistent validation across validators? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: SEQUENCE_NUMBER_TOO_OLD/TOO_NEW] [Nonce manipulation] Codes 3 and 4 handle sequence number validation - can an attacker exploit the boundary between \\",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: INSUFFICIENT_BALANCE_FOR_TRANSACTION_FEE] [Balance check timing] Code 5 checks balance before execution - can an attacker drain their balance between validation and execution to avoid paying fees while consuming gas? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: TRANSACTION_EXPIRED] [Expiration timestamp manipulation] Code 6 checks transaction expiration - are expiration timestamps validated consistently across all validators considering network time differences and clock skew? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: SENDING_ACCOUNT_DOES_NOT_EXIST] [Account existence race] Code 7 checks if sender exists - can an attacker create/destroy accounts in the same block to cause inconsistent account existence checks? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: REJECTED_WRITE_SET] [Write set validation bypass] Code 8 rejects invalid write sets - what specific validation is performed, and can attackers craft write sets that pass initial validation but cause state corruption during application? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: EXCEEDED_MAX_TRANSACTION_SIZE] [Size limit enforcement] Code 10 enforces transaction size - is this check performed before deserialization, or can oversized transactions consume resources before being rejected? (Medium)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: UNKNOWN_SCRIPT/UNKNOWN_MODULE] [Allowlist bypass] Codes 11-12 enforce script/module allowlists - can attackers craft bytecode that appears to be allowlisted but contains malicious code after verification? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: MAX_GAS_UNITS_EXCEEDS_MAX_GAS_UNITS_BOUND] [Gas bounds manipulation] Code 13 checks max gas units - can the bound be manipulated per-validator to cause different gas limit enforcement? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: GAS_UNIT_PRICE_BELOW/ABOVE_MIN/MAX_BOUND] [Gas price bounds] Codes 15-16 enforce gas price bounds - can attackers exploit price bound edge cases to pay near-zero gas or cause integer overflow in gas calculations? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: INVALID_GAS_SPECIFIER] [Gas currency validation] Code 17 validates gas specifier - can attackers use invalid gas currencies to bypass gas payment while still executing transactions? (Critical)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: SENDING_ACCOUNT_FROZEN] [Frozen account bypass] Code 18 checks for frozen accounts - can account freezing/unfreezing in the same block create race conditions allowing frozen accounts to transact? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: UNABLE_TO_DESERIALIZE_ACCOUNT] [Deserialization error exploitation] Code 19 handles account deserialization errors - can attackers corrupt account data to cause persistent deserialization failures that freeze accounts? (High)",
  "[File: third_party/move/move-core/types/src/vm_status.rs] [StatusCode: BAD_CHAIN_ID] [Chain ID confusion] Code 23 validates chain ID - can attackers craft transactions that are valid on multiple chains, enabling replay attacks across Aptos networks? (Critical)"
]