[
  "[File: aptos-core/types/src/account_config/events/mod.rs] [NewBlockEvent export] [Height inconsistency] Can NewBlockEvent heights be set arbitrarily without validation, allowing attackers to create gaps in block height sequences or duplicate heights that corrupt chain state and prevent proper synchronization? (High)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [NewBlockEvent export] [Vote bitvec manipulation] Can the previous_block_votes_bitvec field be manipulated to falsely show quorum when insufficient votes exist, or hide votes from honest validators, affecting consensus liveness and safety? (Critical)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [NewBlockEvent export] [Failed proposer DOS] Can malicious validators flood the failed_proposer_indices array with invalid indices or excessively long lists to consume memory, slow down event processing, or cause integer overflows in penalty calculations? (Medium)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [NewBlockEvent export] [Timestamp manipulation] Can NewBlockEvent timestamps be set to arbitrary past or future values to manipulate time-dependent logic like lock periods, vesting schedules, or governance voting deadlines? (High)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [NewEpochEvent export] [Epoch rollback] Can NewEpochEvent from new_epoch.rs be replayed with earlier epoch numbers to rollback validator sets, staking states, or governance configurations to previous vulnerable states? (Critical)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [NewEpochEvent export] [Epoch skip] Can epoch numbers skip values, allowing attackers to bypass governance proposals or validator rotation periods that depend on consecutive epoch progression? (High)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [TokenDeposit export] [Token ID forgery] In TokenDeposit events from token_deposit.rs, can attackers craft fake TokenId structures with manipulated creator, collection, and name fields to deposit counterfeit tokens that appear legitimate in wallets and marketplaces? (Critical)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [TokenDeposit export] [Property version exploit] Can the property_version field in TokenId be manipulated to point to different versions of tokens with altered properties, enabling bait-and-switch attacks where users receive tokens with different characteristics than expected? (High)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [TokenDeposit export] [Amount overflow] Can TokenDeposit amounts exceed safe limits when aggregated, causing balance overflows that enable infinite token duplication? (Critical)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [TokenWithdraw export] [Withdraw without ownership] Can TokenWithdraw events be emitted for tokens the account doesn't own, creating false withdrawal records that manipulate token custody tracking or enable theft by claiming withdrawals never occurred? (Critical)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [CollectionMutation export] [Field name injection] In CollectionMutation events from collection_mutation.rs, can attackers inject arbitrary mutated_field_name values to modify fields that should be immutable, such as creator address or collection type? (High)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [CollectionMutation export] [Value encoding bypass] Can old_value and new_value strings contain encoded malicious data (e.g., SQL injection, script tags) that exploits indexers or display systems processing the mutation events? (Medium)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [CollectionMutation export] [Mutation replay] Can CollectionMutation events be replayed to revert collections to previous states, undoing authorized changes or reverting security fixes to collection metadata? (High)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [TokenMutation export] [Property map bypass] In TokenMutation events from token_mutation.rs, can attackers mutate token properties to bypass restrictions like transfer locks, royalty requirements, or burn authorizations? (High)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [WithdrawFAEvent export] [Store address spoofing] In fungible_asset.rs events, can WithdrawFAEvent store addresses point to fake stores that don't actually hold assets, creating false withdrawal records while leaving actual stores intact with stolen funds? (Critical)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [DepositFAEvent export] [Deposit amount inflation] Can DepositFAEvent amounts be inflated beyond the actual deposit to manipulate total value locked (TVL) metrics, enabling fake liquidity attacks on DeFi protocols? (High)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [Offer export] [Offer double-claim] Can offer events be crafted to allow multiple claims of the same offer, enabling attackers to receive tokens or coins multiple times from a single offer transaction? (Critical)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [Claim export] [Claim without offer] Can Claim events be emitted without corresponding Offer events, allowing attackers to claim non-existent offers or steal funds by fabricating claim records? (Critical)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [CancelOffer export] [Cancel after claim] Can CancelOffer events be emitted after an offer is already claimed, causing state inconsistencies where both claim and cancel records exist, potentially enabling refund exploits? (High)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [All event exports] [BCS deserialization bomb] Can attackers craft malicious BCS-encoded events with deeply nested structures or cyclic references that cause exponential deserialization time in try_from_bytes() implementations across all event types, enabling DoS attacks? (High)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [All event exports] [Type tag substitution] Can the Lazy-initialized TypeTag constants (COIN_DEPOSIT_TYPE, MINT_TYPE, etc.) be exploited through race conditions during initialization to substitute malicious type tags that redirect event routing to attacker-controlled handlers? (Medium)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [All event exports] [Event ordering attack] Can attackers exploit the lack of causal ordering guarantees between different event types (e.g., CoinWithdraw before CoinDeposit) to create impossible states like negative balances or transfers from empty accounts? (High)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [All event exports] [Event size attack] Do all event types have size limits, or can attackers create events with megabyte-sized string fields (coin_type, collection names) that exhaust memory or storage when persisted? (Medium)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [All event exports] [Module address spoofing] Can events from non-CORE_CODE_ADDRESS or non-TOKEN_OBJECTS_ADDRESS modules impersonate system events by setting matching MODULE_NAME and STRUCT_NAME constants, bypassing access controls? (Critical)",
  "[File: aptos-core/types/src/account_config/events/mod.rs] [All event exports] [Struct tag collision] Can different event types have identical MODULE_NAME and STRUCT_NAME combinations, causing type confusion where one event type is deserialized as another, leading to field mismatch exploits? (High)"
]