[
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: new()] [Access Control Bypass] In File::create(), are file permissions explicitly set to restrict access to owner-only (0600), or can any local user read the consensus private keys from the created file, enabling validator key theft? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: new()] [Permission Escalation] Does File::create() preserve secure umask settings, or can an attacker manipulate the process umask before storage initialization to create world-readable key files, exposing all validator consensus keys? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: new()] [Filesystem Race] Between checking !file_path.exists() and File::create(), can an attacker create a symlink at file_path pointing to a sensitive system file, causing the validator to overwrite critical files when writing keys? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [TOCTOU Race] In write(), does File::create(self.temp_path.path()) check if temp_path was replaced with a symlink by an attacker, allowing key material to be written to attacker-controlled files? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Permission Inheritance] When fs::rename() moves temp_path to file_path, are the original file_path permissions preserved, or do looser permissions from the temp file expose consensus keys? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [Symlink Attack] Does File::open(&self.file_path) follow symlinks, allowing an attacker with filesystem access to redirect reads to attacker-controlled files containing malicious serialized data? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: new()] [Directory Traversal] If file_path contains directory traversal sequences (../../etc/shadow), does File::create() validate the path, or will it create files outside the intended storage directory? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: new_with_time_service()] [Panic on Failure] When File::create() fails (disk full, permission denied), the unwrap_or_else() panics, causing validator process crash and potential consensus liveness issues - can an attacker trigger this deliberately? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Struct: OnDiskStorage] [Multi-Process Access] Since OnDiskStorage is not thread-safe without Arc<RwLock<>>, can multiple validator processes or threads access the same file_path simultaneously, causing race conditions in read/write that corrupt consensus keys? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Atomic Rename Failure] Does fs::rename() guarantee atomic replacement of file_path, or can it fail mid-operation leaving the storage in an inconsistent state with neither old nor new data, losing consensus keys permanently? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [Key Material in Memory] The read() function loads the entire HashMap<String, Value> into memory as a String - does this leave consensus private keys in uncleared heap memory accessible to memory dump attacks? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Plaintext Key Storage] The write() function serializes keys to JSON without encryption using serde_json::to_vec() - are consensus private keys stored in plaintext on disk, allowing key theft via filesystem access? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: get()] [Key Leakage in Logs] When get() returns Error::KeyNotSet, does the error message include the key name that could leak sensitive information about validator key structure to attackers monitoring logs? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [Memory Zeroing] Does read() use secure memory clearing for the String contents buffer after deserialization, or do private keys remain in process memory indefinitely accessible to debuggers/core dumps? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Temporary File Exposure] The temp_path file contains full consensus key material in plaintext before rename - does the filesystem cache or journal expose this data to recovery tools even after deletion? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: set()] [Serialization Key Copies] When serde_json::to_value(GetResponse::new(value, now)) serializes the private key value, how many copies of key material exist in memory before garbage collection? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [Key Enumeration] Does serde_json::from_str() validate the structure of the HashMap, or can an attacker-modified storage file enumerate all stored key names by observing deserialization errors? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: new_with_time_service()] [Temp Path Predictability] Is TempPath::new_with_temp_dir() using cryptographically secure random generation, or can an attacker predict temp_path names to pre-create malicious files? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Key Backup Exposure] When fs::rename() replaces file_path, are old versions backed up by the filesystem (macOS Time Machine, Linux LVM snapshots), leaving historical consensus keys exposed? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [Swap File Leakage] Can the String contents buffer be paged to swap during file.read_to_string(), permanently storing consensus private keys in unencrypted swap space accessible after reboot? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [Corrupted File Handling] When serde_json::from_str() fails due to file corruption (partial write, bit flip), does the error propagation allow recovery, or is the consensus key permanently lost requiring validator re-registration? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Partial Write Failure] If file.write_all(&contents) fails after writing partial data (disk full, IO error), does the error leave the temp file in a corrupted state that gets renamed over the valid file_path? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [Empty File Race] The check if contents.is_empty() returns Ok(HashMap::new()) - can an attacker timing attack cause reads during write operations to see empty files, returning empty key storage and breaking consensus? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Rename Atomicity] Does fs::rename() guarantee atomic operation on all filesystems (NFS, CIFS, FUSE), or can network filesystems exhibit partial visibility causing validators to see inconsistent key state? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [JSON Injection] If an attacker modifies the storage file to include JSON injection payloads (deeply nested objects, circular references), can serde_json::from_str() be exploited to cause stack overflow or DoS? (Medium)"
]