[
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: ServerArgs::run()] [Path Traversal] Can an attacker provide a malicious config_path containing '../' sequences or symlinks to read arbitrary files outside the intended configuration directory, potentially exposing secrets or validator private keys? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: load()] [YAML Deserialization Attack] Can an attacker craft a malicious YAML file with deeply nested structures, recursive references, or billion laughs attack patterns to cause memory exhaustion during Figment parsing at line 131-134, leading to indexer service DoS? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: load()] [Type Confusion] Does the generic deserialization at line 130-136 properly validate type constraints, or can an attacker provide a YAML config that deserializes into an unexpected type T, bypassing validation logic and causing runtime panics? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: load()] [Environment Variable Injection] Can an attacker inject malicious values through environment variables using the Env::raw().split('__') merger at line 133, overriding critical security settings in the YAML config and compromising indexer authentication or access controls? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: load()] [Config File Race Condition] Is there a TOCTOU vulnerability between when the config_path is validated and when Figment reads the file at line 132, allowing an attacker to swap the file with a malicious config during the race window? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: ServerArgs::run()] [Validation Bypass] Can an attacker craft a config that passes the validate() check at line 40-41 but contains malicious values that exploit downstream services, such as invalid database connection strings or backdoor endpoints? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: load()] [YAML Anchor Bomb] Does the YAML parser at line 132 limit anchor depth and expansion, or can an attacker use YAML anchors and aliases to create exponential expansion patterns that consume all available memory? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: load()] [File Descriptor Exhaustion] Can an attacker provide a config_path that points to a special file like /dev/zero or a named pipe, causing Figment to hang indefinitely or consume infinite memory when reading at line 132? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: ServerArgs::run()] [Unicode Normalization Attack] Does the config_path parsing handle Unicode normalization attacks, where different Unicode representations of the same path bypass security checks but resolve to the same file? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: load()] [Deserialization Gadget Chain] Can an attacker craft a YAML config that exploits deserialization gadgets in the generic type T at line 130, triggering arbitrary code execution through unsafe Deserialize implementations? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: run_server_with_config()] [Race Condition] Is there a race condition between the task_handler spawn at line 53 and main_task_handler spawn at line 57, where both tasks might access shared config state concurrently without proper synchronization, causing data corruption? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: run_server_with_config()] [Panic Propagation] If the main_task_handler panics at line 58, does the error handling at line 69-74 properly clean up resources, or can it leave the health check server running in a zombie state, misleading monitoring systems? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: run_server_with_config()] [Process Exit Timing] When process::exit(1) is called at line 63 or 71, are there any async tasks or database transactions that might be interrupted mid-operation, causing state corruption in AptosDB or inconsistent indexer state? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: run_server_with_config()] [Tokio Runtime Shutdown] Does the tokio::select! at line 59 properly handle cancellation safety, or can one task be cancelled while holding critical locks, causing deadlocks in other parts of the indexer? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: run_server_with_config()] [Config Clone Safety] Is the config.clone() at line 52 safe if the generic type C contains non-Sync fields or interior mutability, potentially causing data races when both clones are used concurrently? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: run_server_with_config()] [Panic in Select Branch] If both task_handler and main_task_handler complete at the same time, does the tokio::select! behavior cause any panic at line 65 or 73, or is there graceful handling? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: run_server_with_config()] [Error Context Loss] When unwrap() is used in expect() at line 58, does this cause loss of error context that would be critical for debugging consensus or state inconsistencies in production? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: run_server_with_config()] [Task Cancellation Attack] Can an attacker trigger conditions that cause one task to complete unexpectedly, making the other task get cancelled by tokio::select!, potentially interrupting critical indexer database writes? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: run_server_with_config()] [Health Check Port Binding Race] Is there a race condition where the health_port at line 50 is read before the probes handler binds it at line 196-263, allowing another process to bind the port first and causing startup failure? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: run_server_with_config()] [Signal Handling] Does the server properly handle SIGTERM/SIGINT signals, or does it immediately call process::exit() without allowing graceful shutdown of the indexer database connections? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Trait: RunnableConfig] [Type Safety Bypass] Can an attacker provide a type T for GenericConfig<T> that implements RunnableConfig but violates expected invariants, such as returning different values from get_server_name() on each call, causing logging inconsistencies? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: GenericConfig::validate()] [Validation Recursion] Does the validate() delegation at line 93-95 handle infinite recursion if the inner server_config.validate() somehow calls back to the outer validate(), causing stack overflow? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: GenericConfig::run()] [Async Lifetime Safety] Is the lifetime 'static constraint on RunnableConfig at line 112 sufficient to prevent use-after-free bugs when the config is cloned and used across async task boundaries? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Function: GenericConfig::status_page()] [Arbitrary HTML Injection] Does the default status_page() implementation at line 105-107 sanitize the response, or can a malicious RunnableConfig implementation inject arbitrary HTML/JavaScript causing XSS when the status endpoint is accessed? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-server-framework/src/lib.rs] [Trait: RunnableConfig] [Clone Semantics] Does the Clone bound at line 112 ensure deep cloning of all fields, or can a malicious implementation provide shallow clones that share mutable state, causing data races? (High)"
]