[
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: get_abi_paths()] [Path Traversal] Can an attacker create symbolic links in the ABI directory that point outside the intended directory structure, allowing the function to traverse and read arbitrary files from the filesystem, potentially exposing validator private keys or sensitive configuration? (Critical)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: get_abi_paths()] [Directory Traversal] Does the recursive directory traversal properly validate that paths remain within the intended directory boundary, or can '../' sequences in directory names allow escape to parent directories and unauthorized file access? (High)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: get_abi_paths()] [Symlink Attack] Can an attacker create circular symbolic links in the ABI directory causing infinite recursion in the directory traversal, leading to stack overflow and validator node crash affecting network liveness? (High)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: get_abi_paths()] [Race Condition] Is there a TOCTOU (Time-of-Check-Time-of-Use) vulnerability where an attacker can replace a legitimate directory with a symlink between the is_dir() check and the recursive call, enabling path traversal attacks? (High)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: get_abi_paths()] [Resource Exhaustion] Can an attacker create deeply nested directory structures (e.g., 10,000+ levels) causing stack overflow during recursive traversal, crashing validator nodes and causing loss of network liveness? (High)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: get_abi_paths()] [File System Bomb] Can an attacker create directories with thousands of .abi file entries causing memory exhaustion when the Vec<String> grows unbounded, leading to validator OOM crashes and network disruption? (High)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: get_abi_paths()] [Path Canonicalization] Does the function fail to canonicalize paths before processing, allowing attackers to use different path representations (e.g., /./././file.abi) to bypass security checks or cause duplicate processing? (Medium)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: get_abi_paths()] [Special File Handling] Can the function be tricked into processing special files (named pipes, device files, /dev/zero) instead of regular files, causing hangs or crashes when attempting to read them? (Medium)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [Deserialization Attack] Can an attacker craft malicious BCS-encoded .abi files with deeply nested or circular type structures that cause stack overflow during bcs::from_bytes() deserialization, crashing validator nodes? (Critical)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [Type Confusion] Can maliciously crafted BCS data be deserialized into incorrect EntryABI enum variants (e.g., EntryFunction vs TransactionScript), leading to type confusion and memory corruption when the ABI is later used? (Critical)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [Memory Exhaustion] Can an attacker create .abi files with BCS-encoded vectors claiming extremely large lengths (e.g., u64::MAX elements), causing the deserializer to attempt allocating terabytes of memory and crashing validator nodes? (High)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [Integer Overflow] Does the BCS deserialization properly validate size fields to prevent integer overflows when calculating buffer sizes, which could lead to heap buffer overflows and remote code execution? (Critical)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [Denial of Service] Can an attacker provide .abi files with valid BCS format but exponentially expensive deserialization costs (e.g., nested structures requiring quadratic time), causing validator slowdowns and consensus delays? (High)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [Buffer Size Validation] Does read_to_end() have any limits on buffer size, or can an attacker provide multi-gigabyte .abi files causing memory exhaustion and validator crashes when loaded into the buffer Vec? (High)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [Partial Read Attack] Can an attacker create .abi files that cause read_to_end() to fail mid-read (e.g., due to filesystem errors), leaving partially populated buffers that get passed to bcs::from_bytes(), potentially causing undefined behavior? (Medium)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [Error State Corruption] If bcs::from_bytes() fails on one .abi file but the function continues processing, can this lead to inconsistent ABI state where some ABIs are loaded and others aren't, causing determinism issues across validators? (High)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [File Descriptor Exhaustion] Can an attacker create thousands of .abi files causing the function to open too many file descriptors simultaneously, exhausting system resources and preventing validators from opening network sockets? (High)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [Race Condition] Is there a TOCTOU vulnerability where an attacker can modify or replace .abi files between when get_abi_paths() lists them and when File::open() reads them, allowing injection of malicious ABIs? (High)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [Symbolic Link Following] Does File::open() follow symbolic links without validation, allowing attackers to point .abi files to sensitive system files (/etc/shadow) or special devices, causing hangs or information disclosure? (Medium)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [Error Propagation] Does the ? operator properly propagate all I/O errors, or are there edge cases where errors are silently ignored, leading to incomplete ABI loading and non-deterministic validator behavior? (Medium)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [File Locking] Does the function acquire file locks when reading .abi files, or can concurrent modifications by other processes corrupt the data being read, leading to invalid ABIs and validator crashes? (Medium)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [Non-Deterministic Sorting] Can the sorting logic produce different orderings across validators due to unstable sort behavior or platform differences, causing validators to generate different transaction builder code and breaking consensus determinism? (Critical)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [Sort Key Collision] If multiple ABIs have identical (module_name, function_name) tuples, does the sort produce a consistent ordering, or can it vary non-deterministically across runs, breaking deterministic code generation? (High)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [Empty String Handling] For EntryABI::TransactionScript variants, the sort key uses empty string for module name - can this cause sorting anomalies where transaction scripts are incorrectly ordered relative to entry functions? (Medium)",
  "[File: aptos-core/aptos-move/aptos-sdk-builder/src/lib.rs] [Function: read_abis()] [Unicode Sorting] Does the lexicographical comparison handle Unicode characters correctly across different locales, or can locale differences cause validators to sort ABIs differently, breaking determinism? (Medium)"
]