[
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Liveness Attack] Can an attacker manipulate system time backwards (before 1970-01-01 00:00:00 UTC) on validator nodes to trigger the expect() panic, causing validator crashes and total loss of liveness if >1/3 validators are affected? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch_at()] [Liveness Attack] If system_time parameter is set to a value before UNIX_EPOCH, does the expect() panic crash consensus/execution threads, potentially halting block production and causing network-wide liveness failure? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Validator DoS] Can a malicious actor with OS-level access to validator infrastructure set system clocks backwards to pre-1970 dates, triggering panics in all time-dependent consensus operations and forcing validators offline? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch_at()] [Safety Violation] If the expect() panic occurs during critical consensus state transitions (e.g., during block proposal or voting), can it leave validators in inconsistent states, potentially violating AptosBFT safety guarantees? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Determinism Break] Does the panic from expect() cause non-deterministic validator behavior, where some validators crash while others continue, leading to potential consensus disagreements and chain splits? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Consensus Manipulation] Can Byzantine validators manipulate their system clocks forward by hours/days to artificially advance round timeouts, forcing premature leader rotations and gaining unfair block proposal advantages? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Timestamp Forgery] Since duration_since_epoch() relies on SystemTime::now() without validation, can validators with manipulated clocks produce blocks with future timestamps that honest validators should reject, but don't if timestamp validation is insufficient? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Time Desynchronization Attack] If validators have significant clock drift (minutes to hours), can attackers exploit timing discrepancies to cause validators to disagree on round timeouts, leader election timing, or epoch boundaries, fragmenting the network? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch_at()] [Block Timestamp Manipulation] Can malicious validators call duration_since_epoch_at() with arbitrary future SystemTime values to create blocks with future timestamps, bypassing timestamp validation and potentially enabling double-spending through out-of-order transaction execution? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Epoch Transition Exploit] Can time manipulation cause validators to disagree on epoch boundaries, where some validators transition to a new validator set while others remain in the old epoch, causing permanent network partition? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Round Timeout Bypass] If consensus round timeouts depend on duration_since_epoch(), can attackers with fast-forwarded clocks force rapid timeout certificate generation, causing unnecessary round progressions and degrading consensus performance? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Race Condition] When multiple consensus threads call duration_since_epoch() concurrently during block proposal and voting, can inconsistent timestamp readings (even microseconds apart) cause validators to produce different state roots, breaking deterministic execution? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [TOCTOU Vulnerability] Between the time-of-check (reading timestamp for timeout decision) and time-of-use (actually processing the timeout), can clock changes cause validators to make incorrect liveness decisions, potentially halting consensus? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Transaction Ordering Attack] If transaction ordering or mempool prioritization uses duration_since_epoch() for timestamps, can concurrent calls with microsecond differences lead to non-deterministic transaction ordering across validators? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch_at()] [Parameter Injection] If system_time parameter is derived from external sources (network messages, user inputs, block headers), can attackers inject manipulated SystemTime values to bypass time-based validation checks? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Integer Overflow] When duration_since_epoch() returns Duration values representing hundreds of years (extremely large values), can downstream arithmetic operations overflow when calculating timeouts, intervals, or expiry times, causing incorrect consensus behavior? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Nanosecond Overflow] Does Duration's internal nanosecond representation (u64) risk overflow in far-future scenarios (year 2554+), potentially causing panics or incorrect time calculations in long-running blockchain networks? (Low)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch_at()] [Subtraction Underflow] If duration_since_epoch_at() is used to calculate elapsed time intervals, can underflow occur when subtracting two Duration values if system clock moves backwards (e.g., NTP adjustment), causing panics or incorrect timeout calculations? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Millisecond Conversion Loss] When converting Duration to milliseconds for consensus timing, can precision loss in the conversion cause validators to disagree on exact timeout expiry, leading to split timeout certificates? (Low)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Leader Election Bias] If leader election timing relies on duration_since_epoch(), can validators with slightly faster clocks consistently detect timeouts earlier, gaining unfair advantages in becoming leaders and proposing blocks? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Safety Rule Violation] If safety rules (preventing double-signing) use duration_since_epoch() for timestamp validation, can clock manipulation allow validators to sign conflicting blocks by bypassing timestamp monotonicity checks? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Quorum Certificate Timing] Can time manipulation affect quorum certificate (QC) validation, where QCs with future timestamps might be accepted/rejected inconsistently across validators with different clock states? (High)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Pacemaker Exploit] If the AptosBFT pacemaker uses duration_since_epoch() for round progression, can attackers manipulate timing to cause premature or delayed round changes, disrupting optimal leader rotation? (Medium)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Block Metadata Inconsistency] If block metadata includes timestamps from duration_since_epoch(), can inconsistent timestamps across validator proposals for the same round cause validators to produce different block hashes, breaking consensus? (Critical)",
  "[File: aptos-core/crates/aptos-infallible/src/time.rs] [Function: duration_since_epoch()] [Transaction Expiry Bypass] If transaction expiry times are validated against duration_since_epoch(), can validators with manipulated clocks accept expired transactions or reject valid ones, causing non-deterministic transaction execution? (High)"
]