[
  "[File: network/framework/src/constants.rs] [Constant: MAX_MESSAGE_SIZE] [Message size bypass] Can attackers bypass MAX_MESSAGE_SIZE (64 MiB) validation by sending messages as multiple separate RPC requests that are reassembled at a higher protocol layer, effectively circumventing the 64 MiB limit? (High)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_MESSAGE_SIZE] [Memory exhaustion] With MAX_MESSAGE_SIZE set to 64 MiB and MAX_CONCURRENT_INBOUND_RPCS at 100, can malicious peers simultaneously send 100 * 64 MiB = 6.4 GiB of concurrent messages to exhaust validator memory and cause crashes? (Critical)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_MESSAGE_SIZE] [Deserialization bomb] Can attackers craft compressed or nested data structures that fit within MAX_MESSAGE_SIZE (64 MiB) when serialized but explode to many gigabytes when deserialized, bypassing size limits and causing memory exhaustion? (Critical)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_MESSAGE_SIZE] [Message validation timing] Is MAX_MESSAGE_SIZE (64 MiB) checked before or after expensive deserialization operations, and can attackers send invalid 64 MiB messages that waste CPU cycles on deserialization before being rejected? (Medium)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_MESSAGE_SIZE] [State sync exploitation] During state synchronization, can malicious validators send state chunks exactly at MAX_MESSAGE_SIZE (64 MiB) repeatedly, consuming maximum bandwidth per message and preventing nodes from synchronizing in reasonable time? (High)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_MESSAGE_SIZE] [Application layer inconsistency] Does MAX_APPLICATION_MESSAGE_SIZE in network_config.rs (MAX_MESSAGE_SIZE minus metadata/padding) properly account for all network overhead, or can messages that fit MAX_MESSAGE_SIZE (64 MiB) still exceed buffer limits after metadata is added? (High)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_MESSAGE_SIZE] [Fragment reassembly attack] When messages approach MAX_MESSAGE_SIZE (64 MiB) and are fragmented, can attackers send duplicate or overlapping fragments to corrupt the reassembled message or cause buffer overflows? (High)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_MESSAGE_SIZE] [Per-protocol variation] Is MAX_MESSAGE_SIZE (64 MiB) enforced uniformly across all protocols (consensus, mempool, state sync), or can certain protocols bypass this limit, creating attack vectors through less-protected protocol paths? (Medium)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_MESSAGE_SIZE] [Message queue amplification] If network channels buffer up to NETWORK_CHANNEL_SIZE (1024) messages, each potentially MAX_MESSAGE_SIZE (64 MiB), can this create a 64 GiB buffer per channel, and how many channels exist per validator? (High)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_MESSAGE_SIZE] [Serialization inconsistency] Can differences in serialization libraries or versions cause messages to serialize to different sizes, potentially violating MAX_MESSAGE_SIZE (64 MiB) on some nodes but not others, creating network incompatibilities? (Medium)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_CONCURRENT_NETWORK_NOTIFS] [Notification flooding] Can malicious peers trigger network notifications faster than they can be processed, exceeding MAX_CONCURRENT_NETWORK_NOTIFS (100) and causing notification drops that lose critical peer connection/disconnection events? (High)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_CONCURRENT_NETWORK_NOTIFS] [Event ordering violation] When MAX_CONCURRENT_NETWORK_NOTIFS (100) is reached and notifications are dropped, can this cause validators to miss peer connection events, leading to incorrect peer state tracking and potential consensus participation errors? (High)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_CONCURRENT_NETWORK_NOTIFS] [Notification amplification] Can a single network event trigger multiple notifications, and can attackers exploit this to amplify 1 event into many notifications that exceed MAX_CONCURRENT_NETWORK_NOTIFS (100) capacity? (Medium)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_CONCURRENT_NETWORK_NOTIFS] [Connection churn attack] Can attackers rapidly connect and disconnect to generate connection notification floods that exceed MAX_CONCURRENT_NETWORK_NOTIFS (100), preventing legitimate notifications from being processed? (Medium)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_CONCURRENT_NETWORK_NOTIFS] [Notification backpressure] When MAX_CONCURRENT_NETWORK_NOTIFS (100) is exceeded, does backpressure properly propagate to event generators, or can notifications continue to be generated and queued elsewhere, causing cascading buffer exhaustion? (High)",
  "[File: network/framework/src/constants.rs] [Constants: INBOUND_RPC_TIMEOUT_MS + MAX_CONCURRENT_INBOUND_RPCS] [Combined attack] Can attackers send exactly MAX_CONCURRENT_INBOUND_RPCS (100) requests that each take slightly less than INBOUND_RPC_TIMEOUT_MS (10s) to process, monopolizing the validator for 1000 seconds total and causing extended consensus unavailability? (Critical)",
  "[File: network/framework/src/constants.rs] [Constants: MAX_FRAME_SIZE + MAX_MESSAGE_SIZE] [Chunking arithmetic] Is the calculation max_message_size / max_frame_size = 64 MiB / 4 MiB = 16 chunks properly validated, or can integer division errors cause off-by-one vulnerabilities in chunk limits? (Medium)",
  "[File: network/framework/src/constants.rs] [Constants: MAX_MESSAGE_SIZE + MAX_CONCURRENT_INBOUND_RPCS] [Memory bounds] Does the product MAX_MESSAGE_SIZE (64 MiB) * MAX_CONCURRENT_INBOUND_RPCS (100) = 6.4 GiB exceed available memory on validators, and can this be exploited for memory exhaustion attacks? (Critical)",
  "[File: network/framework/src/constants.rs] [Constants: NETWORK_CHANNEL_SIZE + MAX_MESSAGE_SIZE] [Channel memory] Can the combination of NETWORK_CHANNEL_SIZE (1024) * MAX_MESSAGE_SIZE (64 MiB) = 64 GiB theoretical buffer per channel cause out-of-memory crashes if fully utilized? (High)",
  "[File: network/framework/src/constants.rs] [Constants: All RPC limits] [Global limit calculation] With MAX_CONCURRENT_INBOUND_RPCS (100), MAX_CONCURRENT_OUTBOUND_RPCS (100), and MAX_CONCURRENT_NETWORK_NOTIFS (100), what is the total maximum concurrent network operations (300+), and can this exceed system resources? (High)",
  "[File: network/framework/src/constants.rs] [Constants: Timeout + Channel Size] [Timeout queue interaction] If NETWORK_CHANNEL_SIZE (1024) messages are queued and each takes up to INBOUND_RPC_TIMEOUT_MS (10s) to timeout, can this create a 10,240 second (2.8 hour) total delay queue that causes severe liveness degradation? (High)",
  "[File: network/framework/src/constants.rs] [Constants: Frame + Channel Size] [Frame buffer calculation] With NETWORK_CHANNEL_SIZE (1024) and MAX_FRAME_SIZE (4 MiB), can attackers fill channels with 1024 * 4 MiB = 4 GiB of frame data per channel, and how many channels can be created per validator? (High)",
  "[File: network/framework/src/constants.rs] [All Constants] [Configuration override] Can these constants defined in constants.rs be overridden at runtime through configuration files, and if so, can misconfigurations create security vulnerabilities (e.g., setting MAX_MESSAGE_SIZE to MAX_INT)? (High)",
  "[File: network/framework/src/constants.rs] [All Constants] [Test vs production] The file comment states these constants are 'only used in tests' but they're also referenced in production code - can test-appropriate values create production vulnerabilities when MAX_CONCURRENT_INBOUND_RPCS (100) is too low for mainnet traffic? (Medium)",
  "[File: network/framework/src/constants.rs] [All Constants] [Hardcoded values] Since all constants are hardcoded in constants.rs without dynamic adjustment, can network conditions change such that these fixed values (like 10s timeout, 100 concurrent RPCs) become inadequate and cause network degradation over time? (Medium)"
]