[
  "[File: aptos-core/types/src/function_info.rs] [Struct: FunctionInfo] [State synchronization] During state sync, can FunctionInfo instances be corrupted or manipulated, causing validators to execute wrong functions after sync? (High)",
  "[File: aptos-core/types/src/function_info.rs] [Function: as_move_value()] [Gas accounting] Is gas properly charged for as_move_value() conversion, especially for large strings? Can attackers exploit this to perform expensive operations without paying gas? (High)",
  "[File: aptos-core/types/src/function_info.rs] [Function: from_str()] [Parsing gas] Is gas metered for from_str() parsing? Can complex parsing operations consume excessive gas, enabling economic DoS? (Medium)",
  "[File: aptos-core/types/src/function_info.rs] [Struct: FunctionInfo] [Storage gas] Is storage gas properly calculated for FunctionInfo instances stored in global state? Can undercharging enable state bloat attacks? (Medium)",
  "[File: aptos-core/types/src/function_info.rs] [Integration: Transaction Validation] [Nonce bypass] Can malicious FunctionInfo redirect to prologue functions that skip sequence number verification, enabling transaction replay attacks? (Critical)",
  "[File: aptos-core/types/src/function_info.rs] [Integration: Transaction Validation] [Cross-chain replay] Can FunctionInfo be reused across different Aptos networks (mainnet/testnet) without chain ID validation, enabling cross-chain replay attacks? (High)",
  "[File: aptos-core/types/src/function_info.rs] [Struct: FunctionInfo] [Module upgrade] After module upgrades, can old FunctionInfo instances still reference previous module versions, causing function resolution to outdated/vulnerable code? (High)",
  "[File: aptos-core/types/src/function_info.rs] [Struct: FunctionInfo] [Migration safety] During protocol upgrades that change FunctionInfo format, are existing instances migrated safely? Can migration bugs cause function resolution failures? (High)",
  "[File: aptos-core/types/src/function_info.rs] [Struct: FunctionInfo] [Backward compatibility] If FunctionInfo format changes, can old transactions with previous format still be validated? Can format confusion enable bypass attacks? (Medium)",
  "[File: aptos-core/types/src/function_info.rs] [Struct: FunctionInfo] [Signature verification] If FunctionInfo is used in signature schemes (e.g., signing function calls), can field manipulation create valid signatures for unintended functions? (Critical)",
  "[File: aptos-core/types/src/function_info.rs] [Struct: FunctionInfo] [Hash preimage] Can attackers find hash collisions for different FunctionInfo instances, creating two functions with same hash that resolve ambiguously? (High)",
  "[File: aptos-core/types/src/function_info.rs] [Struct: FunctionInfo] [Module visibility bypass] Can FunctionInfo reference private or internal functions that shouldn't be callable externally, bypassing Move's visibility modifiers? (Critical)",
  "[File: aptos-core/types/src/function_info.rs] [Struct: FunctionInfo] [Entry function restriction] Can FunctionInfo reference non-entry functions in transaction contexts where only entry functions should be callable? (High)",
  "[File: aptos-core/types/src/function_info.rs] [Struct: FunctionInfo] [Generic function confusion] If functions have generic type parameters, can FunctionInfo resolve to wrong generic instantiations, causing type confusion attacks? (High)",
  "[File: aptos-core/types/src/function_info.rs] [Struct: FunctionInfo] [Overloaded functions] If multiple functions have same name but different signatures, can FunctionInfo resolve ambiguously to wrong function variant? (High)",
  "[File: aptos-core/types/src/function_info.rs] [Function: new()] [Move semantics violation] Can new() be called in contexts where FunctionInfo should be moved/borrowed, violating Move's ownership semantics? (Medium)",
  "[File: aptos-core/types/src/function_info.rs] [Struct: FunctionInfo] [Comparison safety] Is PartialEq implementation safe? Can malicious instances be crafted to always compare equal, breaking deduplication or caching logic? (Medium)",
  "[File: aptos-core/types/src/function_info.rs] [Struct: FunctionInfo] [Hash implementation] Is Hash implementation collision-resistant? Can attackers craft instances with intentional hash collisions for cache poisoning? (Medium)",
  "[File: aptos-core/types/src/function_info.rs] [Integration: Multi-sig] [Function call authorization] In multi-sig transactions, can FunctionInfo be manipulated after signature collection to execute different functions than authorized? (Critical)",
  "[File: aptos-core/types/src/function_info.rs] [Integration: Fee Payer] [Fee bypass via function] Can malicious FunctionInfo redirect fee payment to functions that skip fee charging, enabling free transactions? (Critical)",
  "[File: aptos-core/types/src/function_info.rs] [Function: from_str()] [Injection via parsing] Can from_str() be exploited with crafted input that injects malicious data into module_name or function_name fields despite parsing validation? (High)",
  "[File: aptos-core/types/src/function_info.rs] [Function: as_move_value()] [Vector size limit] Is the MoveValue::Vector size limited? Can oversized vectors cause allocation failures or VM crashes? (Medium)",
  "[File: aptos-core/types/src/function_info.rs] [Struct: FunctionInfo] [Capability bypass] Can FunctionInfo be used to call functions requiring capabilities without proper capability checks, escalating privileges? (Critical)",
  "[File: aptos-core/types/src/function_info.rs] [Struct: FunctionInfo] [Signer injection] Can FunctionInfo facilitate calling functions with injected signer arguments, impersonating other accounts? (Critical)",
  "[File: aptos-core/types/src/function_info.rs] [Integration: Script execution] [Script prologue bypass] Can FunctionInfo redirect script transactions to bypass script prologue checks (max gas, signature verification)? (Critical)"
]