[
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Struct: ParserConfig] [Deserialization Attack] Can an attacker provide a malicious configuration JSON with extremely large Vec<String> in uri_blacklist field causing memory exhaustion during deserialization, leading to crawler denial of service? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Attribute: deny_unknown_fields] [Configuration Tampering] Does the #[serde(deny_unknown_fields)] attribute prevent all configuration injection attacks, or can attackers bypass this by exploiting case-sensitivity or Unicode normalization to inject malicious fields? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: google_application_credentials] [Credential Exposure] Can the Optional google_application_credentials path be manipulated to point to attacker-controlled credential files through path traversal sequences (../, ..\\), leading to unauthorized GCS access? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: bucket] [Path Traversal] Is the bucket field validated to prevent path traversal attacks where an attacker specifies '../../../sensitive-bucket' to write parsed NFT data to unauthorized GCS buckets? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: cdn_prefix] [URL Injection] Can the cdn_prefix field contain malicious URLs with embedded credentials (https://user:pass@evil.com/) that get logged or exposed, leading to credential leakage when constructing CDN URIs? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: max_file_size_bytes] [Integer Overflow] Is max_file_size_bytes (u32) properly validated against system memory limits, or can setting it to u32::MAX (4,294,967,295 bytes) cause integer overflow when used in buffer allocation calculations? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: max_file_size_bytes] [Memory Exhaustion] Can an attacker set max_file_size_bytes to maximum u32 value and trigger parallel downloads of multiple large files, causing out-of-memory conditions and crawler crashes? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: image_quality] [Range Validation] Is image_quality (u8) validated to be within valid range (0-100), or can values >100 cause undefined behavior in image processing libraries leading to memory corruption? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: max_image_dimensions] [Integer Overflow] Can max_image_dimensions (u32) be set to extreme values (e.g., 4,294,967,295) causing integer overflow when calculating total pixel count (width * height), leading to buffer overflows in image processing? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: max_num_parse_retries] [Negative Value] Why is max_num_parse_retries defined as i32 instead of u32, and can negative values (-1, i32::MIN) cause infinite retry loops or unexpected comparison behavior in retry logic? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: ipfs_prefix] [SSRF Attack] Can the ipfs_prefix field be manipulated to point to internal network endpoints (http://localhost:8080, http://169.254.169.254) enabling Server-Side Request Forgery attacks when the crawler resolves IPFS URIs? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: ipfs_prefix] [Protocol Injection] Is ipfs_prefix validated to only allow safe protocols (https://, ipfs://), or can attackers inject dangerous protocols (file://, ftp://, data://) to access local files or trigger protocol-specific vulnerabilities? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: ipfs_auth_key] [Credential Exposure] Is the Optional ipfs_auth_key stored securely in memory, or can it be leaked through debug logging, error messages, or core dumps when the ParserConfig struct is formatted or serialized? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: ipfs_auth_key] [Authentication Bypass] If ipfs_auth_key is None, does the system fall back to unauthenticated IPFS access, potentially allowing attackers to poison NFT metadata by replacing authenticated gateway responses? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: uri_blacklist] [Blacklist Bypass] Does the uri_blacklist use simple substring matching (contains()), allowing attackers to bypass blocks through URL encoding (%2F), case variations, or Unicode homoglyphs in malicious URIs? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: uri_blacklist] [ReDoS Attack] Can uri_blacklist entries contain regex patterns that cause catastrophic backtracking (ReDoS) when matching against attacker-controlled URIs, leading to CPU exhaustion? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: uri_blacklist] [Time-of-Check-Time-of-Use] Is uri_blacklist checked atomically, or can race conditions between blacklist checks and URI fetching allow temporarily blacklisted URIs to be processed? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Function: default_max_file_size_bytes()] [Insecure Default] Is the default 15MB limit (DEFAULT_MAX_FILE_SIZE_BYTES) sufficient to prevent resource exhaustion, or can attackers trigger OOM by submitting many 15MB files concurrently? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Function: default_image_quality()] [Data Loss] Does the default 100% image quality (DEFAULT_IMAGE_QUALITY) pose storage cost attacks where attackers submit uncompressed images that consume excessive GCS storage without quality reduction? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Function: default_max_image_dimensions()] [Memory Bomb] Is the default 4096x4096 pixel limit (DEFAULT_MAX_IMAGE_DIMENSIONS) safe against decompression bombs, where small compressed images expand to gigabytes when decoded at maximum dimensions? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Function: default_max_num_parse_retries()] [Retry Storm] Can the default 3 retries (DEFAULT_MAX_NUM_PARSE_RETRIES) be exploited to cause retry storms when many NFT URIs simultaneously fail, overwhelming external IPFS gateways or internal services? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Derive: Clone] [Data Race] When ParserConfig is cloned and wrapped in Arc for concurrent workers, can modifications to shared uri_blacklist Vec cause data races or use-after-free if accessed without proper synchronization? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Struct: ParserConfig] [TOCTOU Race] If configuration is reloaded dynamically while workers are active, can Time-Of-Check-Time-Of-Use races occur where workers operate with inconsistent config snapshots (e.g., old max_file_size_bytes vs new uri_blacklist)? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: bucket] [Bucket Hijacking] Is the bucket name validated to prevent typosquatting or bucket takeover attacks where an attacker creates a similarly-named bucket to capture uploaded NFT metadata? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/parser/config.rs] [Field: cdn_prefix] [Open Redirect] Can cdn_prefix be set to an attacker-controlled domain, causing the crawler to construct CDN URIs that redirect users to phishing sites when they view NFT metadata? (Medium)"
]