[
  "[File: config/global-constants/src/lib.rs] [Constant: CONSENSUS_KEY] [Key collision] Can an attacker exploit the hardcoded 'consensus' string to cause key collision attacks in secure storage systems by creating malicious keys with the same identifier, potentially overwriting legitimate validator consensus keys and enabling unauthorized block signing? (Critical)",
  "[File: config/global-constants/src/lib.rs] [Constant: CONSENSUS_KEY] [Storage manipulation] If multiple components access the CONSENSUS_KEY constant concurrently, can race conditions in secure storage operations allow an attacker to swap consensus keys during validator rotation, causing Byzantine validators to sign with compromised keys? (Critical)",
  "[File: config/global-constants/src/lib.rs] [Constant: OWNER_ACCOUNT] [Account takeover] Can the hardcoded 'owner_account' string be exploited to impersonate validator owner accounts in storage systems, potentially allowing unauthorized stake withdrawals or validator configuration changes? (Critical)",
  "[File: config/global-constants/src/lib.rs] [Constant: OWNER_ACCOUNT] [Authorization bypass] Does the OWNER_ACCOUNT constant lack namespace isolation, allowing attackers to create conflicting owner account references that bypass access control checks in validator management? (High)",
  "[File: config/global-constants/src/lib.rs] [Constants: CONSENSUS_KEY, OWNER_ACCOUNT] [Cross-validator attacks] Can malicious validators exploit the global nature of these key constants to access or corrupt other validators' keys in shared secure storage implementations, leading to consensus manipulation? (Critical)",
  "[File: config/global-constants/src/lib.rs] [Constant: SAFETY_DATA] [Consensus safety violation] Can an attacker manipulate the 'safety_data' storage key to corrupt or erase persistent safety rules data, allowing validators to double-sign conflicting blocks and violate AptosBFT safety guarantees? (Critical)",
  "[File: config/global-constants/src/lib.rs] [Constant: SAFETY_DATA] [State rollback attack] If SAFETY_DATA storage is compromised, can an attacker roll back validator voting history to enable equivocation attacks, causing chain splits and double-spending vulnerabilities? (Critical)",
  "[File: config/global-constants/src/lib.rs] [Constant: WAYPOINT] [Sync poisoning] Can malicious nodes provide corrupted waypoint data using the global 'waypoint' key to trick syncing validators into following a forked chain, causing network partition? (Critical)",
  "[File: config/global-constants/src/lib.rs] [Constant: GENESIS_WAYPOINT] [Genesis manipulation] Can attackers exploit the 'genesis-waypoint' constant to inject malicious genesis state during validator initialization, potentially creating a shadow network with stolen validator identities? (Critical)",
  "[File: config/global-constants/src/lib.rs] [Constants: WAYPOINT, GENESIS_WAYPOINT] [Waypoint confusion] Can the separate WAYPOINT and GENESIS_WAYPOINT constants be exploited to cause inconsistencies where validators use mismatched waypoints, leading to permanent network split? (High)",
  "[File: config/global-constants/src/lib.rs] [Constant: GAS_UNIT_PRICE] [Economic attack] Can attackers exploit the conditional compilation of GAS_UNIT_PRICE (0 in test mode, 100 in production) to inject test-mode binaries into production networks, allowing free transactions and enabling spam attacks that exhaust validator resources? (Critical)",
  "[File: config/global-constants/src/lib.rs] [Constant: GAS_UNIT_PRICE] [Fee bypass] If the GAS_UNIT_PRICE value of 100 is hardcoded without dynamic adjustment mechanisms, can attackers exploit this fixed price during network congestion to submit high-volume low-fee transactions that crowd out legitimate users? (Medium)",
  "[File: config/global-constants/src/lib.rs] [Constant: GAS_UNIT_PRICE] [Build configuration attack] Can malicious build processes incorrectly set the 'testing' feature flag to deploy production nodes with GAS_UNIT_PRICE = 0, allowing attackers to execute unlimited free transactions and drain validator resources? (Critical)",
  "[File: config/global-constants/src/lib.rs] [Constant: GAS_UNIT_PRICE] [Determinism violation] Does the conditional compilation of GAS_UNIT_PRICE between test and production modes risk creating non-deterministic transaction execution if validators accidentally run mixed binary configurations, causing state divergence? (High)",
  "[File: config/global-constants/src/lib.rs] [Constant: GAS_UNIT_PRICE] [Zero-price exploitation] In test configurations where GAS_UNIT_PRICE is 0, can attackers exploit this to test attack vectors (like infinite loops or resource exhaustion) that would be prohibitively expensive in production, then deploy similar attacks optimized for low cost? (Medium)",
  "[File: config/global-constants/src/lib.rs] [Constant: MAX_GAS_AMOUNT] [Resource exhaustion] Can attackers craft transactions consuming exactly MAX_GAS_AMOUNT (2,000,000 in production) to maximize computation cost per transaction, combining many such transactions to overload validator execution capacity and cause liveness failures? (High)",
  "[File: config/global-constants/src/lib.rs] [Constant: MAX_GAS_AMOUNT] [Test-prod disparity] With MAX_GAS_AMOUNT being 100,000,000 in test mode versus 2,000,000 in production, can attackers exploit the 50x difference to develop complex attack transactions in test environments that behave differently in production, bypassing security testing? (Medium)",
  "[File: config/global-constants/src/lib.rs] [Constant: MAX_GAS_AMOUNT] [Transaction censorship] Can malicious validators exploit the MAX_GAS_AMOUNT limit to selectively reject legitimate complex transactions (claiming they exceed limits) while accepting attacker transactions, enabling censorship attacks? (Medium)",
  "[File: config/global-constants/src/lib.rs] [Constant: MAX_GAS_AMOUNT] [Feature flag exploitation] If validators are deployed with incorrect feature flags (test vs production), can the 50x MAX_GAS_AMOUNT difference cause consensus failures when validators disagree on whether transactions exceed gas limits? (High)",
  "[File: config/global-constants/src/lib.rs] [Constant: MAX_GAS_AMOUNT] [State bloat attack] Can attackers design transactions that consume exactly MAX_GAS_AMOUNT while maximizing state storage growth, repeating this pattern to cause database bloat that degrades validator performance over time? (Medium)",
  "[File: config/global-constants/src/lib.rs] [Constants: GAS_HEADROOM_NUMERATOR, GAS_HEADROOM_DENOMINATOR] [Integer ratio vulnerability] With GAS_HEADROOM_NUMERATOR = 3 and DENOMINATOR = 2, does the 1.5x multiplier correctly handle edge cases near u64::MAX, or can integer overflow in multiplication cause the adjust_gas_headroom function to return incorrect values? (High)",
  "[File: config/global-constants/src/lib.rs] [Constants: GAS_HEADROOM_NUMERATOR, GAS_HEADROOM_DENOMINATOR] [Economic manipulation] Can attackers exploit the fixed 1.5x headroom ratio to craft transactions where gas estimation consistently underestimates actual costs, causing transactions to fail mid-execution and wasting users' fees? (Medium)",
  "[File: config/global-constants/src/lib.rs] [Constants: GAS_HEADROOM_NUMERATOR, GAS_HEADROOM_DENOMINATOR] [Simulation attack] If gas simulation relies on the 1.5x headroom, can attackers manipulate transaction preconditions to make simulated gas usage deviate significantly from actual execution, enabling front-running or MEV attacks? (Medium)",
  "[File: config/global-constants/src/lib.rs] [Constants: GAS_HEADROOM_NUMERATOR, GAS_HEADROOM_DENOMINATOR] [Hardcoded ratio risk] Does the hardcoded 3/2 ratio lack flexibility for different transaction types (simple transfers vs complex smart contracts), potentially causing gas estimation failures for edge case transactions? (Low)",
  "[File: config/global-constants/src/lib.rs] [Constant: DEFAULT_BUCKETS] [Metrics manipulation] Can the DEFAULT_BUCKETS array [0, 150, 300, 500, 1000, 3000, 5000, 10000, 100000, 1000000] be exploited to hide performance degradation by placing malicious transactions in specific bucket ranges that aren't monitored, evading detection systems? (Low)"
]