[
  "[File: restore.rs] [Partial restore state] If restore operation is interrupted between save_before_replay_version() and actual replay, can the node be left with transactions saved but state not updated? (High)",
  "[File: restore.rs] [KV vs full replay inconsistency] The code supports both KV-only replay (replay_kv) and full replay (replay_transactions) - can switching between these modes mid-restore cause state inconsistencies? (Critical)",
  "[File: restore.rs] [State store reset timing] Line 655 resets state store before replay, but if database still has uncommitted writes from previous operations, can this cause data loss? (High)",
  "[File: restore.rs] [Frozen subtree state] confirm_or_save_frozen_subtrees() updates accumulator state - if this fails after some chunks are processed, can it leave accumulator in inconsistent state? (High)",
  "[File: backup.rs] [Manifest-chunk temporal gap] Manifest is written at line 206 after all chunks are written, but if backup process crashes before manifest write, are orphaned chunks left in storage? (Medium)",
  "[File: restore.rs] [Target version manipulation] loaded_chunk_stream() filters chunks by target_version at line 362, but if target_version is set to u64::MAX, does this disable filtering and allow arbitrary chunk processing? (Medium)",
  "[File: restore.rs] [First version override] Line 310 allows first_version to be overridden, potentially skipping frozen subtree confirmation - when is this safe vs. unsafe? (High)",
  "[File: restore.rs] [Replay version None bypass] Line 82 returns Version::MAX when replay_from_version is None - can this be used to bypass replay entirely even when it should be required? (Medium)",
  "[File: manifest.rs] [Empty backup validation] Can a backup with first_version == last_version == 0 and empty chunks array pass validation if carefully crafted? (Medium)",
  "[File: backup.rs] [Max chunk size bypass] should_cut_chunk() check at line 89 depends on max_chunk_size, but can max_chunk_size be set to usize::MAX to force single-chunk backups bypassing chunking? (Low)",
  "[File: restore.rs] [BCS deserialization trust] Lines 122 and 131 deserialize different tuple types based on format - can an attacker provide valid BCS for wrong type causing runtime errors? (High)",
  "[File: restore.rs] [TransactionChunkFormat trust] LoadedChunk::load() trusts manifest.format field - can an attacker modify manifest.format to cause type confusion during deserialization? (High)",
  "[File: manifest.rs] [Serde default exploitation] default_to_v0() at line 37 provides V0 as default format - can missing format field in JSON be exploited to downgrade to V0? (Medium)",
  "[File: analysis.rs] [CSV type confusion] CSV serialization doesn't include type information - could this cause issues if analysis files are parsed incorrectly? (Low)",
  "[File: restore.rs] [Metric race conditions] TRANSACTION_SAVE_VERSION and TRANSACTION_REPLAY_VERSION metrics are set at lines 520, 618, 719 - can concurrent operations cause these to report incorrect values? (Low)",
  "[File: restore.rs] [Progress tracking manipulation] Accumulative TPS calculations at multiple points use elapsed time - can clock adjustments or time manipulation cause incorrect progress reporting that hides attacks? (Low)",
  "[File: restore.rs] [Verify metric update] VERIFY_TRANSACTION_VERSION at line 779 is updated during verification mode - can this metric be used to infer sensitive information about backup contents? (Low)",
  "[File: backup.rs] [Async file operations] Lines 164-172 and 178-179 use async file I/O - can tokio runtime misconfiguration cause these operations to block indefinitely? (Medium)",
  "[File: restore.rs] [Spawn blocking exhaustion] Multiple spawn_blocking() calls could exhaust tokio's blocking thread pool - is there a limit to prevent this? (Medium)",
  "[File: restore.rs] [Buffered stream deadlock] Multiple buffered_x() operations create complex async dependency chains - can these deadlock if buffer sizes are misconfigured? (Medium)",
  "[File: restore.rs] [Peekable stream race] loaded_chunk_stream() returns a Peekable stream that's peeked at line 408 - can concurrent peeks cause race conditions? (Low)",
  "[File: restore.rs] [PersistedAuxiliaryInfo trust] V1 format includes PersistedAuxiliaryInfo but V0 uses None - can an attacker craft V1 chunks with malicious aux info to exploit downstream processing? (High)",
  "[File: restore.rs] [Auxiliary info synchronization] Multiple drain operations at lines 479-483, 490-494, 503-507 must keep persisted_aux_info synchronized with other vectors - can off-by-one errors cause misalignment? (High)",
  "[File: restore.rs] [Auxiliary info in KV replay] replay_kv() at line 594 passes persisted_aux_info to save_transactions_and_replay_kv() - is aux info validated before applying to state? (Medium)",
  "[File: backup.rs] [Client response validation] Lines 82-84 call client.get_transactions() and trust the response - can malicious client return transactions from wrong versions? (Critical)"
]