[
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Integer Overflow] Can an attacker submit a transaction with transaction_version near i64::MAX causing integer overflow when the indexer processes subsequent transactions, leading to database primary key collisions and state corruption? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Integer Overflow] Does write_set_change_index accept negative values, and if so, can an attacker manipulate this to create duplicate primary keys (transaction_version, write_set_change_index) causing database constraint violations and indexer crashes? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Integer Underflow] Can transaction_block_height be negative or zero, potentially causing incorrect block height ordering in queries and breaking dependent indexer logic that assumes monotonically increasing heights? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_delete_resource()] [Integer Boundary] Are there checks preventing transaction_version from being i64::MIN or i64::MAX, which could cause arithmetic overflow in database range queries or indexer pagination logic? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Panic Attack] At line 52, serde_json::to_value() uses unwrap() - can an attacker craft a WriteResource with malformed data that fails JSON serialization, causing the indexer to panic and halt all transaction processing? (Critical)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: convert_move_struct_tag()] [Panic Attack] At line 93, the collect operation uses unwrap_or(None) after potential errors - can an attacker provide move_type values that cause serialization failures, and does the error silently return None masking data corruption? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [DoS via Panic] If serde_json::to_value() panics at line 52, does this crash the entire indexer process or just the current transaction batch, and can an attacker repeatedly trigger this to cause persistent DoS? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: convert_move_struct_tag()] [Error Masking] When generic_type_params conversion fails and returns None at line 93, does this silently drop type information that could be critical for correctly indexing parameterized Move resources? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Address Manipulation] At line 49, standardize_address() is called - can an attacker provide an address shorter than 2 characters causing slice index out of bounds panic in the underlying format!('0x{:0>64}', &handle[2..]) operation? (Critical)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Address Injection] Does standardize_address() properly sanitize addresses containing non-hex characters, or can an attacker inject malicious characters that bypass validation and corrupt database queries when addresses are used in SQL WHERE clauses? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_delete_resource()] [Address Collision] At line 71, if standardize_address() produces identical output for different input addresses (e.g., '0x1' and '0x01'), can an attacker create resource collisions where one resource overwrites another in the database? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [State Key Hash Manipulation] At line 54, state_key_hash is standardized but not validated - can an attacker provide a malformed state_key_hash that appears valid after standardization but doesn't match the actual on-chain state key, causing state inconsistencies? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_delete_resource()] [Hash Collision Attack] At line 76, can an attacker craft a delete operation with a state_key_hash that collides with an existing write operation's hash after standardization, causing incorrect resource deletion tracking? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Memory Exhaustion] At line 52, write_resource.data.data is serialized without size limits - can an attacker create a Move resource with gigabytes of nested data causing OOM when serializing to JSON and crashing the indexer? (Critical)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [JSON Bomb Attack] Can an attacker craft deeply nested Move struct data (e.g., 10000 levels of nesting) that when serialized at line 52 causes stack overflow or excessive CPU consumption during JSON serialization? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: convert_move_struct_tag()] [Type Serialization DoS] At lines 87-90, each generic type parameter is serialized to JSON - can an attacker provide Move types with extremely long type names or deeply nested generics causing exponential serialization time? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Database Overflow] Does the database column for 'data' have a size limit, and can an attacker create Move resources exceeding this limit causing database insertion failures and indexer desynchronization from blockchain state? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: convert_move_struct_tag()] [JSON Injection] When serializing move_type at line 89, can an attacker craft Move types containing JSON control characters that break the JSON structure and cause parsing errors in downstream consumers? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Struct: MoveResource] [Primary Key Collision] The composite primary key (transaction_version, write_set_change_index) - can an attacker manipulate write_set_change_index to be identical across different write set changes in the same transaction, causing primary key violations? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Race Condition] If multiple indexer instances process the same transaction concurrently, can they create duplicate MoveResource entries with identical primary keys causing database conflicts and data loss? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_delete_resource()] [Data Inconsistency] When is_deleted is true at line 75, data is set to None - but can an attacker later insert a write operation with the same primary key, and does the database properly handle this write-after-delete scenario? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Struct: MoveResource] [Foreign Key Violation] The foreign key transaction_version references Transaction table - can the indexer insert MoveResource before the corresponding Transaction is committed, causing referential integrity violations? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Index Monotonicity] Is write_set_change_index guaranteed to be sequential starting from 0, or can gaps/jumps in indices cause incorrect ordering when querying resource changes within a transaction? (Low)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: from_write_resource()] [Type String Injection] At line 47, type_ is set from write_resource.data.typ.to_string() without validation - can an attacker craft type strings containing SQL injection payloads that execute when queries filter by type_? (High)",
  "[File: aptos-core/crates/indexer/src/models/move_resources.rs] [Function: convert_move_struct_tag()] [Module Name Injection] At line 82, module name is converted to String without sanitization - can malicious module names contain null bytes, control characters, or path traversal sequences that corrupt indexer queries? (Medium)"
]