[
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Getter Methods] [Reference Lifetime] Do the index() and token() methods return references with proper lifetimes, or can dangling references cause use-after-free vulnerabilities in event processing code? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Clone Implementation] [Deep Copy] Does the Clone trait implementation properly deep-copy the AccountAddress, or could shared mutable state lead to race conditions in multi-threaded event processing? (Low)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [MODULE_NAME constant] [Name Collision] Can other modules create structs named 'BurnEvent' in module 'collection' at different addresses, causing event routing confusion in the API and indexers? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [TOKEN_OBJECTS_ADDRESS] [Address Hardcoding] If TOKEN_OBJECTS_ADDRESS changes in a protocol upgrade, will existing serialized BurnEvents fail to deserialize, causing historical event processing failures? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Integration] [Supply Tracking Mismatch] When collection.move emits BurnEvent (lines 501-504), does it properly synchronize with FixedSupply.current_supply decrement (line 488), or can race conditions cause supply inconsistency? (High)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Integration] [Event Handle Corruption] If the burn_events EventHandle in FixedSupply/UnlimitedSupply becomes corrupted, can this prevent BurnEvent emission while tokens are still destroyed, breaking supply invariants? (High)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Integration] [Migration Edge Case] During migration from legacy BurnEvent to new Burn event (collection.move lines 489-506), can tokens burned during the transition window be double-counted or lost? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Serialize Trait] [Determinism] Is BCS serialization deterministic for BurnEvent, or can different serialization orders of index/token fields cause event hash mismatches across validators? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Deserialize Trait] [Version Compatibility] If the BurnEvent struct definition changes (e.g., adding fields), will old serialized events fail to deserialize, breaking historical event replay? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [API Exposure] [Information Leak] Can exposing BurnEvent details through REST API reveal information about token holder patterns that could be exploited for front-running or privacy attacks? (Low)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Field: index] [Boundary Value] Can using index=1 for the first token cause off-by-one errors if other code assumes 0-based indexing, leading to incorrect token lookups? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Field: token] [Zero Address] Can BurnEvent be created with token=0x0 (null address), potentially causing null pointer dereferences in unsafe Rust code that processes events? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Field: token] [System Address] Can burning tokens at system-reserved addresses (like @aptos_framework) bypass special protections and corrupt system state? (High)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Event Emission] [Non-Atomic Operations] If BurnEvent emission and actual token destruction in token.move (line 771) are not atomic, can failures between steps leave the system in inconsistent state with events emitted but tokens not destroyed? (Critical)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Event Emission] [Race Condition] Can concurrent burns of different tokens in the same collection emit overlapping BurnEvents that corrupt the shared burn_events EventHandle? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Parallel Execution] [Block-STM Conflict] During parallel transaction execution, can conflicting writes to collection supply and BurnEvent emission cause transaction aborts that leave partial state modifications? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Event Integrity] [Missing Signature] Does BurnEvent include any cryptographic signature or proof that the burn was authorized by the token owner, or can anyone emit events claiming burns occurred? (High)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Event Integrity] [Tampering Detection] Can validators detect if BurnEvent data has been tampered with during transmission, or could MITM attacks modify event contents before indexer processing? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Supply Impact] [Underflow Prevention] When collection.move decrements current_supply (lines 488, 509), does it prevent underflow if BurnEvents are emitted for non-existent tokens, potentially wrapping to MAX_U64? (Critical)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Supply Impact] [Max Supply Bypass] Can emitting BurnEvents without actually destroying tokens allow re-minting beyond max_supply limits in FixedSupply collections, enabling unlimited token creation? (Critical)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Supply Impact] [Total Minted Mismatch] If total_minted is not adjusted when burns occur, can the invariant 'current_supply = total_minted - total_burned' be violated, corrupting collection statistics? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Supply Impact] [Concurrent Supply] For ConcurrentSupply collections using aggregators, can BurnEvent emission race with aggregator updates, causing supply tracking to diverge from reality? (High)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Gas Metering] [Unmetered Operations] Are BurnEvent creation and serialization properly gas-metered, or can attackers spam low-cost burn operations to exhaust validator resources? (Medium)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Performance] [Event Handle Growth] As burn_events EventHandle grows unbounded with each burn, can this cause O(n) performance degradation in event emission for large collections? (Low)",
  "[File: aptos-core/types/src/account_config/events/burn_event.rs] [Indexer Processing] [Incomplete Data] Since BurnEvent lacks previous_owner field (unlike new Burn event line 148 in collection.move), can indexers fail to properly attribute burns to specific accounts, breaking analytics? (Low)"
]