[
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Function: execute()] [Path Traversal] Can an attacker provide a malicious package_dir path with directory traversal sequences (e.g., ../../../../sensitive/path) that bypasses path validation in get_package_path(), allowing compilation of arbitrary directories outside the intended workspace? (Medium)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Field: output_dir] [Path Traversal] Does output_dir validation prevent an attacker from specifying paths like /etc/passwd or other system directories, potentially causing the linter to write compiled bytecode to sensitive system locations? (Medium)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Field: package_dir] [Symlink Attack] Can an attacker create a symbolic link in package_dir that points to a sensitive directory, causing the linter to process and potentially expose contents of unintended directories? (Low)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Function: execute()] [Path Canonicalization] Is package_path properly canonicalized before use, or can an attacker exploit relative path resolution to access files outside the intended package directory? (Medium)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Field: named_addresses] [Address Injection] Can an attacker provide maliciously crafted named_addresses (e.g., extremely long names, special characters, or collision-inducing values) that cause parse_map to crash or produce incorrect address mappings affecting lint results? (Low)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Field: named_addresses] [Duplicate Address Attack] The comment warns about duplicates in Move.toml - does the BTreeMap insertion properly detect and reject duplicate named_addresses that could cause non-deterministic compilation behavior? (Low)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Field: named_addresses] [Address Confusion] Can an attacker override critical system addresses (like 0x1, 0x3, 0x4) through named_addresses parameter, causing the linter to check code against wrong address assumptions and miss actual deployment errors? (Medium)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Function: execute()] [Version Downgrade] The execute() method hardcodes CompilerVersion::latest_stable() - can an attacker exploit version mismatches between this forced version and the package's actual target version to hide bugs that would be caught in production? (Medium)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Field: language_version] [Language Version Bypass] Can an attacker specify an outdated language_version that lacks security checks present in LATEST_STABLE_LANGUAGE_VERSION, causing the linter to miss vulnerabilities that would be caught with current language rules? (Medium)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Field: language_version] [Future Version Attack] Can an attacker provide a language_version value higher than LATEST_STABLE_LANGUAGE_VERSION (if validation is missing), potentially causing undefined behavior or crashes in the compiler? (Low)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Field: experiments] [Experimental Feature Abuse] The experiments field is hidden but accepted - can an attacker enable dangerous experimental compiler features that bypass safety checks or cause non-deterministic behavior in lint results? (Medium)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Function: execute()] [Experiment Override] The execute() method adds hardcoded experiments (LINT_CHECKS, SPEC_CHECK, etc.) - can an attacker's experiments parameter conflict with or override these required checks, causing critical lints to be skipped? (Medium)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Function: execute()] [Experiment Injection] Can an attacker inject malicious experiment names through the experiments Vec that cause the Move compiler to enable unsafe behaviors or bypass established safety checks? (Low)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Field: skip_fetch_latest_git_deps] [Dependency Confusion] Can an attacker set skip_fetch_latest_git_deps=true and provide local malicious git dependencies that replace legitimate ones, causing the linter to validate against backdoored code without fetching authentic dependencies? (High)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Field: skip_attribute_checks] [Attribute Bypass] Can an attacker use skip_attribute_checks to hide malicious or malformed attributes in Move code that would normally be rejected, allowing deployment of code with dangerous annotations? (Medium)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Field: skip_fetch_latest_git_deps] [Supply Chain Attack] Does skip_fetch_latest_git_deps combined with local git repo manipulation allow an attacker to perform dependency pinning attacks where outdated vulnerable dependencies are linted instead of patched versions? (Medium)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Field: dev] [Dev Mode Confusion] Can an attacker exploit dev mode to use dev-addresses and dev-dependencies that differ significantly from production addresses, causing the linter to validate code against the wrong address space and miss deployment failures? (Medium)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Field: dev] [Test Artifact Leakage] The comment states dev mode 'pulls in all test compilation artifacts' - can an attacker use this to expose internal test-only code paths or dependencies that shouldn't be visible in production lint runs? (Low)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Field: override_std] [Stdlib Substitution] Can an attacker use override_std with malicious StdVersion values (mainnet/testnet/devnet) to swap the standard library, causing the linter to validate against incorrect stdlib APIs and miss actual incompatibilities? (Medium)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Field: override_std] [Version Mismatch Attack] Can override_std be used to force linting against a testnet stdlib when code is intended for mainnet, hiding production-breaking API differences and causing runtime failures? (Low)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Function: from_str()] [Invalid Option Injection] Does the from_str() implementation for LintOptions properly handle all edge cases (empty string, whitespace, mixed case, unicode), or can an attacker inject unexpected values that cause crashes or wrong lint level selection? (Low)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Function: to_config()] [Config Injection] The to_config() method returns a BTreeMap with 'checks' key - can an attacker manipulate the checks value through FromStr to inject additional config keys that override other lint settings? (Low)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Enum: LintOptions] [Escalation Attack] Can an attacker claim to run 'default' checks but somehow force 'experimental' checks to be disabled, or vice versa, causing incorrect security assessment of Move code? (Low)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Function: execute()] [BuildOptions Manipulation] The execute() method constructs BuildOptions with included_artifacts = IncludedArtifacts::Sparse - can an attacker modify this through other fields to cause Full artifact generation, exposing more compiled bytecode than intended? (Low)",
  "[File: aptos-core/crates/aptos/src/move_tool/lint.rs] [Function: execute()] [Build Config Attack] Can an attacker exploit the build_config creation or resolved_graph preparation to inject malicious build parameters that affect how the Move code is linted? (Low)"
]