[
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [Function: GasSchedule::into_btree_map()] [Case sensitivity] Are gas parameter keys case-sensitive - if an attacker submits 'storage.PER_BYTE_WRITE' instead of 'storage.per_byte_write', does the VM fail to find the parameter and default to zero cost, or does it perform case-insensitive lookup that could be exploited? (High)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [Struct: GasSchedule] [Key length limit] Without max length validation on String keys, can an attacker submit entries with 10MB string keys causing excessive memory consumption in BTreeMap nodes, degrading validator performance or causing OOM during gas schedule lookups? (Medium)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [Struct: GasScheduleV2] [Control character injection] Can gas parameter keys contain newlines, null bytes, or other control characters that could break parsers, loggers, or monitoring tools that process gas schedules, causing operational issues or hiding malicious entries? (Low)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [Function: GasScheduleV2::to_btree_map_borrowed()] [Key reference safety] The borrowed keys returned as &str assume the original Strings remain valid - if the GasScheduleV2 is moved or reallocated during BTreeMap use, could this cause dangling references even in safe Rust code due to lifetime issues? (Medium)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [Struct: StorageGasSchedule] [Economic asymmetry] Can a governance attack set per_item_create to 1 gas but per_byte_create to u64::MAX, making small item creation extremely cheap but large item creation impossible, breaking contracts that rely on creating large resources? (High)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [Struct: GasSchedule] [Validator-favoring manipulation] Can colluding validators propose gas schedules that set costs high for operations they don't use but low for operations they exploit, extracting more value from the network than honest validators? (Medium)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [Struct: StorageGasSchedule] [Read-write asymmetry] If per_byte_read is set to 0 but per_byte_write is high, can attackers perform free read attacks to extract private state information or exhaust validator I/O without paying appropriate costs? (High)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [Struct: GasScheduleV2] [MEV creation] Can strategic gas schedule changes create MEV opportunities where front-runners exploit the announcement of upcoming gas changes to submit transactions that become profitable after the change takes effect? (Medium)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [Struct: StorageGasSchedule] [Storage griefing] If per_item_write and per_byte_write are set artificially low through governance capture, can attackers cheaply create millions of small state items that validators must store permanently, causing long-term storage costs exceeding collected gas? (High)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [Function: GasSchedule::into_btree_map()] [Concurrent conversion] If multiple threads call into_btree_map() on the same GasSchedule simultaneously, does the Vec::into_iter().collect() guarantee thread-safe execution, or could concurrent ownership transfers cause data races or double-free issues? (High)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [Struct: GasScheduleV2] [Clone race condition] The #[derive(Clone)] allows cloning GasScheduleV2 - if one thread clones while another is reading the entries Vec or feature_version field during a governance update, could partial/inconsistent state be cloned? (Medium)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [Function: GasScheduleV2::diff()] [Concurrent diff computation] If diff() is called concurrently on the same old and new schedules from multiple validator threads (e.g., during proposal validation), does the BTreeMap mutation via entry.remove_entry() cause data races or non-deterministic diff results? (High)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [OnChainConfig Implementation] [Update atomicity] When a new gas schedule is written to OnChainConfig storage, is the update atomic at the byte level, or could a concurrent reader see partially updated gas values causing incorrect gas calculations mid-block? (Critical)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [Struct: GasSchedule] [Vec capacity exhaustion] If GasSchedule.entries grows to millions of elements through repeated governance additions without cleanup, could the Vec reallocation cause memory fragmentation or allocation failures on memory-constrained validator nodes? (Medium)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [Function: GasSchedule::into_btree_map()] [BTreeMap memory overhead] Converting a Vec with 100,000 entries to BTreeMap incurs significant memory overhead for tree nodes - could this cause validators with limited RAM to OOM crash during gas schedule loading? (Medium)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [Struct: GasScheduleV2] [Clone amplification] If GasScheduleV2 with large entries Vec is cloned repeatedly during transaction processing, could the memory overhead from deep cloning cause performance degradation or memory exhaustion under high transaction load? (Low)",
  "[File: aptos-core/types/src/on_chain_config/gas_schedule.rs] [OnChainConfig Implementation] [State bloat] As gas schedules evolve over time, are old versions garbage collected from OnChainConfig storage, or do they accumulate indefinitely causing state bloat and slower state sync for new validators? (Low)"
]