[
  "[File: third_party/move/tools/move-package-manifest/src/lib.rs] [Function: parse_package_manifest()] [TOML bomb - string length] Can an attacker provide extremely long strings (MB or GB) in fields like license or package name that pass TOML parsing but cause OOM when deserializing? (Medium)",
  "[File: third_party/move/tools/move-package-manifest/src/lib.rs] [Function: parse_package_manifest()] [TOML bomb - nested tables] Can an attacker create deeply nested TOML tables that cause stack overflow during recursive parsing, even though the final PackageManifest struct is not deeply nested? (Medium)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Function: deserialize_unique_vec()] [Duplicate check complexity] The duplicate check uses BTreeSet with O(log n) insertions - can an attacker provide a massive authors list (millions of entries) to cause excessive CPU usage during duplicate checking? (Low)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Field: PackageMetadata.name] [Package name injection] If package names are used in code generation, file paths, or SQL queries without sanitization, could special characters in validated package names enable injection attacks in downstream systems? (Medium)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Field: PackageMetadata.license] [License string injection] If the license string is displayed in web UIs or build logs without escaping, could an attacker inject HTML, JavaScript, or terminal escape sequences to exploit those systems? (Low)",
  "[File: third_party/move/tools/move-package-manifest/src/package_name.rs] [Function: is_valid_package_name()] [Regex DoS] Although not using regex, the character-by-character validation could be slow for extremely long strings - can an attacker provide package names of maximum String length to cause validation DoS? (Low)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Full module] [Serialize-deserialize non-idempotence] If a PackageManifest is deserialized, modified, and re-serialized, are there any transformations or normalizations that could change semantic meaning? Could this be exploited to create 'chameleon manifests' that mean different things to different tools? (Medium)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Enum: PackageLocation] [Location canonicalization] Are Git URLs and local paths canonicalized? Could an attacker use './' or '../' in paths, or different URL schemes (http vs https) to create dependencies that appear different but resolve to the same source? (Medium)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Field: PackageManifest.addresses] [BTreeMap ordering] BTreeMap maintains sorted order - does the order of address definitions affect compilation behavior? Could an attacker exploit ordering to shadow earlier address definitions? (Low)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Enum: PackageLocation::Git] [Git protocol security] If git:// protocol is allowed instead of https://, can an attacker perform man-in-the-middle attacks to inject malicious code during dependency fetching? (High)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Enum: PackageLocation::Git] [SSH URL exploitation] If SSH URLs are supported (git@github.com:...), could this leak SSH keys or credentials when building in untrusted environments? (High)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Enum: PackageLocation::Git] [Submodule poisoning] If the Git repository contains submodules, could an attacker poison submodule URLs to fetch malicious code from attacker-controlled repositories? (High)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Enum: PackageLocation::Git] [Tag vs commit confusion] Tags are mutable in Git - if 'rev' refers to a tag instead of a commit hash, could an attacker force-push a new tag to inject malicious code after initial validation? (High)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Enum: PackageLocation::Aptos] [Package verification bypass] When fetching packages from on-chain, is there cryptographic verification of the package contents? Could a compromised or malicious node serve modified packages? (Critical)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Enum: PackageLocation::Aptos] [Address confusion attack] If multiple versions of a package are deployed at different addresses, could an attacker trick users into depending on an old, vulnerable version by specifying that address? (High)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Enum: PackageLocation::Aptos] [Node URL trust] The node_url is trusted implicitly - what if it points to a fake Aptos node that serves malicious packages while appearing to have correct package_addr? (Critical)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Enum: PackageLocation::Aptos] [Network split attacks] If the node_url points to a node on a forked/minority chain, could packages be resolved differently than on the main chain, causing consensus issues? (High)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Struct: Version] [No Ord implementation] Version doesn't implement Ord - if dependency resolution needs to select 'latest' or 'compatible' versions, how is comparison done? Could missing ordering cause non-deterministic builds? (Medium)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Struct: Version] [Semantic versioning rules] The Version struct doesn't enforce semantic versioning rules (e.g., breaking changes in major version) - could this allow breaking changes in minor/patch versions that violate user expectations? (Low)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Field: Dependency.version] [Unused version constraint] The comment explicitly says version is unused - does this mean ANY version of a dependency is accepted? Could this lead to version compatibility issues or security vulnerabilities from outdated dependencies? (Medium)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Struct: PackageManifest] [Deep clone correctness] PackageManifest derives Clone - are all nested structures (BTreeMap, PathBuf, Url) correctly deep-cloned, or could there be aliasing issues where clones share mutable state? (Low)",
  "[File: third_party/move/tools/move-package-manifest/src/manifest.rs] [Struct: Dependency] [Clone in serialization] Dependency::to_raw() clones self - is this necessary? Could the clone be avoided by taking self by reference, and does the clone introduce any security issues? (Low)",
  "[File: third_party/move/tools/move-package-manifest/src/named_address.rs] [Function: is_valid_named_address()] [Single underscore] Is a named address consisting of only '_' valid? Could this conflict with the AddressAssignment::Unspecified marker? (Low)",
  "[File: third_party/move/tools/move-package-manifest/src/named_address.rs] [Function: is_valid_named_address()] [Reserved keywords] Does the validation check against Move reserved keywords? Could an attacker use keywords like 'module' or 'script' as named addresses to confuse the compiler? (Medium)",
  "[File: third_party/move/tools/move-package-manifest/src/package_name.rs] [Function: is_valid_package_name()] [Leading hyphen] The validation requires starting with letter or underscore, but are leading hyphens rejected? Could '-malicious-package' be valid? (Low)"
]