[
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: file_store_config] [GCS versioning] If GCS object versioning is enabled on the bucket, can repeated uploads of the same transaction batch create multiple object versions that consume excessive storage and complicate recovery procedures? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: file_store_config] [Filesystem permissions] When using LocalFileStore, can incorrect filesystem permissions on local_file_store_path allow unauthorized processes to read transaction data or corrupt uploaded files? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: file_store_config] [Disk space exhaustion] Can the LocalFileStore variant exhaust available disk space if transaction volume is high and no cleanup mechanism exists, causing the processor to crash when write operations fail? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: file_store_config] [Symlink attacks] Can an attacker create symlinks in the local_file_store_path that redirect file writes to unintended locations, causing transaction data to overwrite critical system files? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: file_store_config] [Key rotation] When gcs_file_store_service_account_key_path points to a service account key file, can key rotation events cause authentication failures mid-operation, interrupting transaction uploads and requiring manual recovery? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: file_store_config] [Key file tampering] Can an attacker with filesystem access modify the service account key file at gcs_file_store_service_account_key_path to inject their own credentials, causing transaction data to be uploaded to attacker-controlled buckets? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Version drift] Can clock skew or network partitions between Redis and file store backends cause version number drift, where the processor believes it has uploaded transactions that never made it to persistent storage? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Metadata lag] If file store metadata updates are slow or delayed, can the processor get ahead and upload new batches before previous metadata commits complete, causing version tracking to become inconsistent? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: enable_cache_compression] [Compression performance] When enable_cache_compression is true, can maliciously crafted transactions that are incompressible cause excessive CPU usage during compression attempts, degrading processor performance and causing upload delays? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: enable_cache_compression] [Decompression CPU] Can extremely large compressed transaction batches cause decompression to consume excessive CPU time, creating a bottleneck that slows down the entire file store archival pipeline? (Low)"
]