[
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/shared/builtins.rs] [Static: BUILTIN_TYPE_NAMES] [Upgrade incompatibility] When new integer types (u16, u32, u256) were added to the builtin list, was there proper migration logic, or could old contracts using these names as custom types now conflict with builtins? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/shared/builtins.rs] [Module: builtins] [Compiler sync] Is this file synchronized with the actual VM's native function implementations, or could mismatches cause the compiler to accept builtins that don't exist in the VM? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/shared/builtins.rs] [Static: BUILTIN_FUNCTION_NAMES] [Freeze semantics] Is the 'freeze' builtin properly validated to only convert &mut T to &T, or could incorrect compiler handling allow freezing arbitrary values and bypassing mutability restrictions? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/shared/builtins.rs] [Static: BUILTIN_FUNCTION_NAMES] [Freeze bypass] Can attackers chain multiple freeze operations to bypass reference tracking, allowing them to hold both mutable and immutable references to the same resource simultaneously? (Critical)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/shared/builtins.rs] [Static: BUILTIN_FUNCTION_NAMES] [Assert miscompilation] Is the 'assert' builtin always compiled to abort on false conditions, or could optimization passes remove assertions believing them to be side-effect-free? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/shared/builtins.rs] [Static: BUILTIN_FUNCTION_NAMES] [Assert error codes] Does the assert builtin properly propagate error codes to the VM, or could error information loss mask critical security failures in transaction validation? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/shared/builtins.rs] [Static: BUILTIN_FUNCTION_NAMES] [Borrow_global aliasing] Do borrow_global and borrow_global_mut properly check for aliasing violations, or could attackers obtain multiple mutable borrows to the same global resource within a single transaction? (Critical)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/shared/builtins.rs] [Static: BUILTIN_FUNCTION_NAMES] [Borrow lifetime] Is borrow_global's lifetime properly tracked by the compiler, or could dangling references survive beyond resource deallocation causing use-after-free vulnerabilities? (Critical)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/shared/builtins.rs] [Static: BUILTIN_FUNCTION_NAMES] [Borrow type safety] Can borrow_global be called with incorrect type parameters that bypass type checks, allowing access to resources with wrong type interpretations? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/shared/builtins.rs] [Static: BUILTIN_FUNCTION_NAMES] [Vector operations] Are vector manipulation functions (push_back, pop_back, length, borrow, etc.) missing from builtins, and could this cause gas metering inconsistencies for vector operations? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/shared/builtins.rs] [Static: BUILTIN_FUNCTION_NAMES] [Table operations] Are table/smart_table builtins missing, potentially causing Aptos-specific data structures to be miscompiled or bypass optimization passes? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/shared/builtins.rs] [Static: BUILTIN_FUNCTION_NAMES] [Event emission] Is 'event::emit' or similar event-emitting functions missing from builtins, potentially causing events to bypass validation or gas accounting? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/shared/builtins.rs] [Static: BUILTIN_FUNCTION_NAMES] [Timestamp functions] Are native timing functions for transaction ordering missing, which could affect MEV protection or timestamp-dependent logic? (Low)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/shared/builtins.rs] [Static: BUILTIN_FUNCTION_NAMES] [String validation] Are string literal builtins properly defined, or could invalid UTF-8 strings bypass compiler validation and cause crashes when processed by the VM? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/shared/builtins.rs] [Function: all_function_names()] [String injection] Could attacker-controlled strings be compared against builtin function names without proper sanitization, leading to injection attacks in error messages or logs? (Low)"
]