[
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: TypeSafety::InvalidNativeUsage] [Native function abuse] InvalidNativeUsage is BlockingError. Can native functions (implemented in Rust) be called from invalid contexts, bypassing Move's safety checks and directly manipulating VM state? (Critical)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: TypeSafety::TooFewArguments] [Undefined behavior] TooFewArguments is BlockingError. Does this prevent all cases where missing function arguments could leave stack values uninitialized, causing use of attacker-controlled stack data? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: TypeSafety::TooManyArguments] [Stack overflow] TooManyArguments is NonblockingError. Can excess function arguments overflow the Move VM stack, causing crashes or memory corruption during transaction execution? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: TypeSafety::CyclicData] [Infinite memory allocation] CyclicData is NonblockingError. Can cyclic struct definitions cause the VM to allocate infinite memory when instantiating types, enabling DoS through resource exhaustion? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: TypeSafety::CyclicInstantiation] [Generic recursion DoS] CyclicInstantiation is NonblockingError. Can cyclic generic instantiations (like Struct<Struct<Struct<...>>>) cause compiler or VM hangs through infinite type expansion? (Low)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: TypeSafety::MissingAcquires] [Reentrancy vulnerability] MissingAcquires is NonblockingError. Can functions that access global storage omit acquires annotations, bypassing Move's borrow checker and enabling reentrancy attacks through hidden global access? (Critical)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: TypeSafety::InvalidNum] [Integer type confusion] InvalidNum is NonblockingError. After type inference, can numeric literals be assigned to wrong integer types (u8 vs u256), causing overflow or underflow in arithmetic operations? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: TypeSafety::NonInvocablePublicScript] [Forward compatibility break] NonInvocablePublicScript is Warning with a note that it 'may become an error in the future'. Can scripts with non-invocable signatures be deployed now but become permanently unusable after a future breaking change, locking funds or critical functionality? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: TypeSafety::InvalidCallTarget] [Indirect call exploit] InvalidCallTarget is BlockingError. Can function pointers or lambdas be used to call non-callable expressions, potentially invoking attacker-controlled code addresses? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: TypeSafety::InvalidFunctionType] [First-class function abuse] InvalidFunctionType is BlockingError. Can function types be used in contexts where they shouldn't (stored in structs, passed to non-inline functions), breaking Move's restriction on higher-order functions? (Medium)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: AbilitySafety::Constraint] [Ability bypass] Constraint is NonblockingError. Can types lacking required abilities (copy, drop, store, key) be used in contexts requiring those abilities, breaking resource safety and enabling double-spending? (Critical)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: AbilitySafety::ImplicitlyCopyable] [Resource copying exploit] ImplicitlyCopyable is NonblockingError. Can non-copyable resources be implicitly copied through tuple expansion, pattern matching, or function returns, enabling double-spending of digital assets? (Critical)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: MoveSafety::UnusedUndroppable] [Resource leak] UnusedUndroppable is NonblockingError. Can values without the 'drop' ability be left unused without proper handling, causing resource leaks or locking funds permanently? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: MoveSafety::UnassignedVariable] [Uninitialized memory] UnassignedVariable is NonblockingError. Can uninitialized variables be read before assignment, exposing uninitialized stack memory containing attacker-controlled data from previous transactions? (High)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: ReferenceSafety::RefTrans] [Referential transparency violation] RefTrans is BlockingError. Can references be used in ways that violate referential transparency (like returning references to stack variables), creating dangling pointers? (Critical)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: ReferenceSafety::MutOwns] [Mutable aliasing] MutOwns is NonblockingError. Can multiple mutable references to the same value exist simultaneously, allowing aliased mutation and violating Rust-style borrow checking? (Critical)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: ReferenceSafety::Dangling] [Dangling reference exploit] Dangling is NonblockingError. Can operations create references that outlive their referents, causing use-after-free bugs when dereferenced in later bytecode instructions? (Critical)",
  "[File: third_party/move/move-compiler-v2/legacy-move-compiler/src/diagnostics/codes.rs] [Category: ReferenceSafety::InvalidReturn] [Local borrow escape] InvalidReturn is NonblockingError. Can functions return references to local variables or temporary values that are destroyed on return, creating dangling references in the caller? (Critical)"
]