[
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: set_loc_from_node()] [Type confusion] Can an attacker provide a malicious NodeId that references a non-existent or invalid location, causing the verification system to associate expressions with incorrect source locations and potentially mask verification errors? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: new_node()] [Type safety violation] Does new_node() validate that the provided Type and Optional<Vec<Type>> instantiation are compatible, or can mismatched type instantiations create nodes with inconsistent type information that bypass Move's resource safety checks during verification? (High)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: new_node()] [Integer overflow] Can rapid repeated calls to new_node() cause NodeId allocation to overflow, potentially creating NodeId collisions that associate multiple expressions with the same node, corrupting the expression tree and verification results? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: new_node()] [Memory exhaustion] Is there any limit on the number of nodes that can be created, or can an attacker craft Move specifications that generate unbounded node allocations, causing DoS of the verification system through memory exhaustion? (Low)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: new_node()] [Type instantiation mismatch] If inst_opt contains type parameters that don't match the Type's expected instantiation arity, can this create unsound type instantiations that allow verification to pass for code that violates Move's generic type constraints? (High)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: set_loc()] [Location spoofing] Can malicious specifications manipulate location data through set_loc() to associate verification errors with incorrect source locations, hiding critical bugs by making them appear to originate from unrelated code sections? (Low)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: get_current_loc()] [Race condition] In concurrent verification scenarios, can race conditions in get_current_loc() cause expressions to be tagged with wrong locations if the location state changes between getting and using it? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: new_temp()] [Temporary index collision] Does new_temp() properly prevent TempIndex collisions, or can multiple temporaries be assigned the same index, causing verification to incorrectly assume variables are equivalent when they're distinct? (High)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: add_local()] [Type pollution] Can add_local() be called with invalid or malformed Types that poison the local variable type map, causing subsequent get_local_type() calls to return incorrect types and bypass type checking? (High)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: get_local_type()] [Undefined behavior] What happens if get_local_type() is called with a TempIndex that was never added via add_local(), and can this cause panics or return uninitialized type data that corrupts verification? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: mk_bool_const()] [Type invariant violation] Does mk_bool_const() always create expressions with BOOL_TYPE, or can the node creation fail to properly set the type, creating boolean expressions with non-boolean types that break verification soundness? (High)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: mk_address_const()] [Address validation bypass] Does mk_address_const() validate that AccountAddress values are well-formed, or can malformed addresses be embedded in expressions, allowing verification to pass for code that would fail at runtime? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: mk_not()] [Double negation] Can nested mk_not() calls create deeply nested negation chains that cause exponential blowup in the SMT solver, leading to verification timeouts that allow unverified code to deploy? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: mk_eq()] [Type mismatch] Does mk_eq() validate that arg1 and arg2 have compatible types before creating the equality expression, or can incomparable types be compared, creating unsound verification conditions? (High)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: mk_identical()] [Semantic confusion] Can the distinction between mk_identical() and mk_eq() be exploited where identical equality is used instead of semantic equality, allowing proofs to pass that wouldn't hold under semantic equality semantics? (High)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: mk_identical()] [Reference equality exploit] Does mk_identical() properly handle resource types where identity vs. value equality matters for Move's linear type system, or can this allow duplication of resources that should be unique? (Critical)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: mk_and()] [Short-circuit bypass] Does the generated And operation properly model short-circuit evaluation, or can side effects in arg2 be incorrectly verified as always executing even when arg1 is false? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: mk_or()] [Type coercion] Are the arguments to mk_or() validated to be boolean types, or can non-boolean expressions be combined with Or, creating type-unsafe conditions that bypass verification? (High)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: mk_implies()] [Vacuous truth exploit] Can an attacker craft specifications where mk_implies() is used with a false antecedent, making all properties vacuously true and allowing any code to verify regardless of correctness? (High)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: mk_iff()] [Circular reasoning] Can mk_iff() be used to create circular equivalences (A iff B, B iff A) that cause the SMT solver to accept tautologies as proofs of complex properties? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: mk_builtin_num_const()] [Numeric type confusion] Does mk_builtin_num_const() validate that only the allowed max operations are used (MaxU8-MaxU256), or can invalid operations be passed that return incorrect numeric bounds and bypass overflow checks? (High)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: mk_builtin_num_const()] [Integer bound exploit] Can mk_builtin_num_const() be tricked into returning max values for the wrong integer width, causing verification to check u64 overflow conditions when code actually uses u128, missing real overflows? (Critical)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: mk_builtin_num_const()] [Assert bypass] The assert! at lines 145-152 checks for valid operations, but can panic bypass be exploited in release builds where asserts are removed, allowing arbitrary operations to be treated as numeric constants? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: mk_call()] [Type mismatch in call] Does mk_call() validate that the Operation and args match expected signatures, or can mismatched arguments be passed that create ill-typed expressions bypassing verification? (High)",
  "[File: aptos-core/third_party/move/move-model/src/exp_generator.rs] [Function: mk_call_with_inst()] [Instantiation arity] Does mk_call_with_inst() check that the inst vector length matches the operation's expected type parameter count, or can under/over-instantiation create unsound generic calls? (High)"
]