[
  "[File: aptos-core/storage/backup/backup-cli/src/storage/command_adapter/mod.rs] [Process Management] [Resource Limit Bypass] Do child processes inherit resource limits (ulimits) from the parent, or can they bypass these limits to consume excessive resources? (Medium)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/command_adapter/mod.rs] [Process Management] [Stderr Handling] Child stderr is set to inherit - can malicious commands output sensitive information to stderr that gets logged, leaking secrets? (Medium)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/command_adapter/mod.rs] [Attack Scenario] [Backup Replacement] Can an attacker with filesystem access replace legitimate backup files with malicious ones, then use open_for_read to inject corrupted state during restoration? (Critical)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/command_adapter/mod.rs] [Attack Scenario] [Symlink to Sensitive Files] Can an attacker create symlinks in the backup directory pointing to sensitive files like /etc/shadow or validator keys, then use file handles to read them? (Critical)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/command_adapter/mod.rs] [Attack Scenario] [Backup Deletion DoS] Can an attacker modify commands via config to delete backups instead of creating them, causing permanent loss of backup data and inability to recover from failures? (Critical)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/command_adapter/mod.rs] [Attack Scenario] [Time-Delayed Attack] Can an attacker inject malicious code into backup commands that activates at a future time (e.g., when block height reaches X) to compromise the network when backups are restored? (Critical)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/command_adapter/mod.rs] [Attack Scenario] [Storage Backend Pivot] If the backup storage backend is compromised (S3, GCS), can attackers modify commands to exfiltrate backup data or inject malicious data during backup/restore operations? (Critical)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/command_adapter/mod.rs] [Data Integrity] [Checksum Validation] Are checksums or cryptographic signatures verified on backup data read via open_for_read to detect tampering, or can modified backups be silently restored? (Critical)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/command_adapter/mod.rs] [Data Integrity] [Atomic Operations] Are backup operations atomic, or can partial failures leave incomplete backups that appear valid but are actually corrupted? (High)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/command_adapter/mod.rs] [Data Integrity] [Version Mismatch] Can backups created with one version of CommandAdapter be incompatible with another version, causing restoration failures or data corruption? (Medium)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/command_adapter/mod.rs] [Data Integrity] [Compression Bomb] If backup commands include compression, can attackers inject compression bombs that expand to massive sizes when decompressed during restoration? (High)",
  "[File: aptos-core/storage/backup/backup-cli/src/storage/command_adapter/mod.rs] [Command Injection] [Glob Pattern Injection] Can file names or handles containing glob patterns (*, ?, []) cause unintended file expansion in bash commands leading to unauthorized access? (High)"
]