[
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Struct: CoinInfo] [Hash Collision] Can an attacker craft two different coin types that produce the same SHA256 hash in coin_type_hash, causing database primary key conflicts that overwrite legitimate coin metadata with malicious data? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Field: coin_type_hash] [Data Integrity] If SHA256 hash collisions occur (theoretically possible with sufficient resources), would the database constraint on coin_type_hash silently drop legitimate coin info records, causing data loss for valid tokens? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Field: coin_type] [String Truncation] The coin_type field is truncated to 5000 characters - can an attacker create coins with nearly identical prefixes (first 5000 chars) to confuse users or cause display issues in indexer APIs, enabling phishing attacks? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Field: coin_type] [Injection Attack] Does the coin_type string undergo proper sanitization before database insertion, or can malicious Move type strings containing SQL injection patterns, null bytes, or control characters corrupt the PostgreSQL database? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Field: name] [String Truncation] The name field is truncated to 32 characters via get_name_trunc() - can attackers create multiple coins with identical 32-char prefixes to cause confusion and enable token impersonation in wallet UIs querying the indexer? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Field: symbol] [String Truncation] The symbol field is truncated to 10 characters - can an attacker register coins with common symbol prefixes (e.g., 'USDC12345' and 'USDC67890' both become 'USDC123456' or similar) to impersonate well-known tokens in indexer query results? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Field: decimals] [Integer Validation] The decimals field is stored as i32 - can negative decimal values from malicious Move contracts cause integer underflow, display errors, or calculation bugs in downstream indexer APIs that compute token amounts? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Field: decimals] [Range Validation] Is there validation that decimals is within reasonable bounds (e.g., 0-18)? Can extremely large decimal values (e.g., i32::MAX = 2147483647) cause integer overflow when calculating display amounts in indexer query APIs? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Field: transaction_version_created] [Ordering Attack] Can an attacker exploit race conditions during concurrent indexing to insert a coin info with a future transaction_version_created, causing the indexer to reject legitimate earlier coin registrations? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Field: creator_address] [Address Validation] Is the creator_address properly validated and standardized to 66 characters (0x + 64 hex)? Can non-standard address formats cause database constraint violations or query inconsistencies? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Function: from_write_resource()] [Type Confusion] Can an attacker submit write resources with malformed generic_type_params that don't match CoinInfo structure, causing from_move_type() to panic or return incorrect coin_type_hash that overwrites unrelated coin data? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_infos.rs] [Function: from_write_resource()] [Array Index Panic] Line 58 accesses generic_type_params[0] without bounds checking - can a WriteResource with empty generic_type_params array cause an index out of bounds panic that crashes the indexer processor? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Function: from_write_resource()] [Resource Type Mismatch] If CoinResource::from_write_resource() returns Some(CoinResource::CoinStoreResource) instead of CoinInfoResource due to type confusion, will the pattern match at line 56 silently return Ok(None) and skip indexing legitimate coin info? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Function: from_write_resource()] [Error Propagation] If CoinInfoType::from_move_type() returns an error due to malformed type data, does the ? operator properly propagate the error, or can error handling allow partial coin info with corrupted coin_type_hash to be inserted? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Function: from_write_resource()] [Timestamp Validation] The txn_timestamp parameter is passed as chrono::NaiveDateTime without validation - can timestamps far in the future or past (e.g., year 9999 or year 0) cause database constraint violations or sorting issues? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Function: from_write_resource()] [Option Handling] Lines 61-64 use get_aggregator_metadata().map() with unwrap_or() - can None values in the aggregator chain cause unexpected behavior if the database expects specific null patterns for supply tracking? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Function: from_write_resource()] [Clone Operations] Line 70 clones creator_address from CoinInfoType - can this introduce race conditions if the same CoinInfoType is used across threads during concurrent indexing of the same transaction? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Function: from_write_resource()] [Match Exhaustiveness] The match statement at line 55 only handles CoinInfoResource - are there other CoinResource variants that should be handled, or can future additions to CoinResource enum cause silent data loss? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Function: get_by_coin_type()] [SQL Injection] Does the coin_type parameter undergo proper escaping before being passed to diesel's eq() filter, or can specially crafted coin type strings inject SQL fragments that bypass query constraints? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Function: get_by_coin_type()] [Case Sensitivity] Is the coin_type comparison case-sensitive? Can attackers register coins with different casing (e.g., '0x1::Aptos::COIN' vs '0x1::aptos::coin') to bypass uniqueness checks and create multiple database entries? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Function: get_by_coin_type()] [Null Byte Injection] Can coin_type strings containing null bytes (\\\\0) cause the PostgreSQL TEXT column to truncate early, making queries return wrong results or match unintended coin types? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Function: get_by_coin_type()] [Performance DoS] Can an attacker repeatedly query with extremely long coin_type strings (up to 5000 chars) to cause excessive database CPU usage and slow down the indexer API for all users? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Function: get_by_coin_type()] [Connection Exhaustion] Does this function hold the database connection for the entire query duration? Can slow queries from complex coin types cause connection pool exhaustion, making the indexer unavailable? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Function: get_by_coin_type()] [Error Handling] The function returns diesel::QueryResult<Option<Self>> - can database errors (connection lost, table locked) be distinguished from legitimate",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Schema: coin_infos table] [Primary Key Conflict] The upsert logic in coin_processor.rs updates on conflict with coin_type_hash - can an attacker cause a legitimate coin to be repeatedly overwritten by registering the same coin type in later transactions with manipulated metadata? (Medium)"
]