[
  "[File: aptos-core/dkg/src/network.rs] [Function: to_bytes_by_protocol()] [Protocol downgrade] The function selects protocol per peer - can an attacker force all peers to use the weakest protocol (Json) instead of Compressed to enable easier message manipulation? (Medium)",
  "[File: aptos-core/dkg/src/network.rs] [Function: to_bytes_by_protocol()] [Error propagation] Line 118 uses anyhow::Result - if serialization fails for one peer, does it fail for all? Can this be exploited to prevent reliable broadcast by targeting specific validators? (High)",
  "[File: aptos-core/dkg/src/network.rs] [Function: sort_peers_by_latency()] [Timing side channel] Can an attacker observe the sorted peer order (line 122) to infer network topology or validator performance, enabling targeted attacks on the slowest validators? (Low)",
  "[File: aptos-core/dkg/src/network.rs] [Function: sort_peers_by_latency()] [Slice mutation] sort_peers_by_latency() mutates the slice in-place - can concurrent calls cause data races if multiple threads sort the same peer list during DKG? (High)",
  "[File: aptos-core/dkg/src/network.rs] [Function: sort_peers_by_latency()] [Determinism violation] If peer ordering affects DKG transcript aggregation order, can non-deterministic latency measurements cause validators to process transcripts in different orders and compute different DKG outputs? (Critical)",
  "[File: aptos-core/dkg/src/network.rs] [Struct: NetworkReceivers] [Channel capacity] The rpc_rx channel is created with QueueStyle::FIFO and capacity 10 (line 141) - can an attacker flood 11+ RPC requests to cause channel overflow and drop legitimate DKG messages? (High)",
  "[File: aptos-core/dkg/src/network.rs] [Struct: NetworkReceivers] [Ordering guarantee] FIFO queue style means messages are processed in order - can an attacker exploit this by sending a malicious message that blocks processing, preventing all subsequent legitimate DKG requests from being handled? (Critical)",
  "[File: aptos-core/dkg/src/network.rs] [Struct: NetworkReceivers] [Key collision] The rpc_rx uses AccountAddress as the key - can an attacker send multiple requests with the same sender address to cause key collisions and override pending requests? (High)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::new()] [Panic vulnerability] Lines 144-148 panic if network setup is incorrect - can an attacker manipulate network_service_events to trigger this panic during validator startup and prevent DKG from initializing? (Critical)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::new()] [Network isolation bypass] The check at line 145 requires NetworkId::Validator - but can an attacker inject events from other network IDs to bypass this check and mix DKG messages with public network traffic? (High)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::new()] [Stream merging race] Lines 150-153 merge multiple event streams using select_all() and select() - can race conditions during concurrent stream events cause messages to be dropped or processed out of order? (High)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::new()] [Self-receiver priority] The self_receiver is merged with network_events using select() - does this give equal priority, or can network flooding starve self-messages and prevent the validator from processing its own DKG transcripts? (Medium)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::new()] [Channel capacity mismatch] rpc_tx is created with capacity 10 but all_events is unbounded - can this cause back-pressure issues where events accumulate in all_events but can't be pushed to rpc_tx? (High)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::new()] [Event stream exhaustion] If network_and_events returns an empty iterator or single network fails, does the select_all() handle this gracefully or cause the entire DKG network task to stall? (High)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::start()] [Infinite loop DOS] The loop at line 161 runs indefinitely with await on all_events.next() - can an attacker cause all_events stream to hang indefinitely without yielding, freezing the entire DKG network task? (Critical)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::start()] [Event type confusion] Line 163 matches on Event::RpcRequest but ignores all other variants (line 177) - can an attacker send non-RPC events that should be processed but are silently dropped, causing DKG message loss? (Medium)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::start()] [Sender validation gap] Line 163 extracts peer_id but doesn't validate it against the validator set - can non-validators send RPC requests that get processed as if they came from legitimate validators? (Critical)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::start()] [Response sender wrapping] Lines 167-170 wrap the response_sender in RealRpcResponseSender - can type confusion occur if the underlying sender is already wrapped or has incompatible protocol? (Medium)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::start()] [Channel push failure] Line 173 pushes to rpc_tx with error logging only (line 174) - if push fails due to capacity, is the DKG message permanently lost or does it have retry logic? (High)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::start()] [Key usage in push] rpc_tx.push uses peer_id as key twice (peer_id, (peer_id, req)) - can this cause issues with the channel's internal key management or allow key-based attacks? (Medium)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::start()] [Protocol mismatch] The protocol variable (line 163) is passed to RealRpcResponseSender (line 169) - can protocol version mismatches between request and response cause deserialization failures? (High)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::start()] [Graceful shutdown] There's no explicit shutdown logic - when the stream ends, does the task properly clean up resources or can it leave dangling channels and memory leaks? (Low)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::start()] [Error suppression] Line 174 only logs errors but continues processing - can repeated errors accumulate and hide critical failures in DKG message delivery? (Medium)",
  "[File: aptos-core/dkg/src/network.rs] [Function: NetworkTask::start()] [Stream termination] What happens when all_events.next() returns None? Does the task exit cleanly or can it cause the validator to stop processing DKG messages entirely? (High)",
  "[File: aptos-core/dkg/src/network.rs] [Struct: RealRpcResponseSender] [Double send] The inner sender is Option<oneshot::Sender> (line 190) - can an attacker call send() twice, causing panic on the second unwrap() at line 208 and crashing the validator? (High)"
]