[
  "[File: config/src/config/internal_indexer_db_config.rs] [Struct: InternalIndexerDBConfig] [Deserialization attack] Can an attacker craft a malicious YAML/TOML config file with extremely large boolean values or non-boolean types that bypass serde's deny_unknown_fields validation, causing panic or memory corruption during deserialization? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Struct: InternalIndexerDBConfig] [Type confusion] Does the serde deserializer properly validate that enable_transaction, enable_event, enable_statekeys, and enable_event_v2_translation are strictly booleans, or can string values like 'true' or integers 0/1 cause type confusion leading to incorrect feature enablement? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Struct: InternalIndexerDBConfig] [Integer overflow] Can an attacker set event_v2_translation_ignores_below_version to u64::MAX in the config file, causing integer overflow when this value is used in version comparison logic (e.g., version + 1) leading to incorrect event indexing or skipped security checks? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Struct: InternalIndexerDBConfig] [Memory exhaustion] Can an attacker configure batch_size to usize::MAX or an extremely large value (e.g., billions), causing memory allocation failures or OOM panics when DBIndexer attempts to allocate buffers of this size during transaction processing? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Attribute: deny_unknown_fields] [Config bypass] If an attacker adds unknown fields to the config file, will serde's deny_unknown_fields properly reject the config, or could there be edge cases where extra fields are silently ignored, allowing hidden configuration options to be injected? (Low)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: new()] [Unchecked parameters] Does the new() constructor validate that batch_size is within reasonable bounds (e.g., > 0 and < 1_000_000), or can it accept 0 causing division-by-zero errors, or extremely large values causing memory exhaustion in downstream processing? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: new()] [Invalid feature combination] Can new() be called with enable_event_v2_translation=true but enable_event=false, creating an invalid configuration that violates the dependency check enforced in sanitize() but bypasses validation if new() is called directly? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: new()] [Version threshold logic] If event_v2_translation_ignores_below_version is set to a value greater than the current chain version, will this cause all v2 events to be ignored indefinitely, effectively disabling event v2 translation and causing API data loss? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: new()] [Zero batch size] Can batch_size be set to 0 in new(), causing infinite loops or division-by-zero panics in DBIndexer::get_num_of_transactions() when calculating min(batch_size, ...) or during batch processing iterations? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: default()] [Insecure defaults] Are the default values (all features disabled, batch_size 10_000) secure for production use, or do they create a misconfiguration where critical indexer features are unexpectedly disabled, causing API endpoints to fail or return incomplete data? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: default()] [Default batch size] Is the default batch_size of 10_000 appropriate for all node types (validator vs fullnode vs archival), or could this cause performance degradation or memory pressure on resource-constrained nodes? (Low)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: default()] [Feature flag defaults] With all indexer features disabled by default, can this lead to nodes starting without realizing the internal indexer is non-functional, causing silent API failures that only manifest when account-based queries are attempted? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: default()] [Version threshold default] Is event_v2_translation_ignores_below_version=0 a safe default, or should it be set to the genesis version to avoid attempting to translate non-existent pre-genesis events? (Low)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: enable_transaction()] [TOCTOU race] If multiple threads call enable_transaction() concurrently while another thread is updating the config, can a TOCTOU race condition occur where feature enablement state is read inconsistently, leading to partial indexing or data corruption? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: enable_event()] [Inconsistent state] If enable_event() returns true but the underlying DB is not initialized or storage sharding is disabled, will DBIndexer operations panic or silently fail, causing data loss or service degradation? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: enable_event_v2_translation()] [Dependency violation] Can enable_event_v2_translation() return true while enable_event() returns false, violating the dependency enforced in sanitize() if the config was modified after sanitization or created via new() directly? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: event_v2_translation_ignores_below_version()] [Version manipulation] Can an attacker modify this value at runtime (if config is mutable) to skip indexing recent v2 events, causing data gaps in the event indexer and breaking event-based APIs? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: enable_statekeys()] [State corruption] If enable_statekeys() is toggled from true to false after partial indexing, will existing state key indexes become stale or corrupted, leading to incorrect account resource queries? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: batch_size()] [Unchecked return] Does batch_size() return the raw usize value without bounds checking, allowing callers to use potentially dangerous values (0, usize::MAX) that could cause panics or integer overflow in arithmetic operations? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: is_internal_indexer_db_enabled()] [Logic error] Does the OR logic (enable_transaction || enable_event || enable_statekeys) correctly represent when the indexer should be enabled, or should it also check enable_event_v2_translation since that feature also writes to the indexer DB? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: is_internal_indexer_db_enabled()] [Incomplete check] If enable_event_v2_translation is true but all other flags are false, will is_internal_indexer_db_enabled() return false even though the indexer DB is needed for v2 translation, causing initialization to be skipped and panics when translation is attempted? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: is_internal_indexer_db_enabled()] [Storage initialization] If is_internal_indexer_db_enabled() returns false but the node config has storage sharding enabled, will this create an inconsistent state where sharded storage exists but the indexer is not initialized? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: is_internal_indexer_db_enabled()] [Race condition] Can is_internal_indexer_db_enabled() be called during node initialization before sanitize() runs, allowing an invalid configuration to pass through and cause runtime panics? (Medium)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: sanitize()] [Validation bypass] Can sanitize() be skipped entirely if NodeConfig is constructed programmatically rather than loaded from file, allowing invalid configurations (indexer enabled without storage sharding) to reach production? (High)",
  "[File: config/src/config/internal_indexer_db_config.rs] [Function: sanitize()] [TOCTOU vulnerability] After sanitize() validates the config, can the config be modified before it's used (e.g., if NodeConfig is mutable), allowing the storage sharding check to be bypassed and causing DB corruption? (High)"
]