[
  "[File: config/src/config/state_sync_config.rs] [Field: max_pending_mempool_notifications] [Mempool DoS] Can an attacker flood exactly 100 pending mempool notifications to block new transactions from being committed, effectively halting transaction processing? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_stream_wait_time_ms] [Timeout Exploitation] Can an attacker time responses to arrive just after the 5000ms stream wait timeout, causing legitimate data to be discarded and forcing retransmissions? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: num_versions_to_skip_snapshot_sync] [Snapshot Bypass] Can the 400M version threshold for snapshot syncing be exploited to force nodes that fall behind by 24+ hours to full sync, making them permanently unable to catch up? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: enable_size_and_time_aware_chunking] [Chunking Inconsistency] Can mixing nodes with and without size/time-aware chunking enabled cause chunk boundary disagreements leading to state sync failures? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: enable_transaction_data_v2] [Version Downgrade] Can an attacker force a node to accept v1 transaction data when v2 is enabled, bypassing enhanced validation or causing data corruption? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_invalid_requests_per_peer] [Peer Banning Bypass] Can an attacker rotate through 500 invalid requests per peer identity, then switch to a new identity, avoiding permanent bans while continuously sending invalid data? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_lru_cache_size] [Cache Poisoning] Can the LRU cache of 500 items be poisoned with malicious chunks that get repeatedly requested, causing validators to serve corrupted data to peers? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_network_channel_size] [Channel Overflow] Can an attacker flood the network channel with 4000 messages, causing legitimate state sync responses to be dropped and preventing synchronization? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_network_chunk_bytes] [Size Mismatch] Can mismatches between max_network_chunk_bytes (10 MiB) and max_network_chunk_bytes_v2 (40 MiB) be exploited to send oversized chunks that crash receiving nodes? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_num_active_subscriptions] [Subscription Exhaustion] Can an attacker create 30 active subscriptions per peer to exhaust subscription slots, preventing legitimate continuous sync subscriptions? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_optimistic_fetch_period_ms] [Prefetch Manipulation] Can the 5-second optimistic fetch period be exploited to cause nodes to prefetch and cache incorrect future states, wasting resources? (Low)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_storage_read_wait_time_ms] [Storage DoS] Can an attacker trigger storage reads that consistently take >10 seconds, causing responses to be truncated and incomplete state data to be sent? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_subscription_period_ms] [Subscription Timeout] Can an attacker manipulate subscription timing to cause subscriptions to timeout at exactly 30 seconds, forcing constant re-subscription overhead? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: min_time_to_ignore_peers_secs] [Peer Rotation] Can malicious peers exploit the 5-minute ignore period by cycling through peer identities faster than the ignore timeout, avoiding persistent blocking? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: request_moderator_refresh_interval_ms] [Rate Limit Bypass] Can an attacker time malicious requests to arrive just after the 1-second moderator refresh, bypassing rate limiting for that interval? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: storage_summary_refresh_interval_ms] [Summary Staleness] Can the 100ms storage summary refresh interval allow attackers to exploit stale storage information to request data that no longer exists or has changed? (Low)",
  "[File: config/src/config/state_sync_config.rs] [Field: enable_subscription_streaming] [Subscription DoS] When subscription streaming is disabled, can attackers exploit the polling fallback mechanism to cause excessive network overhead? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: global_summary_refresh_interval_ms] [Summary Race] Can the 50ms global summary refresh create race conditions where different streams see inconsistent global state, causing coordination failures? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_concurrent_requests (streaming)] [Request Amplification] Can the limit of 6 concurrent requests per stream be bypassed by creating multiple streams, amplifying total requests beyond system capacity? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_concurrent_state_requests] [State Request Flood] Can an attacker create multiple state streams each with 6 concurrent requests, overwhelming storage with state key/value queries? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_data_stream_channel_sizes] [Channel Deadlock] Can filling the 50-slot data stream channel cause deadlocks between data producers and consumers, halting synchronization? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_notification_id_mappings] [Notification Leak] Can an attacker generate notification IDs faster than garbage collection occurs at 300 mappings, causing unbounded memory growth? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_num_consecutive_subscriptions] [Subscription Churn] Can forcing exactly 45 consecutive subscriptions (designed for ~15 seconds at 3 blocks/sec) be exploited to trigger stream termination at predictable intervals? (Medium)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_pending_requests] [Head-of-Line Blocking] Can 50 pending requests with the first request blocked create head-of-line blocking that stalls all subsequent state sync progress? (High)",
  "[File: config/src/config/state_sync_config.rs] [Field: max_request_retry] [Retry Exhaustion] Can an attacker cause exactly 5 request failures to terminate the data stream, requiring complete stream recreation and losing progress? (Medium)"
]