[
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Field: average_ping_latency_secs] [Subnormal floats] Can attackers use denormalized floating-point numbers (subnormals) for latency values that appear as legitimate small latencies but cause performance degradation during arithmetic operations in peer comparison logic? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Field: latest_ping_latency_secs] [Latency forgery] Since there's no cryptographic proof of ping timing, can attackers completely fabricate both latest and average latencies without detection, making distance the only trusted metric? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Field: latest_node_info_response] [Epoch manipulation] Can attackers report inflated highest_synced_epoch values to appear more synced than they are, bypassing health checks that compare epochs rather than versions, potentially serving stale state with newer epoch numbers? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Field: latest_node_info_response] [Version rollback] Can malicious peers report decreasing highest_synced_version over time to trigger state rollback logic in clients that trust peer-reported versions, causing sync confusion and potential chain reorganization? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Field: latest_node_info_response] [Timestamp overflow] The ledger_timestamp_usecs is u64 microseconds - can attackers report timestamps far in the future (approaching u64::MAX) to cause integer overflow in timestamp comparison logic that calculates sync lag? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Field: latest_node_info_response] [Storage exhaustion] Can peers report lowest_available_version far below their actual pruning point to make clients believe they have full history, causing clients to request unavailable data and waste bandwidth on failed requests? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Field: latest_node_info_response] [Uptime manipulation] Can attackers report fake Duration uptime values (either very long to appear stable or very short to appear freshly restarted) to influence peer selection algorithms that factor in uptime for reliability scoring? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Field: latest_network_info_response] [Peer count inflation] Can malicious nodes report inflated connected_peers counts in NetworkInformationResponse to appear well-connected and improve their priority, even if those peer connections are to non-existent or attacker-controlled nodes? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Field: latest_network_info_response] [Validator set manipulation] If NetworkInformationResponse includes validator peers in connected_peers, can attackers falsely claim validator connections to inherit distance=0 status without actually being connected to validators? (Critical)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Attribute: forbid(unsafe_code)] [Unsafe dependencies] While this file forbids unsafe code, does it transitively depend on unsafe code in serde, BCS, or networking crates that could lead to memory corruption when deserializing malicious PeerMonitoringMetadata? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Type: Option<f64>] [Option unwrapping] In code that consumes PeerMonitoringMetadata, can incorrect Option unwrapping of average_ping_latency_secs or latest_ping_latency_secs cause panics that crash the node when processing metadata from newly connected peers? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Type: PeerMonitoringMetadata usage] [Non-atomic updates] Since PeerMonitoringMetadata fields are updated independently (ping, then network info, then node info), can partially updated metadata be read by peer selection logic, causing inconsistent prioritization where old distance is used with new latency? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Type: PeerMonitoringMetadata usage] [ABA problem] If metadata is updated from A to B to A while peer selection is reading it, can the peer selection logic observe the intermediate B state and make incorrect decisions based on transient metadata? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Type: PeerMonitoringServiceMessage] [Protocol evolution] If PeerMonitoringServiceRequest or PeerMonitoringServiceResponse enums gain new variants, can old nodes deserialize new messages with unknown variants into corrupted state or fail to detect protocol violations? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Type: PeerMonitoringServiceMessage] [Version negotiation] Is there any version negotiation for PeerMonitoringServiceMessage format? Can attackers downgrade protocol versions to exploit vulnerabilities in legacy message handling code? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Type alias: Result<T, E>] [Error swallowing] The custom Result type defaults to PeerMonitoringServiceError - can errors be accidentally ignored via ? operator when they should trigger peer disconnection or metadata invalidation? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Error: InternalError(String)] [Error correlation] Can attackers trigger specific InternalError patterns to fingerprint node configurations, software versions, or internal state, enabling targeted attacks against specific deployments? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Type: PeerMonitoringMetadata] [Impossible states] Can PeerMonitoringMetadata represent impossible states (e.g., distance=0 without being a validator, or latest latency without average latency) that violate protocol invariants and cause downstream crashes? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Type: PeerMonitoringMetadata] [Stale metadata] If a peer disconnects and reconnects, can old PeerMonitoringMetadata persist and be used for decisions about the new connection, causing incorrect peer prioritization based on historical rather than current state? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Type: PeerMonitoringServiceMessage] [Message amplification] Can an attacker send small Request messages that trigger large Response messages containing full NetworkInformationResponse with many connected peers, amplifying bandwidth consumption? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Type: PeerMonitoringMetadata] [Metadata churn] Can attackers continuously update their metadata with slightly different values to trigger constant peer reprioritization in mempool, consuming CPU and preventing stable transaction routing? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Struct: PeerMonitoringMetadata] [Contradictory metrics] Can peers report high-quality network info (low distance, many validator connections) combined with poor node info (very old ledger timestamp, low synced version) to pass some health checks while failing others, creating inconsistent peer selection across components? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Struct: PeerMonitoringMetadata] [Latency-distance mismatch] Can attackers report ultra-low latency with very high distance_from_validators, creating contradictory signals that confuse peer prioritization heuristics and cause suboptimal routing decisions? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Field: internal_client_state] [Memory exhaustion] Can an attacker provide a multi-gigabyte internal_client_state string that gets stored in memory as part of PeerMonitoringMetadata, consuming excessive heap space across many peer metadata instances? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Type: NetworkInformationResponse in latest_network_info_response] [Nested data amplification] Can the connected_peers BTreeMap in NetworkInformationResponse contain thousands of peer entries, causing each PeerMonitoringMetadata instance to consume megabytes and exhausting memory when multiplied across all network peers? (Medium)"
]