[
  "[File: aptos-core/storage/aptosdb/src/pruner/ledger_pruner/transaction_auxiliary_data_pruner.rs] [Function: prune()] [Policy violation] If the pruning policy specifies that auxiliary data should be retained for X days/versions, can bugs in the caller cause prune() to be invoked too early, violating retention guarantees? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/pruner/ledger_pruner/transaction_auxiliary_data_pruner.rs] [Function: new()] [Config override] Can runtime configuration changes override the metadata_progress parameter passed to new(), potentially causing pruning to restart from incorrect positions? (Low)",
  "[File: aptos-core/storage/aptosdb/src/pruner/ledger_pruner/transaction_auxiliary_data_pruner.rs] [Function: prune()] [Batch size] Does the code respect any configured batch size limits for deletion operations, or could a single prune() call violate resource limits imposed by the database or operating system? (Low)",
  "[File: aptos-core/storage/aptosdb/src/pruner/ledger_pruner/transaction_auxiliary_data_pruner.rs] [Function: prune()] [Rate limiting] Is there rate limiting on pruning operations to prevent resource exhaustion, or can rapid successive calls to prune() overwhelm the system? (Low)",
  "[File: aptos-core/storage/aptosdb/src/pruner/ledger_pruner/transaction_auxiliary_data_pruner.rs] [Function: prune()] [Emergency stop] Is there a mechanism to emergency-stop pruning if critical errors are detected, or would the pruner continue operating even after detecting data corruption? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/pruner/ledger_pruner/transaction_auxiliary_data_pruner.rs] [Function: prune()] [Version compatibility] During a rolling upgrade where validators run different Aptos versions, can differences in TransactionAuxiliaryDataPruner behavior cause pruning inconsistencies that affect consensus? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/pruner/ledger_pruner/transaction_auxiliary_data_pruner.rs] [Function: new()] [Migration path] When upgrading from an Aptos version without TransactionAuxiliaryDataPruner to one with it, how is the initial progress determined, and could incorrect initialization cause mass deletion of historical data? (High)",
  "[File: aptos-core/storage/aptosdb/src/pruner/ledger_pruner/transaction_auxiliary_data_pruner.rs] [Function: prune()] [Feature flag] Is TransactionAuxiliaryDataPruner behind a feature flag? If so, can toggling the flag on/off cause inconsistent pruning states or metadata corruption? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/pruner/ledger_pruner/transaction_auxiliary_data_pruner.rs] [Function: prune()] [Downgrade safety] If a validator downgrades to an older Aptos version that doesn't understand TransactionAuxiliaryDataPrunerProgress metadata, could this cause the old version to behave incorrectly? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/pruner/ledger_pruner/transaction_auxiliary_data_pruner.rs] [Function: new()] [Database format] If the database format for storing auxiliary data changes between versions, can the pruner correctly handle mixed-format data during migration, or could this cause deletion failures? (High)"
]