[
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Function: from_transaction()] [Database constraint] If parse_timestamp produces a timestamp before PostgreSQL's minimum (year 4713 BC) or after maximum (year 294276 AD), can this cause database insertion failures? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Struct: BlockMetadataTransaction] [Time ordering] If timestamps are not monotonically increasing across blocks, can this break assumptions in downstream systems that rely on timestamp ordering for consensus analysis? (Low)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Struct: BlockMetadataTransaction] [Foreign key violation] The schema has `CONSTRAINT fk_versions FOREIGN KEY (version) REFERENCES transactions (version)`. Can a race condition occur where from_transaction creates a BlockMetadataTransaction before the parent transaction is inserted, causing foreign key violations that crash the indexer? (High)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Struct: BlockMetadataTransaction] [Primary key collision] Version is the primary key and must be unique. Can concurrent indexer instances or re-indexing operations attempt to insert the same version twice, causing primary key violations that halt indexing? (High)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Struct: BlockMetadataTransaction] [Unique constraint violation] Block_height has a UNIQUE constraint. Can a consensus bug or malicious validator produce two blocks with the same block_height but different versions, causing unique constraint violations when indexing the second block? (Critical)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Function: from_transaction()] [Data inconsistency] If block_height in line 60 doesn't match the actual block height stored in the parent transaction, can this create inconsistencies where queries by block_height return incorrect block metadata? (High)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Struct: BlockMetadataTransaction] [Orphaned records] If the foreign key to transactions(version) is violated due to transaction deletion or pruning, can this leave orphaned block_metadata_transactions records that break referential integrity? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Function: from_transaction()] [Version mismatch] If txn_version at line 57 differs from the version in the referenced transaction record, can this cause foreign key lookups to fail and prevent proper transaction-to-block-metadata associations? (High)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Struct: BlockMetadataTransaction] [Cascade deletion] Does the foreign key constraint have ON DELETE CASCADE? If parent transactions are deleted, can this unexpectedly delete block metadata records needed for consensus validation? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Function: from_transaction()] [Epoch consistency] Can an attacker submit block metadata with epoch numbers that don't match the epoch of the referenced transaction version, creating epoch inconsistencies that break validator set queries and epoch-based analytics? (High)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Function: from_transaction()] [Round progression] Can non-monotonic round numbers in line 63 be inserted into the database (e.g., round decreases between blocks), violating consensus assumptions and enabling historical consensus data manipulation? (High)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Struct: BlockMetadataTransaction] [Block height gaps] Can an attacker skip block heights during indexing (e.g., index heights 100, 102, 104) creating gaps that break block height sequencing and fork detection algorithms? (High)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Function: from_transaction()] [Proposer verification] The proposer field at line 64 is not validated against the validator set. Can an attacker index block metadata with an invalid proposer address that never was a validator, corrupting proposer attribution and validator performance metrics? (High)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Function: from_transaction()] [Vote bitvector manipulation] Can the previous_block_votes_bitvec at line 66-67 be manipulated to show false voting patterns (e.g., indicating validators voted when they didn't), corrupting consensus participation tracking? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Function: from_transaction()] [Failed proposer indices] Can failed_proposer_indices at line 65 contain duplicate indices, negative indices (after u32->i32 conversions), or out-of-range indices that corrupt validator failure tracking? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Struct: BlockMetadataTransaction] [ID validation] The id field at line 26 is a String without validation. Can arbitrary or malicious IDs be inserted that don't correspond to actual block hashes, breaking block identification? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Function: from_transaction()] [ID collision] If txn.id.to_string() at line 61 produces duplicate IDs for different blocks (due to hash collisions or bugs), can this create ambiguity in block lookups? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Struct: BlockMetadataTransaction] [JSONB injection] The previous_block_votes_bitvec field is stored as jsonb. Can an attacker inject malicious JSON structures that exploit PostgreSQL JSONB parsing vulnerabilities or consume excessive storage? (High)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Struct: BlockMetadataTransaction] [JSONB injection] The failed_proposer_indices field is stored as jsonb. Can specially crafted JSON payloads cause PostgreSQL query performance degradation or trigger JSONB-related bugs? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Function: from_transaction()] [Type confusion] If failed_proposer_indices in line 65 is serialized as JSON, can type confusion attacks occur where the JSON structure doesn't match the expected Vec<u32> format, breaking downstream JSON parsing? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Function: from_transaction()] [Array size limits] Can failed_proposer_indices contain more elements than the total number of validators, indicating invalid data that should be rejected but gets stored in the database? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Function: from_transaction()] [Bitvector length] Can previous_block_votes_bitvec have a length that doesn't match the expected validator count, storing inconsistent vote data that breaks quorum calculations? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Struct: BlockMetadataTransaction] [JSON schema validation] Since JSONB fields lack schema validation, can arbitrary JSON structures be inserted that break indexer queries expecting specific array formats? (Low)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Function: from_transaction()] [Deeply nested JSON] Can an attacker provide vote or proposer data that serializes to deeply nested JSON exceeding PostgreSQL's nesting limits, causing insertion failures? (Low)",
  "[File: aptos-core/crates/indexer/src/models/block_metadata_transactions.rs] [Function: from_transaction()] [Race condition] Can multiple indexer instances call from_transaction() concurrently for the same transaction, causing race conditions where both attempt to insert the same version, resulting in primary key violations? (High)"
]