[
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: ObjectCore::get_owner_address()] [Address manipulation] Can an attacker craft malformed owner addresses that bypass standardize_address() validation, potentially causing incorrect ownership records in the indexer database leading to unauthorized token transfers appearing valid? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: ObjectWithMetadata::from_write_resource()] [Type confusion] Does the function properly validate that write_resource.data.typ matches expected ObjectCore structure before deserialization, or can an attacker submit resources with mismatched type strings that pass is_resource_supported() but fail during serde_json parsing causing panics? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: ObjectWithMetadata::from_write_resource()] [Deserialization bypass] Can malicious actors craft WriteResource data where serde_json::to_value() succeeds but contains invalid ObjectCore fields, allowing indexing of corrupted object metadata that could mislead downstream applications about token ownership? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: ObjectWithMetadata::from_write_resource()] [Error handling] If V2TokenResource::from_resource() returns Ok(None) for a supported type, does the function silently return Ok(None) without logging, potentially hiding indexing failures for valid on-chain objects? (Low)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Struct: ObjectCore] [Integer overflow] The guid_creation_num field is deserialized as BigDecimal from string - can an attacker provide extremely large numeric strings that cause memory exhaustion during BigDecimal allocation or arithmetic operations? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: ObjectWithMetadata::get_state_key_hash()] [Hash collision] Does state_key_hash standardization use cryptographically secure comparison, or can attackers craft addresses with different byte representations that collide after standardization, causing object identity confusion? (High)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Struct: ObjectCore] [Boolean bypass] The allow_ungated_transfer field controls transfer permissions - can this boolean be manipulated through malformed deserialization to allow unauthorized transfers of soul-bound tokens? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: Collection::get_creator_address()] [Address forgery] Can an attacker submit collection resources with creator addresses that appear valid after standardization but differ from on-chain reality, enabling fake collection attribution and potential NFT fraud? (High)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: Collection::get_uri_trunc()] [Truncation attack] Does URI truncation at URI_LENGTH preserve critical metadata, or can attackers craft URIs where truncation removes essential validation data (like domain names), causing the indexer to display incorrect metadata sources? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: Collection::get_name_trunc()] [Unicode exploitation] Can malicious collections use Unicode normalization attacks where truncate_str() at NAME_LENGTH cuts multi-byte characters incorrectly, causing database encoding errors or displaying offensive/misleading collection names? (Low)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Struct: Collection] [Description injection] The description field is publicly exposed without sanitization - can attackers inject malicious HTML/JavaScript that gets stored and later executed when indexer data is displayed in web interfaces? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: AptosCollection::from_write_resource()] [Placeholder abuse] The function uses placeholder values (0) for write_index and write_set_change_index in MoveResource::from_write_resource() - can this cause collision issues if multiple AptosCollection resources are processed in the same transaction? (Low)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: AptosCollection::from_write_resource()] [Type validation race] Does is_resource_supported() check occur atomically with from_resource() parsing, or can a TOCTOU race allow unsupported resources to bypass validation if resource types change between checks? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: AptosCollection::from_write_resource()] [Unwrap panic] The code calls resource.data.as_ref().unwrap() - can malformed WriteResource cause MoveResource to have None data, triggering unwrap() panics that crash the indexer? (High)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Struct: AptosCollection] [Mutability confusion] The mutable_description and mutable_uri booleans control collection mutability - can these be manipulated to show immutable collections as mutable, misleading NFT buyers about asset permanence? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: TokenV2::get_collection_address()] [Reference manipulation] Can an attacker craft TokenV2 resources where the collection ResourceReference points to a malicious collection, causing tokens to appear associated with prestigious collections for fraud purposes? (High)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: TokenV2::from_write_resource()] [Deserialization bomb] Can attackers create TokenV2 resources with deeply nested JSON structures that cause exponential memory consumption during serde_json deserialization, leading to indexer DoS? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: TokenV2::get_uri_trunc()] [Metadata hijacking] If URI truncation cuts off query parameters or fragments, can attackers craft token URIs that appear to point to legitimate metadata pre-truncation but actually resolve to malicious content post-truncation? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: TokenV2::get_name_trunc()] [Name collision] Can two tokens with names differing only after NAME_LENGTH characters be indexed identically, causing token confusion and potential display bugs in NFT marketplaces? (Low)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Struct: TokenV2] [Description overflow] Is the description field length-bounded during deserialization, or can extremely long descriptions consume excessive database storage and cause query timeouts? (Low)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: ResourceReference::get_reference_address()] [Circular reference] Can ResourceReference point to itself or create circular reference chains that cause infinite loops during collection-token relationship traversal? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Struct: ResourceReference] [Invalid address] Does standardize_address() reject all invalid address formats, or can malformed inner strings pass validation and corrupt the indexer's relational database foreign key constraints? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Function: FixedSupply::from_write_resource()] [Supply invariant violation] Can an attacker craft FixedSupply resources where current_supply > max_supply or total_minted < current_supply, violating supply conservation and indicating potential token duplication? (Critical)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Struct: FixedSupply] [BigDecimal overflow] Can deserialize_from_string for supply fields accept negative BigDecimal values, allowing indexing of collections with negative supply counts that break marketplace logic? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/v2_token_utils.rs] [Struct: FixedSupply] [Precision loss] Do BigDecimal supply values preserve full precision during deserialization and storage, or can rounding errors cause supply mismatches between blockchain state and indexer records? (Medium)"
]