[
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Struct: TokenOwnership] [Primary Key Collision] Can an attacker manipulate the composite primary key (token_data_id_hash, property_version, transaction_version, table_handle) to create hash collisions that overwrite legitimate token ownership records, enabling unauthorized ownership claims? (Critical)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Struct: TokenOwnership] [Primary Key Manipulation] Does the indexer verify that token_data_id_hash values are collision-resistant, or can an attacker craft token metadata that produces identical hashes to existing tokens, allowing them to create duplicate ownership records? (High)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Struct: CurrentTokenOwnership] [Primary Key Race Condition] In the CurrentTokenOwnership table with primary key (token_data_id_hash, property_version, owner_address), can concurrent transactions at the same block create race conditions where ownership updates are lost or incorrectly applied? (High)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Primary Key Validation] Does the from_token() function validate that all components of the composite primary key are non-null and within valid ranges before insertion, or can malformed data cause database constraint violations or silent failures? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Address Validation Bypass] At lines 87, 101-102, 130-131, the standardize_address() function is called on table_handle and addresses - can an attacker provide malformed addresses (e.g., non-hex, wrong length) that bypass standardization and create inconsistent database records? (High)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Address Truncation Attack] Does standardize_address() properly handle addresses shorter than expected, or can an attacker provide truncated addresses (less than 64 hex chars) that get incorrectly padded, causing ownership to be attributed to wrong addresses? (Critical)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Address Overflow Attack] If an attacker provides addresses longer than 66 characters (0x + 64 hex), does standardize_address() at line 87 panic or silently truncate, potentially causing ownership records to point to wrong table handles? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Case Sensitivity Bypass] Does standardize_address() handle uppercase vs lowercase hex characters consistently, or can an attacker create duplicate ownership records by varying case (0xABC vs 0xabc) that point to the same actual address? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Null Address Injection] At line 130, owner_address uses Option::map with standardize_address - can an attacker inject null/empty addresses that bypass validation and create ownership records without valid owners? (High)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Struct: TokenOwnership] [BigDecimal Overflow] The amount field at line 38 uses BigDecimal - can an attacker provide extremely large token amounts (e.g., 2^256) that cause arithmetic overflow in downstream calculations or database storage issues? (High)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Negative Amount Bypass] At line 134, the amount parameter is directly assigned without validation - can an attacker pass negative BigDecimal amounts that bypass the ensure_not_negative() check in the caller, creating invalid ownership records with negative balances? (Critical)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Zero Amount Token Deletion] In from_delete_table_item() (tokens.rs line 332), tokens are deleted with BigDecimal::zero() amount - does the indexer properly handle zero-amount records, or can they be exploited to hide token ownership or create phantom tokens? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Struct: CurrentTokenOwnership] [Amount Precision Loss] When BigDecimal amounts are stored/retrieved at line 54, can precision loss during database round-trips cause discrepancies between actual token balances and indexed balances, enabling micro-theft attacks? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Amount Cloning Attack] At line 105 and 134, token.amount is cloned - if the underlying Token struct has mutable amount, can race conditions during cloning cause inconsistent amounts between TokenOwnership and CurrentTokenOwnership? (High)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Table Type Bypass] At lines 90-93, the function only accepts table_type '0x3::token::TokenStore' - can an attacker register a custom table type with similar naming to bypass this check and inject malicious ownership records? (High)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Table Type Spoofing] Does the table_type validation at line 91 use exact string matching or pattern matching? Can an attacker spoof the type string with unicode lookalikes or whitespace to bypass the check? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Missing Table Metadata Exploitation] At lines 114-122, when table metadata is missing, the function logs a warning but continues with None values - can an attacker deliberately omit table metadata to create ownership records without proper validation? (High)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Table Type Mutation] At line 108, table_type is cloned from table metadata - if the TableHandleToOwner mapping is mutated during processing, can race conditions cause table_type to be inconsistent between checks and actual storage? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Struct: TokenOwnership] [Property Version Overflow] The property_version field at line 31 uses BigDecimal - can an attacker mint tokens with extremely large property versions (e.g., 2^256) to cause database indexing issues or query failures? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Property Version Collision] At lines 100 and 129, property_version is cloned from token data - can two different tokens have identical (token_data_id_hash, property_version, owner_address) tuples, causing CurrentTokenOwnership primary key violations? (High)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Struct: CurrentTokenOwnership] [Property Version Rollback] If a token's property_version is decremented in a transaction, does the CurrentTokenOwnership update properly handle version rollbacks, or can it create inconsistent state where old versions overwrite new versions? (High)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Negative Property Version] Does the code validate that property_version is non-negative, or can an attacker create tokens with negative property versions that break database queries or cause sorting issues? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Struct: TokenOwnership] [Transaction Version Reordering] The transaction_version field at line 32 is part of the primary key - can out-of-order transaction processing cause ownership records to be inserted with incorrect ordering, breaking historical audit trails? (High)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Function: from_token()] [Timestamp Manipulation] At lines 109 and 138, transaction_timestamp is copied from token data - can malicious validators manipulate transaction timestamps to reorder ownership events or create temporal inconsistencies? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/token_models/token_ownerships.rs] [Struct: CurrentTokenOwnership] [Version Downgrade Attack] At line 56, last_transaction_version is stored - if a later transaction has a lower version number due to indexer bugs, can it incorrectly overwrite current ownership state? (High)"
]