[
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: get_random_eligible_subset_of_players()] [Player Duplication] If the range (0..self.get_total_num_shares()) at line 90 produces duplicate values or get_player(i) returns the same Player for different i values, could the subset contain fewer than t unique players, breaking reconstruction threshold assumptions? (Medium)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: get_random_eligible_subset_of_players()] [Empty Subset Attack] If get_total_num_shares() returns 0 or choose_multiple(self.t) is called with t=0, could the function return an empty Vec, allowing invalid 'reconstruction' attempts with zero shares that should fail but might expose secret material through error messages? (Medium)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: get_random_eligible_subset_of_players()] [Resource Exhaustion] If self.t is extremely large (but still <= n), could choose_multiple allocate excessive memory or CPU time to sample the subset, causing DoS when this function is called during DKG testing or benchmarking? (Low)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: get_batch_evaluation_domain()] [Reference Leak] Does returning a reference &BatchEvaluationDomain at line 58-60 allow callers to hold this reference while the ThresholdConfigBlstrs is modified elsewhere, potentially causing use-after-free or data races in concurrent DKG operations? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: get_evaluation_domain()] [Domain Consistency] If the dom field was constructed incorrectly in new(), does get_evaluation_domain() at line 63-65 perform any validation before returning the reference, or could callers receive invalid domains that produce incorrect FFT results in PVSS? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: get_threshold()] [Threshold Manipulation] Since get_threshold() at line 135-137 simply returns self.t without validation, could race conditions or memory corruption cause t to be modified after construction, allowing threshold changes mid-protocol that break DKG security? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Struct: ThresholdConfigBlstrs] [Clone Safety] The struct derives Clone at line 20 - when cloning, are the dom and batch_dom fields (which contain precomputed roots of unity) deeply copied or do they share references? Could this lead to data races if one clone modifies shared cryptographic state? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Struct: ThresholdConfigBlstrs] [PartialEq Semantics] The PartialEq implementation only compares serializable fields (due to #[serde(skip)] on dom and batch_dom) - could two ThresholdConfigBlstrs instances with same t,n but different domain states compare as equal, causing validators to accept mismatched configurations? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: new()] [Domain Size Mismatch] If BatchEvaluationDomain::new(n) creates a domain for the smallest power of 2 >= n, and get_subdomain(n) is called with the original n, could mismatches between N (power of 2) and n (actual player count) cause off-by-one errors in polynomial evaluation? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: new()] [Root of Unity Exhaustion] For very large n values, does BatchEvaluationDomain::new(n) check if the required N-th root of unity exists in the BLS12-381 scalar field (which has limited root-of-unity support), or could it silently fail and produce invalid domains? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: new()] [FFT Size Attack] If the smallest power of 2 >= n is significantly larger than n (e.g., n=2^20+1 requires N=2^21), could this force unnecessarily large FFT computations that exhaust validator memory or CPU during PVSS operations? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Struct: ThresholdConfigBlstrs] [Domain State Corruption] Since dom and batch_dom are not serialized, if a ThresholdConfigBlstrs is cloned, serialized, and deserialized, could the reconstructed domains have different internal state than the original, causing determinism failures in DKG across validators? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Struct: ThresholdConfigBlstrs] [Scalar Field Overflow] When batch_dom stores all N-th roots of unity as Scalars, could arithmetic overflow in the scalar field during domain construction cause wraparound, producing incorrect roots that break FFT correctness and PVSS security? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: fmt()] [Format String Injection] The Display implementation at line 70 constructs a string 'threshold/{t}-out-of-{n}' - if this output is logged or displayed in contexts where format string vulnerabilities exist, could attacker-controlled t/n values exploit log injection attacks? (Low)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Struct: ThresholdConfigBlstrs] [Debug Info Leak] The struct derives Debug at line 20 which will print all fields including dom and batch_dom containing cryptographic material - could debug logs expose sensitive domain parameters that aid attacks on DKG? (Low)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: get_total_num_players()] [Player Count Mismatch] Does get_total_num_players() returning self.n at line 97-99 always match the actual number of players in the PVSS protocol, or could desynchronization occur if n is modified without updating related validator state? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: get_total_num_shares()] [Share Count Invariant] Since get_total_num_shares() returns self.n (same as players) at line 101-103, is the assumption that shares==players always valid, or could weighted PVSS schemes break this invariant, causing share distribution attacks? (Medium)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: get_player()] [Player Construction] The code calls self.get_player(i) at line 93 but this method is not defined in this file - if get_player() is defined elsewhere and doesn't validate i < n, could out-of-bounds player IDs be created that bypass security checks? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Trait: SecretSharingConfig] [Trait Confusion] Does implementing SecretSharingConfig allow ThresholdConfigBlstrs to be used interchangeably with weighted configurations, and could trait object type confusion enable attacks where unweighted thresholds are applied to weighted PVSS protocols? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Struct: ThresholdConfigBlstrs] [Concurrent Clone] If multiple threads clone the same ThresholdConfigBlstrs concurrently (since it derives Clone), could race conditions in cloning the dom or batch_dom fields cause one thread to receive partially-initialized domains? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Struct: ThresholdConfigBlstrs] [Send/Sync Safety] Is ThresholdConfigBlstrs Send + Sync? If it's sent between threads in a validator node, could race conditions in accessing shared EvaluationDomain state cause FFT computation failures that halt DKG? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Struct: ThresholdConfigBlstrs] [Interior Mutability] Although the struct fields appear immutable, do EvaluationDomain or BatchEvaluationDomain contain interior mutability (e.g., RefCell, Mutex) that could cause data races if ThresholdConfigBlstrs is accessed concurrently? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: new()] [Constructor Race] If two threads call new(t, n) concurrently with the same parameters, do they each get independent domain instances, or could caching/memoization in EvaluationDomain cause them to share state, leading to race conditions? (Medium)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: new()] [Threshold Too Low] Can an attacker create configurations with very low t values (e.g., t=1 for n=1000) that technically pass validation but provide insufficient security, making it trivial to reconstruct DKG secrets from a single compromised validator? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/blstrs/threshold_config.rs] [Function: new()] [Byzantine Threshold Violation] For AptosBFT requiring <1/3 Byzantine tolerance, does the code enforce that t > n/3 to prevent attackers from reconstructing secrets with fewer than Byzantine threshold shares, breaking consensus safety? (Critical)"
]