[
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: IndexerApiManager::new()] [Configuration injection] Can an attacker manipulate the RunLocalnet args to inject malicious values into indexer_api_port, existing_hasura_url, or postgres_connection_string during initialization, potentially redirecting connections to attacker-controlled services? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: IndexerApiManager::new()] [Path traversal] Does the test_dir PathBuf parameter undergo validation to prevent directory traversal attacks that could write Docker logs to sensitive system directories? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: IndexerApiManager::new()] [Network isolation bypass] Can the docker_network string be manipulated to connect the indexer container to unintended Docker networks, potentially exposing it to malicious containers or network traffic? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: IndexerApiManager::get_url()] [URL injection] If existing_hasura_url is user-controlled, can an attacker provide a malicious URL (e.g., file://, javascript:, or attacker-controlled HTTP endpoint) that bypasses validation and is used in subsequent HTTP requests? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: IndexerApiManager::get_url()] [Port confusion] When existing_hasura_url is None, the function constructs a URL with indexer_api_port - can an attacker provide a port number outside valid ranges (0-65535) or reserved ports that cause security issues or privilege escalation? (Low)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: pre_run()] [Container reuse attack] When delete_container() is called, does it properly verify the container belongs to this localnet instance, or could it delete unrelated containers with the same name leading to DoS of other services? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: pre_run()] [Image substitution] When pull_docker_image(HASURA_IMAGE) is called, is the image digest verified cryptographically, or can an attacker perform a registry MITM attack to substitute a malicious Hasura image? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: pre_run()] [Environment variable injection] The DOCKER_DEFAULT_PLATFORM warning checks std::env::var - if this env var is attacker-controlled, can it be set to values that cause the Hasura container to execute malicious platform-specific binaries? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: pre_run()] [Time-of-check-time-of-use] Between delete_container() and pull_docker_image(), could a malicious process create a new container with INDEXER_API_CONTAINER_NAME, causing the subsequent container creation to fail or attach to the wrong container? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: pre_run()] [Docker availability bypass] Does get_docker().await properly validate Docker daemon accessibility and permissions, or can it succeed with a compromised Docker socket that allows privilege escalation? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: get_health_checkers()] [Health check bypass] Can an attacker set skip_metadata_apply to skip the IndexerApiMetadata health check while still having the metadata applied through a race condition, bypassing validation? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: get_health_checkers()] [False positive health] If the HealthChecker::Http only checks that the URL returns 200, can an attacker-controlled existing_hasura_url return 200 for any path without actually running Hasura, causing false health confirmation? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: get_health_checkers()] [Checker manipulation] Can prerequisite_health_checkers be manipulated during initialization to remove critical checks or add dummy checkers that always pass? (Low)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: run_service()] [Connection string injection] When postgres_connection_string is replaced from 127.0.0.1 to host.docker.internal, is the string properly validated to prevent SQL injection or command injection in the Hasura container's environment? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: run_service()] [Network mode exploitation] When network_mode is set based on the postgres connection string, can an attacker craft a postgres_connection_string that triggers both branches or neither, leading to network isolation bypass or connection failures? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: run_service()] [Host gateway abuse] The extra_hosts configuration adds 'host.docker.internal:host-gateway' - can this be exploited to allow the container to access arbitrary host services beyond postgres, potentially reaching privileged ports or internal services? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: run_service()] [Port binding hijack] The PortBinding sets host_ip to 127.0.0.1 - if indexer_api_port is already bound by another process, does the container fail safely, or could it bind to a different interface exposing the service publicly? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: run_service()] [Environment variable injection] The env vec contains multiple formatted strings with user-controlled data (postgres_connection_string, indexer_api_port) - are these properly escaped to prevent command injection in the container environment? (Critical)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: run_service()] [Dev mode exploitation] HASURA_GRAPHQL_DEV_MODE is hardcoded to true - does this enable dangerous Hasura debugging features that could leak sensitive information or allow unauthorized API access? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: run_service()] [Console exposure] HASURA_GRAPHQL_ENABLE_CONSOLE is set to true - can an attacker access the Hasura console UI to execute arbitrary GraphQL queries, modify metadata, or extract database credentials from the environment? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: run_service()] [Container creation race] Between create_container() and start_container(), can an attacker modify the created container's configuration, replace its image, or attach malicious volumes? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: run_service()] [Async state corruption] The function uses async/await extensively - are there race conditions between container state checks that could cause the service to believe a container is running when it has actually failed? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: run_service()] [Container escape] Does the HostConfig properly restrict container capabilities, or can a compromised Hasura container escalate privileges and break out of the container to access the host system? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: run_service()] [Wait condition manipulation] The wait_container call uses condition 'not-running' - can an attacker cause the container to enter an unexpected state that satisfies this condition prematurely, terminating the service? (Low)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/indexer_api.rs] [Function: run_service() - existing_hasura_url path] [External service manipulation] When using an existing Hasura instance, the health check runs in a loop every 1 second - can an attacker cause intermittent failures to trigger false positives while the Hasura instance is actually compromised? (Low)"
]