[
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: FileHash::new()] [Hash collision attack] Can an attacker craft two different Move source files with identical SHA256 hashes to bypass compilation cache checks, potentially injecting malicious bytecode that appears to match a trusted source file? (Critical)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: FileHash::new_from_bytes()] [Cryptographic weakness] Does the SHA256 implementation properly handle length extension attacks or partial collision attacks when computing file hashes, potentially allowing substitution of Move modules during deployment? (High)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: FileHash::new()] [Encoding manipulation] Can an attacker exploit UTF-8 encoding normalization differences (NFC vs NFD) to create Move files that hash differently but compile identically, bypassing source verification checks? (High)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: FileHash::new()] [Resource exhaustion] Can extremely large Move source files (e.g., gigabytes of comments or whitespace) cause memory exhaustion during SHA256 computation, leading to validator node crashes? (Medium)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: FileHash::empty()] [Zero hash bypass] Can code paths that check FileHash::empty() be exploited by crafting files that legitimately hash to all zeros, causing security checks to incorrectly treat them as uninitialized? (Medium)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: FileHash serialization] [Deserialization attack] Can maliciously crafted serialized FileHash values (via Serde) bypass validation and inject arbitrary 32-byte values that don't correspond to actual SHA256 hashes? (High)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: find_filenames()] [Path traversal] Can an attacker supply paths containing '../../../' sequences to escape the intended directory and compile/access Move files outside the project boundary, potentially including system files? (High)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: find_filenames()] [Symlink attack] Does the 'follow_links(true)' configuration allow attackers to create symbolic links pointing to arbitrary system files, causing the compiler to process unauthorized files or leak sensitive information? (Critical)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: find_filenames()] [Infinite recursion] Can circular symlink structures cause WalkDir to enter infinite loops, exhausting stack memory and crashing validator nodes during compilation? (High)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: find_filenames()] [TOCTOU race condition] Is there a time-of-check-time-of-use vulnerability where an attacker can replace a legitimate Move file with malicious content between the exists() check and the actual file read? (High)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: find_filenames()] [Directory traversal DoS] Can an attacker supply paths to directories with millions of files or deeply nested structures, causing excessive CPU/memory usage during walkdir traversal and DoSing compilation? (Medium)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: find_filenames()] [Privileged file access] Can the function be exploited to read privileged Move framework files (like governance.move or stake.move) that should be restricted, potentially exposing private implementation details? (Medium)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: find_filenames()] [Filter bypass] Can the predicate function be bypassed by creating files with unusual extensions or special characters that are incorrectly classified, allowing unauthorized file types to be processed? (Medium)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: find_filenames()] [Error swallowing] Does 'filter_map(|e| e.ok())' silently ignore permission errors or I/O failures that could indicate ongoing attacks or filesystem tampering? (Low)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: find_move_filenames()] [Type confusion] Can an attacker create files with .move extensions that contain non-Move content (e.g., bytecode, scripts) that bypass source-level validation but execute during compilation? (High)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: find_move_filenames()] [Partition attack] When 'keep_specified_files' is true, can the partition logic be exploited to include malicious non-.move files by exploiting race conditions in is_file() checks? (Medium)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: find_move_filenames()] [Path normalization bypass] Can attackers use path normalization differences (e.g., '//' vs '/', './' prefixes) to cause the same file to be included multiple times with different hashes? (Medium)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: find_move_filenames()] [Boolean flag manipulation] Can the 'keep_specified_files' parameter be exploited in calling contexts to include unauthorized files in compilation, bypassing project structure constraints? (Low)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: path_to_string()] [Unicode encoding attack] Can non-UTF8 filenames cause the function to fail with 'non-Unicode file name' error, but allow the raw path bytes to be processed elsewhere, bypassing filename validation? (Medium)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: path_to_string()] [Homoglyph attack] Can attackers use Unicode homoglyphs in filenames (e.g., Cyrillic 'а' vs Latin 'a') to create files that appear identical but have different hashes, causing source verification failures? (High)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: path_to_string()] [Path injection] Can special characters in filenames (e.g., newlines, null bytes) survive the to_string() conversion and cause injection attacks in downstream log files or shell commands? (Medium)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: path_to_string()] [Error message leakage] Does the 'non-Unicode file name' error message expose sensitive path information that could reveal the system's directory structure to attackers? (Low)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: extension_equals()] [Case sensitivity bypass] Does extension comparison handle case-insensitive filesystems correctly, or can attackers use '.Move', '.MOVE', '.MoVe' to bypass extension filtering? (Medium)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: extension_equals()] [Multi-extension attack] Can files like 'malicious.move.txt' or 'contract.txt.move' bypass security checks by having the .move extension in non-terminal positions? (Medium)",
  "[File: third_party/move/move-command-line-common/src/files.rs] [Function: extension_equals()] [Hidden extension] Can null bytes or special characters in filenames (e.g., 'evil.move\\x00.txt') cause extension validation to pass but filesystem operations to use different extensions? (High)"
]