[
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: get()] [Type Confusion] When serde_json::from_value() deserializes to generic type V, can an attacker manipulate the JSON to deserialize wrong types (String as integer), causing type confusion in consensus key usage? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: set()] [Concurrent Write Race] If two threads call set() simultaneously for different keys, can the read-modify-write sequence cause lost updates where one write overwrites the other's changes? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Disk Space Exhaustion] Does write() check available disk space before creating the temp file, or can disk full conditions during serde_json::to_vec() or write_all() leave the storage in an inconsistent state? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [Size Limit DoS] Is there a maximum size check on the file before read_to_string(), or can an attacker create a multi-gigabyte storage file causing out-of-memory crashes in the validator? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Fsync Durability] After fs::rename(), is fsync() called on the parent directory to ensure durability, or can a system crash immediately after rename lose the updated consensus keys? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: get()] [Deserialization Bomb] Can an attacker craft a storage file with exponential JSON expansion (e.g., nested arrays of arrays) that explodes in memory during serde_json::from_value(), causing validator OOM crash? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: set()] [Serialization Failure] If serde_json::to_value() fails for a consensus key value due to serialization constraints, does the error handling leave the storage partially updated or in an inconsistent state? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [UTF-8 Injection] Does file.read_to_string() validate UTF-8 encoding, or can an attacker inject invalid UTF-8 sequences causing String allocation failures or unexpected behavior in JSON parsing? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: get()] [GetResponse Tampering] Since get() deserializes GetResponse<V> from Value, can an attacker modify the last_update timestamp in the storage file to manipulate time-based security checks in consensus? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: set()] [Time Service Manipulation] The set() function uses self.time_service.now_secs() for last_update - if time_service is the test mock, can an attacker manipulate timestamps to bypass time-based key expiration? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [JSON Encoding Issues] Does serde_json::to_vec() use canonical JSON encoding, or can different serialization of the same data cause hash mismatches if storage files are compared for integrity? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [HashMap Collision DoS] Can an attacker craft key names that hash to the same bucket in HashMap, causing O(n) lookup performance degradation and DoS when validators access consensus keys? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: get()] [Error Message Leakage] When serde_json::from_value() fails with SerializationError, does the error message expose the actual stored Value structure, leaking information about key format? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: set()] [Unicode Key Names] Are key parameter strings validated for Unicode normalization attacks, or can an attacker use visually-identical key names (e.g., Latin vs Cyrillic characters) to shadow legitimate consensus keys? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [BOM Handling] Does read_to_string() handle UTF-8 BOM (Byte Order Mark) correctly, or can a BOM-prefixed storage file cause JSON parsing failures and loss of consensus key access? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: set()] [Read-Modify-Write Race] The set() operation does self.read() then self.write() - can a concurrent process modify the file between these calls, causing lost updates to other keys stored alongside consensus keys? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: get()] [Dirty Read Race] Can get() read a partially written file if called concurrently with write(), returning corrupted consensus key data that causes signature verification failures? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Temp File Race Window] Between File::create(self.temp_path.path()) and fs::rename(), can another thread/process read the temporary file, accessing consensus keys before they're atomically moved? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: available()] [False Availability] The available() function always returns Ok(()) without checking file access - can this cause validators to think storage is accessible when the file is actually locked or corrupted? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Struct: OnDiskStorage] [Mutable Reference] Since KVStorage::set() takes &mut self, is the Arc<RwLock<>> wrapper properly used in production, or can write lock contention cause consensus timeouts? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: reset_and_clear()] [Test Data Leakage] The reset_and_clear() function is available with #[cfg(any(test, feature = \\",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Rename Race Condition] If multiple processes call write() simultaneously, can fs::rename() operations interleave, causing one validator's keys to overwrite another's on shared storage? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [File Handle Leak] Does File::open() properly close file handles on error paths, or can repeated read failures leak file descriptors causing validator process resource exhaustion? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: new()] [Initialization Race] Can multiple threads call new() with the same file_path simultaneously, causing race conditions in File::create() that corrupt the initial storage state? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Signal Handler Race] If a Unix signal interrupts fs::rename(), can the rename operation be left in a partial state with neither old nor new file available, permanently losing consensus keys? (High)"
]