[
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Struct: CoinInfoResource] [Data validation] Can an attacker craft a malicious CoinInfoResource with invalid UTF-8 bytes in the name field that causes deserialization to succeed but symbol() to fail, leading to inconsistent coin metadata state across validators? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Struct: CoinInfoResource] [Data validation] Can malicious validators inject excessively large Vec<u8> values in name or symbol fields (e.g., multiple GB) during serialization to cause memory exhaustion attacks when other validators deserialize CoinInfo resources? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Struct: CoinInfoResource] [Integer bounds] Is there validation preventing decimals field from exceeding reasonable bounds (e.g., 255), which could cause arithmetic overflow in downstream coin amount calculations and lead to incorrect balance computations? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Struct: CoinInfoResource] [Type confusion] Can an attacker exploit the PhantomData<C> field to cause type confusion between different CoinType implementations, allowing one coin type to masquerade as another and bypass type safety checks? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Struct: CoinInfoResource] [Serialization bypass] Does the #[serde(skip)] attribute on phantom_data field create serialization inconsistencies where deserialized objects have uninitialized or default PhantomData, potentially breaking type safety assumptions? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: symbol()] [UTF-8 validation] Can an attacker store invalid UTF-8 sequences in the symbol field that pass BCS deserialization but cause symbol() to return Err, creating a CoinInfo resource that cannot have its symbol queried and breaks API functionality? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: symbol()] [Resource exhaustion] Does symbol() clone the entire symbol Vec<u8> on every call, allowing attackers to trigger repeated expensive memory allocations if symbol is large (MB/GB range), causing validator performance degradation? (Low)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: symbol()] [Data integrity] Can race conditions occur if symbol field is modified concurrently while symbol() is executing its clone operation, leading to torn reads or corrupted UTF-8 data being returned? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: symbol()] [Error handling] If symbol() returns FromUtf8Error, are there code paths that unwrap this Result without proper error handling, causing validator crashes or transaction failures during coin operations? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: decimals()] [Arithmetic overflow] Can the u8 decimals value be exploited in combination with large coin amounts to cause integer overflow when computing decimal-adjusted balances (e.g., amount * 10^decimals), leading to incorrect supply tracking? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: decimals()] [Inconsistent state] Is there validation ensuring decimals value is immutable after CoinInfo creation, or can it be modified mid-lifecycle causing existing coin balances to have inconsistent decimal interpretations? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: supply()] [Null pointer access] Can supply() return a reference to None, which if unwrapped in downstream code without checking, causes validator panics when querying supply for coins that don't track supply? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: supply()] [State inconsistency] Does supply() provide mutable access pathways that allow external code to modify the OptionalAggregatorV1Resource without proper validation, breaking supply tracking invariants? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: supply()] [Type confusion] Can attackers exploit the Option<OptionalAggregatorV1Resource> double-optional pattern to create ambiguous states (Some(None aggregator) vs None supply) causing inconsistent supply tracking logic? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: random()] [Weak randomness] Does random() use cryptographically secure randomness from AccountAddress::random(), or can predictable handle/key values be generated allowing attackers to pre-compute aggregator addresses and front-run supply modifications? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: random()] [Collision attacks] Can repeated calls to random() generate duplicate handle/key pairs due to insufficient entropy, causing multiple coins to share the same aggregator and corrupt supply tracking? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: random()] [Limit bypass] Is the limit parameter validated in random() to prevent u128::MAX or other extreme values that could cause aggregator arithmetic overflow when tracking supply? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: random()] [Production usage] Can random() be called in production code paths instead of just testing, creating non-deterministic CoinInfo resources that break consensus when validators execute the same transaction but generate different random values? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: random()] [State pollution] Does random() create fake CoinInfo resources with hardcoded 'AptosCoin' name/symbol that could be confused with legitimate APT coin metadata, allowing spoofing attacks? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: new()] [Parameter validation] Does new() validate that handle and key parameters are non-zero and distinct, or can passing identical AccountAddress values cause aggregator collisions and supply corruption? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: new()] [Limit validation] Can limit parameter in new() be set to 0 or extremely small values causing immediate aggregator limit violations when minting the first coin, breaking coin initialization? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: new()] [Hardcoded values] Why does new() hardcode name='AptosCoin', symbol='APT', decimals=8, and can this be exploited to create fake APT coins with custom type parameters that masquerade as legitimate Aptos coin? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: new()] [Aggregator initialization] Does new() properly initialize the OptionalAggregatorV1Resource with both aggregator=Some and integer=None, or can incorrect initialization cause supply tracking to fail silently? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: new()] [Type parameter bypass] Can new() be called with an arbitrary CoinType C parameter to create spoofed CoinInfo resources that appear valid but don't correspond to legitimate coin types registered on-chain? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: supply_aggregator_state_key()] [Panic on None] Does supply_aggregator_state_key() unwrap supply.as_ref().unwrap().aggregator.as_ref().unwrap() without checking, causing validator panics when called on CoinInfo resources where supply tracking is disabled (supply=None)? (High)"
]