[
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Integer Overflow] Can an attacker submit a transaction with version number >= 2^63, causing the cast `inner.info.version.0 as i64` to overflow into negative values, potentially corrupting the database primary key or causing sorting inconsistencies in transaction history? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Integer Overflow] In the UserTransaction branch at line 46, does the conversion `inner.info.version.0 as i64` handle the maximum u64 value (18446744073709551615) correctly, or could it wrap to -1 and overwrite existing records in the account_transactions table? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Integer Overflow] For GenesisTransaction at line 52, can the version cast `inner.info.version.0 as i64` produce negative transaction versions that violate database constraints or create invalid primary keys in the composite key (account_address, transaction_version)? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Integer Overflow] In BlockMetadataTransaction handling at line 58, if a malicious validator crafts a block with version u64::MAX, will the i64 cast overflow and allow duplicate entries or primary key collisions in the account_transactions table? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_event()] [Integer Overflow] At line 93, when creating AccountTransaction with `txn_version: i64`, if this value was derived from an overflowed u64 cast earlier, could it create inconsistent mappings between events and their actual transaction versions? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Integer Overflow] At line 107, the transaction_version field is set from txn_version parameter - if this was cast from u64 with overflow, could it cause resource writes to be attributed to wrong transaction versions, breaking audit trails? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_delete_resource()] [Integer Overflow] At line 131, does the AccountTransaction creation with overflowed txn_version allow attackers to mask resource deletion operations by associating them with invalid transaction versions? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Data Integrity] At line 64, the HashMap account_transactions is initialized empty and populated from multiple sources - can an attacker craft a transaction where the same (account_address, txn_version) tuple appears multiple times, causing later entries to silently overwrite earlier ones and lose critical account associations? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Data Integrity] Between lines 65-69 (signature processing) and lines 71-84 (event/resource processing), if the same account address appears as both a signer and in events/resources, does the HashMap insert at line 66 get overwritten by extend operations at lines 72 and 74-83, causing signature information to be lost? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Data Loss] At line 72, HashMap.extend() from from_event() can overwrite existing entries - if a malicious transaction has an event with account_address matching a signer, will the signer's AccountTransaction record be silently replaced, breaking signature audit trails? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Data Loss] At lines 77 and 80, HashMap.extend() is called for DeleteResource and WriteResource processing - can an attacker craft write set changes that deliberately collide with event account addresses to overwrite event-based AccountTransaction records? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Data Integrity] At line 106, the result HashMap inserts the resource address, then at line 112 potentially inserts the object owner address - if these addresses are identical (self-owned object), does the second insert overwrite the first, losing the resource-level tracking? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Logic Error] Between lines 106 and 112, if ObjectWithMetadata.from_write_resource returns Some with owner matching the resource address, the HashMap will have duplicate inserts for the same key - does this waste database writes or mask the fact that both resource and ownership changes occurred? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_event()] [Address Manipulation] At line 91, standardize_address() pads addresses to 66 characters - can an attacker submit events with malformed addresses (e.g., too short, invalid hex) that bypass standardization or cause panics, allowing DoS of the indexer? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_event()] [Address Collision] At line 91, if standardize_address() uses format!('0x{:0>64}', &handle[2..]), could an attacker craft two different addresses that standardize to the same value by manipulating the prefix, causing account transaction records to incorrectly merge? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Address Manipulation] At line 105, standardize_address(&write_resource.address.to_string()) assumes the address string is well-formed - can malicious validators inject write resources with addresses missing '0x' prefix, causing slice panic in standardize_address at &handle[2..]? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_delete_resource()] [Address Manipulation] At line 129, if delete_resource.address.to_string() produces an address shorter than 2 characters (e.g., empty string), will standardize_address panic when accessing &handle[2..], causing indexer crash? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Data Inconsistency] At line 114, ObjectCore.get_owner_address() calls standardize_address internally - if this standardization differs from the one at line 105, could object owners be tracked under different address formats, breaking parent-child object relationships? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Address Consistency] At line 68, sig.signer is used directly without calling standardize_address, but events (line 91), write resources (line 105), and delete resources (line 129) all call it - does this create inconsistent address formats in the HashMap keys, causing account transactions to be fragmented across multiple address variants? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Transaction Bypass] At lines 60-62, the catch-all `_ => { return Ok(HashMap::new()); }` handles StateCheckpointTransaction and PendingTransaction types - can attackers use these transaction types to perform state changes that don't get indexed, creating blind spots in account transaction history? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Missing Coverage] The match statement at lines 41-62 only handles UserTransaction, GenesisTransaction, and BlockMetadataTransaction - if new transaction types are added to the Transaction enum, will they silently return empty results, causing missing account transaction records? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Data Loss] At line 51, GenesisTransaction returns empty vec![] for signatures - during genesis, if accounts are created with initial balances, will these accounts have no transaction records linking them to the genesis, breaking account history completeness? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Data Loss] At line 57, BlockMetadataTransaction also returns empty vec![] for signatures - if block rewards are distributed via block metadata, will recipient accounts have no signature-based transaction records, making it impossible to attribute rewards to specific validators? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Logic Inconsistency] Lines 48-52 and 54-58 extract events and write set changes for GenesisTransaction and BlockMetadataTransaction but not signatures - does this asymmetry cause account_transactions table to have incomplete data for non-user transactions, affecting account activity queries? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Object Ownership] At lines 110-115, ObjectWithMetadata.from_write_resource is called to extract object ownership - if this function returns Some but inner.object_core.get_owner_address() points to a non-existent account, does this create dangling references in account_transactions that break referential integrity? (Medium)"
]