[
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Hash collision] Can an attacker craft two different Move source files with identical SHA256 FileHash values to cause CommentMap collisions, leading to comment misattribution across different smart contracts and potential compilation of malicious code with benign documentation? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [State confusion] If multiple files hash to the same FileHash key in CommentMap due to collision or implementation bug, could comment data from one contract overwrite another's documentation, causing validators to compile different bytecode than intended? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Key manipulation] Can malicious preprocessing of source files manipulate FileHash calculation timing to create race conditions where CommentMap entries are overwritten during concurrent compilation attempts? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Memory exhaustion] Can an attacker submit thousands of distinct Move files with unique FileHash keys to fill CommentMap unboundedly, causing OOM crashes during governance proposal compilation and blocking protocol upgrades? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Integer overflow] Can an attacker craft Move source files larger than 2^32 bytes (4GB) to cause u32 position overflow in MatchedFileCommentMap keys, resulting in comment positions wrapping around and mismatching documentation to wrong language items? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Position wraparound] If comment spans (u32, u32) wrap around at 4GB boundaries in FileCommentMap, could start positions appear after end positions in BTreeMap ordering, causing undefined behavior in range queries during comment matching? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Key collision] Can precisely placed comments at positions that differ by 2^32 bytes collide in MatchedFileCommentMap keys (u32), causing later comments to overwrite earlier ones and hide security-critical documentation from auditors? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Tuple ordering] Does BTreeMap correctly order tuples (u32, u32) when start or end values are near u32::MAX, or could overflow cause (4294967295, 0) to sort incorrectly relative to (100, 200), breaking comment extraction logic? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Memory exhaustion] Can an attacker submit Move files with extremely long documentation comments (multi-MB strings) at many positions to exhaust heap memory via unbounded String allocations in MatchedFileCommentMap values? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [String flooding] Can thousands of small comments throughout a file create millions of String entries in FileCommentMap, causing quadratic memory growth when combined with matched_doc_comments and impacting validator compilation performance? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Cross-file exhaustion] Can an attacker submit a governance proposal with hundreds of Move files each containing maximum-size comments to fill CommentMap with gigabytes of comment data, causing validator OOM and blocking governance execution? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [String deduplication] Does Rust's String type in MatchedFileCommentMap values deduplicate identical comment content, or will repeated identical documentation comments across many positions cause linear memory waste? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Range confusion] Can comment spans with inverted positions (end < start) be inserted into FileCommentMap's BTreeMap<(u32, u32), String>, causing range queries during match_doc_comments() to miss or double-process entries? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Overlapping spans] If multiple comments have overlapping (start, end) ranges in FileCommentMap, can BTreeMap iteration order cause non-deterministic comment matching across validators, leading to consensus failures when compiling governance proposals? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Ordering attack] Can an attacker exploit BTreeMap's ordering of u32 keys in MatchedFileCommentMap to cause comments to match language items in unexpected order, potentially hiding malicious code documentation during security review? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [FileHash ordering] Does BTreeMap<FileHash, _> ordering depend on SHA256 byte comparison, and can carefully crafted file contents manipulate compilation order to exploit time-of-check-time-of-use bugs in multi-file compilation? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Documentation injection] Can malicious comments inserted at critical u32 positions in MatchedFileCommentMap override legitimate security documentation for framework functions, causing auditors to miss vulnerabilities in governance upgrade proposals? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Span manipulation] Can an attacker craft comment delimiters at specific byte positions to create (u32, u32) spans in FileCommentMap that overlap critical code regions, causing documentation extraction to accidentally include source code in comment strings? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Cross-file poisoning] If FileHash values are predictable, can an attacker pre-compute colliding file contents to inject malicious CommentMap entries that persist across compilation sessions and affect subsequent unrelated compilations? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Position squatting] Can an attacker place dummy comments at strategic u32 positions in MatchedFileCommentMap to occupy keys before legitimate documentation is matched, causing real comments to be discarded or merged incorrectly? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Concurrent mutation] If CommentMap is accessed concurrently during parallel compilation of multiple Move modules, can race conditions cause BTreeMap corruption or comment data loss affecting deterministic bytecode generation? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Matching races] Can concurrent calls to match_doc_comments() from multiple threads cause race conditions when updating MatchedFileCommentMap, resulting in non-deterministic comment assignments across validator nodes? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Lexer state races] If multiple lexers share or clone FileCommentMap data structures, can concurrent trim_whitespace_and_comments() calls cause data races when inserting comment spans, leading to inconsistent compilation results? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Iterator invalidation] Can modification of CommentMap during iteration (e.g., adding new files while checking unmatched comments) cause iterator invalidation or use-after-free bugs leading to compiler crashes during governance proposal processing? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Unicode overflow] Can multi-byte UTF-8 characters in documentation comments cause byte position (u32) calculations to misalign with character boundaries, resulting in corrupted String values in MatchedFileCommentMap? (Medium)"
]