[
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Ownership Manipulation] At line 112, the object owner address is inserted into the result HashMap - can an attacker transfer object ownership multiple times within a single transaction, causing only the final owner to be recorded and losing intermediate ownership state? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Missing Validation] At line 110, if ObjectWithMetadata.from_write_resource returns None (not an object), no owner tracking occurs - can attackers exploit this by converting objects to regular resources to evade ownership tracking and hide asset transfers? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Data Consistency] The comment at line 98 mentions 'If the resource is an object, then we record the owner as well' - but what if the object owner is address 0x0 or another special address? Does inserting these into account_transactions create noise or security issues? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_delete_resource()] [Missing Owner Tracking] At lines 124-134, from_delete_resource only records the resource address, not the object owner - the TODO at line 121 mentions 'If the resource is an object, then we need to look for the latest owner' - can attackers delete objects without the owner being notified in account_transactions, allowing silent asset destruction? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_delete_resource()] [Parallel Processing Race] The TODO at lines 121-123 states 'This isn't really possible right now given we have parallel threads so it'll be very difficult to ensure that we have the correct latest owner' - does this mean object deletions in parallel execution could be attributed to wrong owners, creating audit trail confusion? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_delete_resource()] [Race Condition] The TODO comment at lines 121-123 explicitly mentions parallel threads making owner lookup difficult - if multiple transactions in parallel delete and recreate the same object, could the indexer record the wrong owner due to timing-dependent ordering? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Concurrency] At line 64, a new HashMap is created for each transaction - if from_transaction is called concurrently for multiple transactions, could there be race conditions in shared state (e.g., database connections, global caches) that cause inconsistent account_transactions records? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [State Consistency] At lines 110-115, ObjectWithMetadata.from_write_resource may query cached object data - in parallel execution, if object metadata is updated by transaction T1 while T2 is processing, could T2 see stale owner information leading to incorrect account_transactions entries? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Transaction Ordering] At lines 74-84, write set changes are processed in order - if parallel transactions modify the same account, could out-of-order indexing cause account_transactions to have gaps or reversed transaction versions, breaking chronological history? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Database Race] The returned HashMap at line 85 is presumably inserted into the database - if two parallel transactions insert records for the same (account_address, transaction_version), does the database handle this gracefully, or could one transaction's records be lost due to last-writer-wins semantics? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Error Handling] At line 77, from_delete_resource returns anyhow::Result but the ? operator propagates errors - if a single malicious delete resource causes an error, does this abort processing the entire transaction, causing all account_transactions for that transaction to be lost? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Error Handling] At line 80, from_write_resource uses ? to propagate errors - if ObjectWithMetadata.from_write_resource fails due to malformed object data, does this cause the entire transaction's account associations to be skipped, creating gaps in account history? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Error Propagation] At line 110, ObjectWithMetadata.from_write_resource returns anyhow::Result - if this fails but the resource address was already inserted at line 106, does the function return Err, causing a partially-populated HashMap to be discarded? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Partial Failure] At lines 71-84, if processing events succeeds but processing write set changes fails midway, is the HashMap returned with partial data, or is the entire result discarded? Could this lead to inconsistent account_transactions records? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_delete_resource()] [Error Safety] Lines 124-134 use anyhow::Result but only return Ok - if standardize_address could panic (e.g., on malformed addresses), should this be wrapped in a Result to prevent indexer crashes? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Error Safety] At line 105, if write_resource.address.to_string() returns an unexpected format that causes standardize_address to panic, does this crash the entire indexer or just fail this transaction gracefully? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Signature Bypass] At line 45, UserTransaction.get_signatures is called with parameters (inner, inner.info.version.0 as i64, 0) - if get_signatures fails to extract secondary signers or fee payer addresses, will these accounts not appear in account_transactions despite being part of the transaction? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Multi-Agent Bypass] At lines 65-69, the code iterates over signatures and uses sig.signer as the account address - for multi-agent transactions, if get_signatures only returns the primary signer, will secondary signers not be tracked in account_transactions, breaking multi-sig transaction audit trails? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Fee Payer Bypass] At line 45, if the transaction has a separate fee payer (FeePayer signature type), does get_signatures include this address, or will the fee payer not appear in account_transactions despite paying for the transaction? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Signature Duplication] At lines 66-69, if get_signatures returns duplicate signer addresses (e.g., same address in multi-agent and fee payer roles), will HashMap.insert deduplicate them, or could this cause unnecessary duplicate database writes? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Empty Signatures] At lines 51 and 57, GenesisTransaction and BlockMetadataTransaction return empty vec![] for signatures - is this correct, or should proposer addresses (for BlockMetadata) be included to track validator participation in account_transactions? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_event()] [Data Duplication] At lines 90-96, from_event creates a HashMap with a single entry - if a transaction has multiple events with the same guid.account_address, will each call to from_event create duplicate keys that overwrite each other when extend() is called at line 72? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_event()] [Object Events] The comment at line 89 states 'We don't really have to worry about objects here because it'll be taken care of in the resource section' - but what if an event is emitted by an object that has no corresponding WriteResource change? Will the object owner not be tracked in account_transactions? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_event()] [Event Ordering] At line 72, events are processed in order via iteration - if a malicious transaction emits events with manipulated account addresses to create many account_transactions entries, could this be used to bloat the database or create DoS via excessive writes? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Event vs Resource Priority] At lines 71-84, events are processed before write set changes - if both an event and a resource change reference the same account, does the HashMap collision cause the resource version to overwrite the event version, losing information about which mechanism triggered the account association? (Low)"
]