[
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Line 34-36: ed25519_verify registration] [Stack Overflow] Can extremely deep call chains or recursive invocations of native functions cause stack overflow leading to validator crashes and consensus disruption? (Medium)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [All native registrations] [State Consistency] Do native functions maintain deterministic behavior across all validators regardless of hardware, OS, or library versions, ensuring consistent state roots are computed preventing chain splits? (Critical)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Line 17-21: create_signer registration] [Signer Persistence] Are signers created by the native function properly tracked in the VM's data cache, or can signers exist outside the cache leading to inconsistencies between in-memory state and persisted state? (High)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Function: all_natives()] [Restricted Native Access] Are these native functions only accessible from framework modules at diem_framework_addr, or can arbitrary user-deployed contracts call these privileged operations to manipulate accounts and signatures? (Critical)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Line 17-21: create_signer registration] [System Address Protection] Does create_signer prevent creation of signers for system addresses (0x0, 0x1), or can attackers forge system account authority to execute governance operations and protocol upgrades? (Critical)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Line 17-21: create_signer registration] [Capability Bypass] Can the native create_signer function bypass Move's capability-based security model, allowing creation of signers without holding proper capability objects required by framework access control policies? (Critical)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Function: all_natives()] [Bytecode Verification] Are native function calls from Move bytecode properly verified during module publishing to ensure they only call registered natives preventing invocation of arbitrary native code? (Critical)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [All native registrations] [VM State Corruption] Can native functions modify VM internal state in ways that violate Move semantics, such as creating dangling references or breaking resource invariants causing type safety violations? (Critical)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [All native registrations] [Serialization Safety] When native functions return values to Move code, are all returned Value objects properly serialized according to Move's value representation preventing memory corruption? (High)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Line 15-42: natives array] [Module Visibility] Are these native functions properly scoped to their declaring modules (DiemAccount, Signature, Account), or can Move code from other modules directly invoke these natives bypassing module-level access controls? (Critical)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Line 17-21 & 38-41: duplicate create_signer] [Inconsistent Behavior] Since both DiemAccount::create_signer and Account::create_signer call the same implementation, can differences in calling context or module permissions create security holes when the same operation has different access patterns? (High)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Function: all_natives()] [Protocol Upgrade Safety] During on-chain framework upgrades, if new native functions are added to the array or existing ones modified, are validators guaranteed to update atomically preventing consensus divergence during the upgrade window? (Critical)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Line 15-42: natives array] [Backward Compatibility] If native function signatures change in future versions, can old transactions that reference previous signatures still execute correctly, or will they fail causing historical transaction replay issues? (High)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Function: all_natives()] [Framework Address Migration] If the framework address changes during a migration (e.g., from legacy Diem addresses to new Aptos addresses), can the native table be safely re-bound without breaking existing contract dependencies? (High)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Line 34-36: ed25519_verify registration] [Gas Griefing] Can an attacker create transactions that call ed25519_verify repeatedly with maximum-size inputs to consume excessive gas in a single transaction, griefing other users by filling blocks with expensive operations? (Medium)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [All native registrations] [Gas Price Manipulation] Could inconsistent gas costs between validators (due to platform differences) allow attackers to craft transactions that are accepted by some validators but rejected by others, causing consensus deadlock? (Critical)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Line 34-36: ed25519_verify registration] [Cache Timing] Does signature verification access memory in patterns dependent on secret key bits, allowing cache timing attacks that leak validator private keys through statistical analysis of execution patterns? (High)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Line 29-31: ed25519_validate_pubkey registration] [Power Analysis] Can power consumption or electromagnetic emissions during public key validation leak information about key material or enable side-channel attacks on validator hardware? (Medium)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [All native registrations] [Gas Calculation Overflow] In gas cost formulas like 26*len or 62*len, can integer overflow occur with extremely large input lengths causing gas to wrap around to very small values enabling cheap DoS attacks? (High)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Line 34-36: ed25519_verify registration] [Length Calculation] When computing gas based on message length, are length calculations overflow-safe, or can carefully crafted input sizes cause arithmetic errors leading to incorrect gas charging? (High)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Line 5: signature module] [Cryptographic Library Trust] Does the registered signature verification rely on audited cryptographic libraries (diem_crypto), or could vulnerabilities in upstream dependencies compromise signature verification allowing forgeries? (Critical)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Line 8-11: move_vm_runtime imports] [VM Runtime Vulnerabilities] Could bugs in the move_vm_runtime's native function dispatch mechanism allow bypassing the registered native table to directly execute arbitrary native code? (Critical)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [All native registrations] [Non-Deterministic Operations] Do any registered native functions perform non-deterministic operations (random number generation, timestamp access, floating-point math) that could cause validators to compute different results? (Critical)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [Line 34-36: ed25519_verify registration] [Library Version Divergence] If different validators use different versions of the ed25519 library with subtle behavioral differences, could signature verification results diverge causing consensus failure? (Critical)",
  "[File: third_party/move/move-examples/diem-framework/crates/natives/src/lib.rs] [All native registrations] [Reentrancy Protection] Can Move code call back into the native layer while a native function is executing, creating reentrancy scenarios that violate safety invariants or cause stack exhaustion? (High)"
]