[
  "[File: network/discovery/src/lib.rs] [Function: validator_set()] [Key Validation Bypass] Can a malicious actor provide a manipulated expected_pubkey parameter that differs from the node's actual identity, allowing them to bypass key mismatch detection and connect as a validator without proper authentication? (Critical)",
  "[File: network/discovery/src/lib.rs] [Function: validator_set()] [Reconfig Manipulation] Can an attacker craft malicious ReconfigNotificationListener events that inject fake validator set updates, potentially adding unauthorized peers to the connectivity manager and enabling eclipse attacks? (Critical)",
  "[File: network/discovery/src/lib.rs] [Function: validator_set()] [Network Context Spoofing] Is the network_context properly validated to prevent an attacker from creating a discovery listener with a spoofed NetworkContext, potentially allowing unauthorized access to validator-only networks? (High)",
  "[File: network/discovery/src/lib.rs] [Function: validator_set()] [Channel Poisoning] Can an attacker fill the update_channel with malicious ConnectivityRequest messages before legitimate validator_set() initialization, causing the channel to reject valid discovery updates? (High)",
  "[File: network/discovery/src/lib.rs] [Function: file()] [Path Traversal] Can an attacker exploit the file_path parameter to read arbitrary YAML files outside the intended discovery directory, potentially loading malicious peer configurations that inject attacker-controlled nodes? (High)",
  "[File: network/discovery/src/lib.rs] [Function: file()] [Symlink Attack] Does file() properly validate that file_path is not a symlink to a sensitive file, which could allow an attacker to monitor or manipulate the discovery process by controlling the target file? (Medium)",
  "[File: network/discovery/src/lib.rs] [Function: file()] [TOCTOU Race] Is there a time-of-check-time-of-use vulnerability where the file_path validation check passes but the file is replaced with a malicious configuration before FileStream reads it? (Medium)",
  "[File: network/discovery/src/lib.rs] [Function: file()] [Interval Manipulation] Can setting an extremely small interval_duration (e.g., 1 nanosecond) cause resource exhaustion by triggering continuous file reads, potentially degrading validator performance and affecting consensus participation? (High)",
  "[File: network/discovery/src/lib.rs] [Function: file()] [Zero Interval Attack] What happens if interval_duration is set to Duration::ZERO? Does this cause an infinite loop in FileStream polling that could halt the discovery process? (High)",
  "[File: network/discovery/src/lib.rs] [Function: rest()] [URL Injection] Can an attacker provide a malicious rest_url pointing to an attacker-controlled server that returns crafted ValidatorSet responses, injecting Byzantine nodes into the peer list? (Critical)",
  "[File: network/discovery/src/lib.rs] [Function: rest()] [SSRF Attack] Does rest() validate the rest_url to prevent Server-Side Request Forgery attacks where internal network endpoints could be probed or accessed through the REST client? (High)",
  "[File: network/discovery/src/lib.rs] [Function: rest()] [DNS Rebinding] Can an attacker exploit DNS rebinding by providing a rest_url that initially resolves to a legitimate address but later changes to an attacker-controlled IP, allowing injection of malicious peer data? (High)",
  "[File: network/discovery/src/lib.rs] [Function: rest()] [TLS Bypass] Is the RestStream properly configured to validate TLS certificates, or can an attacker perform MITM attacks by intercepting the REST API responses and injecting fake validator sets? (Critical)",
  "[File: network/discovery/src/lib.rs] [Function: rest()] [Response Tampering] Does the RestStream verify cryptographic signatures or merkle proofs on the ValidatorSet response, or can an attacker serving the REST API inject arbitrary peer information? (Critical)",
  "[File: network/discovery/src/lib.rs] [Function: start()] [Executor Exhaustion] Can an attacker repeatedly call start() to spawn multiple discovery tasks on the executor, causing resource exhaustion that impacts validator consensus participation? (High)",
  "[File: network/discovery/src/lib.rs] [Function: start()] [Panic Propagation] If the run() task panics, does it properly clean up resources or does the panic leave the discovery system in an inconsistent state where new peers cannot be discovered? (Medium)",
  "[File: network/discovery/src/lib.rs] [Function: start()] [Duplicate Spawning] What prevents start() from being called multiple times on the same DiscoveryChangeListener instance, potentially creating race conditions where multiple tasks send conflicting peer updates? (Medium)",
  "[File: network/discovery/src/lib.rs] [Function: run()] [Channel Blocking] In the run() loop, if update_channel.try_send() repeatedly fails, does the discovery stream continue processing or does it block, potentially causing the validator to miss critical peer updates during epoch transitions? (High)",
  "[File: network/discovery/src/lib.rs] [Function: run()] [Error Recovery] When source_stream.next().await returns an error, the loop continues after logging. Can an attacker cause persistent errors that fill logs while preventing legitimate peer discovery, creating a silent failure mode? (High)",
  "[File: network/discovery/src/lib.rs] [Function: run()] [Stream Termination] When source_stream returns None and the loop exits, is there any mechanism to detect and restart the discovery process, or does the validator permanently lose peer discovery capability? (Critical)",
  "[File: network/discovery/src/lib.rs] [Function: run()] [Update Ordering] Does run() guarantee ordering of peer updates when multiple updates arrive rapidly? Could out-of-order processing cause a validator to connect to stale or malicious peers? (High)",
  "[File: network/discovery/src/lib.rs] [Function: run()] [Clone Safety] The update_channel is cloned in run(). If the original sender is dropped while run() holds a clone, could this create a situation where discovery updates cannot reach the connectivity manager? (Medium)",
  "[File: network/discovery/src/lib.rs] [Function: run()] [Send Failure Loop] If send failures increment DISCOVERY_COUNTS but never trigger recovery logic, can an attacker cause persistent send failures that silently disable discovery while metrics indicate 'normal' operation? (High)",
  "[File: network/discovery/src/lib.rs] [Function: run()] [Partial Update] When update_channel.try_send() returns Err but the message was partially written to the channel buffer, could this lead to corrupted ConnectivityRequest messages that cause the connectivity manager to crash? (High)",
  "[File: network/discovery/src/lib.rs] [Enum: DiscoveryChangeStream] [Type Confusion] Can an attacker exploit type confusion by causing poll_next() to be called on a different variant than expected, potentially bypassing variant-specific security checks? (Medium)"
]