[
  "[File: types/src/on_chain_config/aptos_version.rs] [Const: APTOS_MAX_KNOWN_VERSION] [Validator Divergence] If different validator binaries have different APTOS_MAX_KNOWN_VERSION values due to incomplete upgrades, can this cause network partition where upgraded validators accept transactions that outdated validators reject? (Critical)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Version Check] [EntryFunction Bypass] Can attackers craft transactions that exploit inconsistent version checks between mempool and execution to submit EntryFunction payloads before APTOS_VERSION_2 is active, bypassing security restrictions? (Critical)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Version Check] [Multi-agent Race] If version is checked once at transaction validation but changes to version 3 before execution, can this race condition allow multi-agent transactions to execute in wrong version context causing security violations? (High)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Version Check] [Downgrade Attack] Can an attacker exploit the Move module's version.move set_for_next_epoch() to downgrade from version 4 to version 3, despite the assertion checking old_major < major, by overflowing the major field or exploiting integer arithmetic bugs? (Critical)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Version Check] [TOCTOU Race] Time-of-check-time-of-use: can the version change between validation and execution phases of a transaction, causing feature-gated operations to execute in wrong version context and violate security invariants? (High)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Version Check] [Cache Inconsistency] If validators cache AptosVersion and fail to invalidate cache after epoch transition, can stale version data cause them to apply wrong feature gates and diverge from consensus? (Critical)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Epoch Transition] [Version Update Atomicity] During epoch transition when version.move on_new_epoch() updates the Version resource, can race conditions cause some validators to see old version while others see new version, forking the network? (Critical)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Epoch Transition] [Partial Upgrade] If version upgrade via config_buffer fails halfway through epoch transition, can the network end up in inconsistent state with some validators on new version and others on old version? (Critical)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Epoch Transition] [Reconfiguration DOS] Can an attacker repeatedly trigger version updates through governance to force continuous epoch reconfigurations, preventing normal transaction processing and causing network unavailability? (High)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Epoch Transition] [Transaction Replay] When version changes during epoch boundary, can transactions valid in old version be replayed in new version with different semantics, causing double-spending or unauthorized operations? (Critical)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Epoch Transition] [Validator Desync] If validators have different network latencies and receive the version update at different times during epoch transition, can this cause temporary consensus failures until all validators converge? (High)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Governance] [Unauthorized Version Update] Does the OnChainConfig implementation for AptosVersion properly enforce that only the aptos_framework account with SetVersionCapability can update version, or can privilege escalation allow unauthorized updates? (Critical)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Governance] [Governance Bypass] Can an attacker exploit the version.move module's set_version() or set_for_next_epoch() functions to bypass the assertion that old_major < major through integer overflow or type confusion? (Critical)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Governance] [Capability Theft] If the SetVersionCapability resource is somehow moved or copied through Move VM vulnerabilities, can unauthorized accounts gain ability to arbitrarily change protocol version? (Critical)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Governance] [Proposal Manipulation] Can malicious governance proposals that update version to malicious values (e.g., u64::MAX or 0) pass voting and execution despite validation checks in version.move? (High)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Governance] [Emergency Downgrade] In case of critical vulnerability in version 4, can the protocol safely downgrade to version 3, or does the strict old_major < major check prevent necessary emergency rollbacks? (High)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Version Migration] [State Migration] When upgrading from APTOS_VERSION_3 to APTOS_VERSION_4, is there proper migration logic for existing state, or can inconsistent state cause transaction execution failures in the new version? (High)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Version Migration] [Transaction Format] Can transactions serialized in version 2 format be incorrectly accepted in version 4 due to insufficient version checks, allowing deprecated transaction types to bypass new security restrictions? (High)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Version Migration] [Feature Flag Confusion] If feature flags are derived from AptosVersion comparisons, can off-by-one errors in version checks cause features to activate one version too early or too late? (Medium)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Version Migration] [Backward Incompatibility] Can protocol changes gated by new versions introduce backward-incompatible behaviors that cause replaying historical transactions during sync to produce different state than original execution? (High)",
  "[File: types/src/on_chain_config/aptos_version.rs] [Version Migration] [Upgrade Path Validation] Does the system validate that version upgrades follow a specific path (2→3→4), or can jumping versions skip critical migration logic causing state corruption? (High)",
  "[File: types/src/on_chain_config/aptos_version.rs] [State Storage] [Persistence Failure] If writing updated AptosVersion to state store fails during epoch transition but transaction commits, can this cause permanent version inconsistency where on-chain code believes version changed but Rust code sees old version? (Critical)",
  "[File: types/src/on_chain_config/aptos_version.rs] [State Storage] [Merkle Tree Corruption] Can corrupted version data in the Jellyfish Merkle tree cause validators to derive different state roots, leading to consensus failure and chain split? (Critical)",
  "[File: types/src/on_chain_config/aptos_version.rs] [State Storage] [Cache Poisoning] If the AptosVersion is cached in validator memory, can an attacker poison the cache with incorrect version data through race conditions or memory corruption to cause feature gating failures? (High)",
  "[File: types/src/on_chain_config/aptos_version.rs] [State Storage] [Storage Corruption] Can database corruption or bit flips in the stored major field value cause validators to load corrupted version data and apply wrong feature gates? (High)"
]