[
  "[File: aptos-core/api/src/runtime.rs] [Function: bootstrap()] [Resource exhaustion] Can an attacker manipulate the max_runtime_workers value through config to spawn excessive worker threads, causing memory exhaustion and API node crash affecting network availability? (High)",
  "[File: aptos-core/api/src/runtime.rs] [Function: bootstrap()] [Race condition] Does the runtime spawning at line 52 properly handle concurrent bootstrap() calls, or could simultaneous initialization attempts create multiple conflicting runtimes causing API inconsistencies? (Medium)",
  "[File: aptos-core/api/src/runtime.rs] [Function: bootstrap()] [Context poisoning] Can a malicious node config inject a compromised Context at line 54 that serves falsified blockchain state through the API, causing clients to accept invalid transactions or state? (Critical)",
  "[File: aptos-core/api/src/runtime.rs] [Function: bootstrap()] [Information disclosure] Does the attach_poem_to_runtime call at line 56 properly sanitize error messages, or can internal database/mempool errors leak sensitive validator information to API clients? (Medium)",
  "[File: aptos-core/api/src/runtime.rs] [Function: bootstrap()] [Deadlock] Can the oneshot channel port_tx at line 49 deadlock if the receiver is dropped before sending, causing the bootstrap process to hang and prevent API startup? (Medium)",
  "[File: aptos-core/api/src/runtime.rs] [Function: bootstrap() - gas estimation task] [Integer overflow] In the periodic gas estimation task at lines 60-81, can the period_ms configuration be set to 0 or extremely small values causing the interval.tick() to spin infinitely and consume 100% CPU? (High)",
  "[File: aptos-core/api/src/runtime.rs] [Function: bootstrap() - gas estimation task] [Panic propagation] At line 78, the unwrap_or(()) silently ignores panics in spawn_blocking - can this hide critical gas estimation failures that should halt the API to prevent serving incorrect gas prices? (Medium)",
  "[File: aptos-core/api/src/runtime.rs] [Function: bootstrap() - gas estimation task] [Race condition] Does the tokio::task::spawn_blocking at line 66 properly synchronize with the main runtime, or can concurrent gas estimations cause data races when accessing context_cloned? (High)",
  "[File: aptos-core/api/src/runtime.rs] [Function: bootstrap() - gas estimation task] [Resource leak] If get_latest_ledger_info() at lines 67-68 repeatedly fails, does the task continue spawning blocking tasks indefinitely causing thread pool exhaustion? (Medium)",
  "[File: aptos-core/api/src/runtime.rs] [Function: bootstrap() - gas estimation task] [State inconsistency] Can the gas_estimation result at line 70-72 be stale or inconsistent with the actual ledger state, causing clients to submit transactions with incorrect gas prices that get rejected? (Low)",
  "[File: aptos-core/api/src/runtime.rs] [Function: bootstrap() - function stats task] [Integer overflow] In the periodic function stats task at lines 84-98, can period_sec be set to 0 causing immediate continuous execution and CPU exhaustion? (Medium)",
  "[File: aptos-core/api/src/runtime.rs] [Function: bootstrap() - function stats task] [Memory leak] Do the view_function_stats() and simulate_txn_stats() at lines 91-92 properly clear their internal state, or can they accumulate unbounded statistics causing memory exhaustion over time? (Medium)",
  "[File: aptos-core/api/src/runtime.rs] [Function: bootstrap() - function stats task] [Panic propagation] Similar to gas estimation, does the unwrap_or(()) at line 95 hide critical failures in stats collection that could indicate API malfunction? (Low)",
  "[File: aptos-core/api/src/runtime.rs] [Function: bootstrap()] [Configuration injection] Can a malicious operator modify the NodeConfig to disable critical security features (TLS, compression, size limits) before passing it to bootstrap()? (Critical)",
  "[File: aptos-core/api/src/runtime.rs] [Function: bootstrap()] [Chain ID spoofing] Can the chain_id parameter at line 45 be manipulated to make the API serve transactions for a different network, causing clients to broadcast transactions to the wrong chain? (Critical)",
  "[File: aptos-core/api/src/runtime.rs] [Function: get_max_runtime_workers()] [Integer overflow] At line 296, can the multiplication num_cpus::get() * api_config.runtime_worker_multiplier overflow when multiplier is set to a large value, wrapping to a small number and causing severe API throughput degradation? (Medium)",
  "[File: aptos-core/api/src/runtime.rs] [Function: get_max_runtime_workers()] [Resource exhaustion] Can an attacker set runtime_worker_multiplier to an extremely large value (e.g., 10000) causing the API to spawn thousands of worker threads and crash the node? (High)",
  "[File: aptos-core/api/src/runtime.rs] [Function: get_max_runtime_workers()] [Denial of service] If max_runtime_workers is explicitly set to 1 in config, does this create a single-threaded API that can be easily blocked by a single slow request? (Medium)",
  "[File: aptos-core/api/src/runtime.rs] [Function: get_max_runtime_workers()] [Zero workers] Can the configuration result in 0 workers being spawned, causing complete API unavailability? (High)",
  "[File: aptos-core/api/src/runtime.rs] [Function: get_api_service()] [Context reuse] Does cloning the Arc<Context> at lines 128-148 properly increment reference counts, or can premature drops cause use-after-free when API handlers access the context? (Critical)",
  "[File: aptos-core/api/src/runtime.rs] [Function: get_api_service()] [API injection] Can a malicious actor replace one of the API structs (AccountsApi, TransactionsApi, etc.) at lines 127-149 with a compromised implementation that serves false data? (Critical)",
  "[File: aptos-core/api/src/runtime.rs] [Function: get_api_service()] [Version spoofing] Can the VERSION string at line 151 be manipulated to report incorrect API version, causing clients to use incompatible features or bypass version-based security checks? (Low)",
  "[File: aptos-core/api/src/runtime.rs] [Function: get_api_service()] [Metadata injection] Can the OpenAPI metadata (license, contact, description) at lines 152-162 be exploited to inject malicious links or XSS payloads that execute in API documentation browsers? (Low)",
  "[File: aptos-core/api/src/runtime.rs] [Function: get_api_service()] [Server path manipulation] Can the .server(\\",
  "[File: aptos-core/api/src/runtime.rs] [Function: attach_poem_to_runtime()] [TLS bypass] At lines 192-211, if only tls_cert_path is provided but tls_key_path is None (or vice versa), does the API silently fall back to non-TLS mode exposing all traffic in plaintext? (Critical)"
]