[
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: Capability] [Pool_address forgery] Can a malicious actor create a Capability struct with an arbitrary pool_address that doesn't correspond to a real stake pool, which if deserialized from on-chain state could cause Rosetta to query non-existent pools? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: StakingContract] [Owner_cap duplication] Does Rosetta validate that owner_cap and signer_cap in StakingContract point to the same pool_address, or can they point to different pools, causing confusion about which pool the capabilities control? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: DelegationPool] [Stake_pool_signer_cap mismatch] Can the stake_pool_signer_cap in DelegationPool reference a different pool than the DelegationPool itself is managing, enabling capability confusion attacks where delegation operations affect unrelated stake pools? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: SharesPool] [Scaling_factor manipulation] Can scaling_factor be set to 0 or u64::MAX in SharesPool, causing share-to-coin conversions to overflow or divide by zero, disrupting all delegation pool balance calculations exposed through Rosetta? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: SharesPool] [Shares-coins ratio] If total_shares is much larger than total_coins in SharesPool, does the shares-to-coins conversion lose precision to the point where small shareholders show 0 balance, enabling dust attack that makes delegations appear valueless? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: DelegationPool] [Active vs inactive inconsistency] Can total_coins_inactive plus the coins in active_shares exceed the actual stake pool balance, indicating double-counting that Rosetta would report as inflated total value locked (TVL)? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: DelegationPool] [Pending_withdrawals staleness] Does pending_withdrawals vector properly prune completed withdrawals, or can it grow unbounded with stale entries, causing Rosetta to report pending funds that were already withdrawn, misleading liquidity calculations? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: ObservedLockupCycle] [Index overflow] Can the index field in ObservedLockupCycle overflow to wrap around, causing lockup cycle confusion where cycle 0 and cycle u64::MAX are treated as the same, breaking lockup period enforcement? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Function: Pool.get_balance()] [Linear search DoS] Does the iter().find() in shares vector scale linearly with number of shareholders, allowing an attacker to create pools with millions of shareholders to cause get_balance() to timeout when called via Rosetta API? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: Store] [Staking_contracts vector] Can the staking_contracts vector in Store grow unbounded, and does Rosetta iterate through all contracts when querying, allowing an attacker to create thousands of contracts to DoS the Rosetta balance query endpoint? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: DelegationPool] [Inactive_shares vector] Can inactive_shares vector contain hundreds of historical lockup cycles, each with large SharesPool structs, causing memory exhaustion when Rosetta deserializes and processes delegation pool state? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: Pool] [Total shares mismatch] Can the sum of individual shares in the shares vector differ from total_shares field, causing get_balance() to use incorrect denominator and report wrong balances to all shareholders? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: StakingContract] [Principal-pool mismatch] Can the principal field in StakingContract be less than the actual staked amount in the pool_address referenced pool, hiding additional staked funds from commission calculations and enabling operator theft? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: CreateStakingContractEvent] [Principal-commission inconsistency] If commission_percentage is 100 in CreateStakingContractEvent, does this mean operator gets all rewards, and if principal is also 0, can this be exploited to create phantom staking contracts with no actual stake? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: UpdateVoterEvent] [Voter validation] Does Rosetta validate that new_voter address in UpdateVoterEvent is different from old_voter, or can redundant voter update events be used to spam event logs and obscure actual governance changes? (Low)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Struct: AddDistributionEvent] [Amount tracking] Can the sum of AddDistributionEvent amounts exceed the actual distribution_pool total_coins in StakingContract, indicating phantom distributions that Rosetta would report as legitimate reward flows? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: ACCOUNT_MODULE] [Module namespace] Do Rosetta queries properly prepend '0x1::' or '0x3::' to ACCOUNT_MODULE constant, or can modules in user accounts match the string 'account' and be incorrectly parsed as core Account module? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: COIN_STORE_RESOURCE] [Generic type confusion] Since CoinStore is generic (CoinStore<AptosCoin>), does Rosetta properly handle the type parameter, or can CoinStore<FakeCoin> be queried as if it were AptosCoin balance? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: DELEGATION_POOL_MODULE] [Module versioning] If delegation_pool module is upgraded on-chain with breaking changes, does Rosetta using the old DELEGATION_POOL_MODULE constant fail gracefully or attempt to deserialize incompatible struct layouts? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: FUNGIBLE_ASSET_MODULE] [Asset type switching] Can transactions use TRANSFER_FUNGIBLE_ASSETS_FUNCTION to transfer non-fungible assets by exploiting type erasure in the constant string, bypassing fungibility checks? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: OBJECT_RESOURCE_GROUP] [Resource group confusion] Does OBJECT_RESOURCE_GROUP constant properly distinguish between ObjectGroup containing different object types, or can querying one object type return mixed results from the resource group? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: DECIMALS_FIELD] [Typo exploitation] The constant is 'decimal' (singular) but typical field name is 'decimals' - can this mismatch cause Rosetta to fail parsing decimal places for coins, defaulting to 0 decimals and showing wrong amounts? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: DEPOSIT_EVENTS_FIELD] [Event handle swapping] Can an attacker swap deposit_events and withdraw_events EventHandles in a CoinStore, causing Rosetta to report deposits as withdrawals and vice versa, completely inverting transaction history? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: SEQUENCE_NUMBER_FIELD] [Nonce confusion] Does Rosetta use SEQUENCE_NUMBER_FIELD to validate transaction ordering, and can malformed accounts with duplicate sequence numbers cause transaction replay detection to fail? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/types/move_types.rs] [Constant: SYMBOL_FIELD] [Symbol injection] Can a malicious coin set symbol field to 'APT' or other reserved symbols, causing Rosetta to misclassify the token type and show it as native APT in exchange listings? (High)"
]