[
  "[File: network/discovery/src/lib.rs] [Function: poll_next() for DiscoveryChangeStream] [Pin Safety] Does the get_mut() call on Pin<&mut Self> violate pinning guarantees, potentially causing memory unsafety if the underlying stream types have Drop implementations that assume pinning? (High)",
  "[File: network/discovery/src/lib.rs] [Function: poll_next() for DiscoveryChangeStream] [Variant Exhaustion] If one variant (e.g., ValidatorSet) consistently returns Poll::Pending, does this prevent other variants from being polled, creating a denial of service? (Medium)",
  "[File: network/discovery/src/lib.rs] [Enum: DiscoveryError] [Error Information Leak] Do the error variants (IO, Parsing, Rest) leak sensitive information in their Debug formatting that could help attackers understand internal system state? (Low)",
  "[File: network/discovery/src/lib.rs] [Enum: DiscoveryError] [Panic on Unwrap] Are there code paths that unwrap() Result<PeerSet, DiscoveryError> without handling errors, potentially causing the discovery task to panic and terminate? (Medium)",
  "[File: network/discovery/src/lib.rs] [Integration: ValidatorSetStream] [Key Mismatch Race] When ValidatorSetStream detects a key mismatch via find_key_mismatches(), is there a race condition where the node continues to participate in consensus with mismatched keys before being removed? (Critical)",
  "[File: network/discovery/src/lib.rs] [Integration: ValidatorSetStream] [Reconfig Replay] Can an attacker replay old ReconfigNotification events to ValidatorSetStream, causing the validator to revert to an old validator set and potentially double-sign? (Critical)",
  "[File: network/discovery/src/lib.rs] [Integration: ValidatorSetStream] [Payload Deserialization] When extract_updates() calls payload.get().expect(), can a malformed payload cause a panic that terminates the discovery process, preventing the validator from discovering new peers? (High)",
  "[File: network/discovery/src/lib.rs] [Integration: ValidatorSetStream] [Validator Set Injection] Can an attacker manipulate the OnChainConfigPayload to inject fake validators into extract_validator_set_updates(), bypassing on-chain validation? (Critical)",
  "[File: network/discovery/src/lib.rs] [Integration: ValidatorSetStream] [Network Address Parsing] When extract_validator_set_updates() parses network addresses, can malformed addresses cause parsing errors that are silently ignored (unwrap_or_default), allowing validators with invalid addresses to be included? (High)",
  "[File: network/discovery/src/lib.rs] [Integration: ValidatorSetStream] [PeerRole Confusion] Can an attacker manipulate the is_validator flag in extract_validator_set_updates() to cause full nodes to be treated as validators or vice versa, breaking network segmentation? (Critical)",
  "[File: network/discovery/src/lib.rs] [Integration: FileStream] [YAML Deserialization Attack] Can an attacker craft a malicious YAML file with deeply nested structures that cause serde_yaml::from_str() to exhaust stack space and crash the discovery process? (High)",
  "[File: network/discovery/src/lib.rs] [Integration: FileStream] [YAML Bomb] Can the file-based discovery be exploited with a YAML bomb (e.g., billion laughs attack) that expands to massive size during parsing, causing memory exhaustion? (High)",
  "[File: network/discovery/src/lib.rs] [Integration: FileStream] [File Locking] Does FileStream properly handle file locks when reading? Can an attacker hold a write lock on the discovery file to block FileStream.poll_next() indefinitely? (Medium)",
  "[File: network/discovery/src/lib.rs] [Integration: FileStream] [Partial Write] If the discovery file is being written when FileStream reads it, can partial/corrupted YAML be parsed, potentially injecting malformed peer data? (High)",
  "[File: network/discovery/src/lib.rs] [Integration: FileStream] [Interval Drift] Does the interval timer in FileStream account for the time spent processing the file? Can slow file reads cause interval drift that impacts timely peer discovery? (Low)",
  "[File: network/discovery/src/lib.rs] [Integration: RestStream] [Blocking in Async] RestStream uses block_on() inside poll_next(). Can this block the async executor thread, preventing other critical tasks (like consensus) from making progress? (Critical)",
  "[File: network/discovery/src/lib.rs] [Integration: RestStream] [REST Client Timeout] Does the REST client have proper timeouts? Can a slow or unresponsive REST API cause RestStream.poll_next() to hang indefinitely? (High)",
  "[File: network/discovery/src/lib.rs] [Integration: RestStream] [Response Size Attack] Can an attacker serving the REST API send extremely large ValidatorSet responses that consume excessive memory during BCS deserialization? (High)",
  "[File: network/discovery/src/lib.rs] [Integration: RestStream] [Account Resource Injection] The REST query targets AccountAddress::ONE with resource '0x1::stake::ValidatorSet'. Can an attacker exploit this by deploying malicious contracts that return fake ValidatorSet data? (Critical)",
  "[File: network/discovery/src/lib.rs] [Integration: RestStream] [BCS Deserialization] When get_account_resource_bcs::<ValidatorSet>() deserializes the response, can malicious BCS encoding cause undefined behavior or panic during ValidatorSet construction? (High)",
  "[File: network/discovery/src/lib.rs] [Concurrency: run()] [Channel Race] If multiple threads call methods on DiscoveryChangeListener concurrently, can race conditions occur in the channel sending logic that causes messages to be lost or duplicated? (High)",
  "[File: network/discovery/src/lib.rs] [Concurrency: start()] [Move Semantics] Since start() consumes self by taking ownership, can an attacker exploit use-after-move bugs if they retain references to the DiscoveryChangeListener after start() is called? (Low)",
  "[File: network/discovery/src/lib.rs] [Concurrency: stream polling] [Poll Reentrancy] Can poll_next() on DiscoveryChangeStream be called reentrantly from different tasks? If so, does this create race conditions in the underlying stream state? (Medium)",
  "[File: network/discovery/src/lib.rs] [Network Partition: ValidatorSet discovery] [Stale Validator Set] If the on-chain validator set update is delayed due to network partition, can validators continue operating with a stale peer list, potentially missing new validators and breaking consensus quorum? (Critical)",
  "[File: network/discovery/src/lib.rs] [Network Partition: File discovery] [Out-of-Band Update] If file-based discovery is used during a network partition, can an attacker with filesystem access inject malicious peers that partition the network further? (High)"
]