[
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: get_chain_id()] [Chain ID manipulation] Can a malicious API server return an incorrect chain_id that causes transactions to be signed for the wrong network, allowing cross-chain replay attacks and potential fund loss? (High)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: build_and_submit_transaction()] [Sequence number race] Does the function fetch the sequence number atomically with transaction submission, or can a race condition cause two transactions to use the same sequence number, leading to one being rejected and potential transaction ordering issues? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: build_and_submit_transaction()] [Gas price manipulation] Can an attacker exploit the gas_unit_price parameter to set extremely low values that cause transactions to never be processed, resulting in DoS or to set extremely high values causing excessive fund drainage? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: build_and_submit_transaction()] [Max gas overflow] Can the max_gas_amount parameter overflow when multiplied with gas_unit_price, potentially causing integer overflow and incorrect gas fee calculation leading to underpayment? (High)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: build_and_submit_transaction()] [Timeout expiration] Does the timeout_secs properly validate bounds, or can an attacker set it to 0 or u64::MAX causing transactions to either expire immediately or never expire, breaking transaction liveness guarantees? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: build_and_submit_transaction()] [Account mutation race] Is the LocalAccount mutation (sequence number increment) thread-safe, or can concurrent calls to this function from multiple threads cause sequence number desynchronization and transaction failures? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: create_collection()] [Collection name injection] Can an attacker inject special characters or control bytes into the collection name that bypass validation in the Move module, potentially creating invalid collections or exploiting parser vulnerabilities? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: create_collection()] [Description length attack] Does the description field have length limits, or can an attacker pass an extremely large description string causing excessive gas consumption, state bloat, or out-of-memory conditions? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: create_collection()] [URI validation bypass] Is the URI field validated for format correctness, or can an attacker inject malicious URIs (javascript:, data:, etc.) that exploit client-side vulnerabilities when metadata is fetched? (Low)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: create_collection()] [Maximum supply overflow] Can the max_amount parameter be set to u64::MAX, and does the underlying Move module properly handle this edge case without allowing unlimited minting beyond stated maximum? (High)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: create_collection()] [Mutability config bypass] The mutate_setting is hardcoded to [false, false, false] - can an attacker modify this before encoding to enable mutability and later alter supposedly immutable collection properties? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: create_collection()] [Duplicate collection attack] Does the function check if a collection with the same name already exists for this creator, or can an attacker create multiple collections with identical names causing state confusion? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: create_token()] [Supply manipulation] Can an attacker set the supply parameter higher than max_amount, violating the maximum token constraint and allowing over-minting of tokens? (Critical)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: create_token()] [Royalty denominator zero] When royalty_points_denominator is set to 0 in RoyaltyOptions, does this cause division-by-zero errors during royalty calculations in the Move module, potentially halting all transfers? (High)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: create_token()] [Royalty overflow] Can royalty_points_numerator exceed royalty_points_denominator, allowing creators to set >100% royalty rates that drain more value than the token's worth during transfers? (High)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: create_token()] [Payee address validation] Does the function validate that royalty payee_address is not a system address (0x0, 0x1, 0x3, etc.) that could break royalty distribution or lock funds permanently? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: create_token()] [Collection name mismatch] Can an attacker reference a non-existent collection_name, and does the Move module properly reject this or create orphaned tokens? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: create_token()] [Token name collision] Can multiple tokens with the same name be created in the same collection, causing lookup ambiguity and potential token theft through confused deputy attacks? (High)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: create_token()] [Property arrays mismatch] The property_keys, property_values, and property_types are empty vectors - can an attacker provide mismatched array lengths that cause index out-of-bounds errors in the Move module? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: create_token()] [Mutability vector length] The mutate_setting has 5 boolean values - is this length validated, or can truncation/extension of this vector bypass intended mutability constraints? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: create_token()] [Zero supply tokens] Can tokens be created with supply=0 but max_amount>0, creating a zombie token state that cannot be minted and blocks the namespace? (Low)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: get_collection_data_handle()] [Resource existence check] Does the function properly distinguish between a missing Collections resource and an API error, potentially masking critical failures that should halt execution? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: get_collection_data_handle()] [Handle format injection] The handle is extracted as a string - can a malicious API server inject an invalid handle format that causes AccountAddress::from_hex_literal to panic or parse incorrectly? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: get_collection_data_handle()] [Type confusion] Does the function validate that the handle points to the correct table type, or can an attacker substitute a handle to a different table type causing type confusion attacks? (High)",
  "[File: aptos-core/crates/aptos-api-tester/src/tokenv1_client.rs] [Function: get_token_data_handle()] [Handle reuse attack] Can an attacker reuse a collection_data handle as a token_data handle, causing the wrong table to be queried and returning invalid data? (Medium)"
]