[
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Constant: MAX_DISTANCE_FROM_VALIDATORS] [Integer boundary] Can a malicious peer report distance_from_validators exactly equal to MAX_DISTANCE_FROM_VALIDATORS (100) to bypass health checks in mempool prioritization, allowing severely lagging or isolated nodes to be treated as valid peers for transaction forwarding? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Constant: MAX_DISTANCE_FROM_VALIDATORS] [Network partitioning] If all honest peers are exactly MAX_DISTANCE_FROM_VALIDATORS hops away from validators, can an attacker exploit the boundary condition to cause nodes to incorrectly calculate their own distance, potentially leading to network partition where nodes refuse to sync from legitimate peers? (Critical)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Constant: MAX_DISTANCE_FROM_VALIDATORS] [Consensus manipulation] Can Byzantine validators collude to report manipulated distance values approaching MAX_DISTANCE_FROM_VALIDATORS to force fullnodes to deprioritize honest validator connections, degrading consensus observer subscription quality and causing stale state propagation? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Constant: MAX_DISTANCE_FROM_VALIDATORS] [Integer overflow] In distance calculation logic that adds 1 to peer-reported distances, can MAX_DISTANCE_FROM_VALIDATORS overflow when incremented, wrapping to 0 and causing nodes to incorrectly believe they're directly connected to validators when they're actually at maximum distance? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Enum: PeerMonitoringServiceError] [Error handling bypass] Can an attacker craft requests that trigger InternalError with carefully constructed error strings containing malicious payloads (e.g., format string attacks, log injection) that get propagated to monitoring systems, potentially compromising log analysis infrastructure? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Enum: PeerMonitoringServiceError] [Information disclosure] Does the InvalidRequest error variant leak sensitive internal state information through error messages that could help attackers map the network topology, identify validator nodes, or discover configuration weaknesses for targeted attacks? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Enum: PeerMonitoringServiceError] [Serialization] When PeerMonitoringServiceError is serialized via BCS and sent over the network, can an attacker cause denial of service by crafting errors with extremely long error strings that exceed message size limits or exhaust memory during deserialization? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Enum: PeerMonitoringServiceMessage] [Type confusion] Can an attacker send a Response variant when a Request is expected (or vice versa), bypassing request validation logic and causing the peer monitoring service to process malformed responses as legitimate requests, potentially triggering state corruption? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Enum: PeerMonitoringServiceMessage] [large_enum_variant] The clippy warning indicates large enum variants - can an attacker exploit this by repeatedly sending the larger Response variant to cause excessive memory allocation and stack overflow during pattern matching, leading to node crashes? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Enum: PeerMonitoringServiceMessage] [Nested Result] The Response variant wraps Result<PeerMonitoringServiceResponse> - can an attacker send nested error responses that cause recursive error handling, potentially exhausting stack space or creating infinite error propagation loops? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Struct: PeerMonitoringMetadata] [Float equality] The manual Eq implementation for f64 fields (average_ping_latency_secs, latest_ping_latency_secs) violates Rust's Eq contract - can attackers exploit NaN or infinity values to cause inconsistent peer ordering in mempool prioritization, leading to deterministic transaction forwarding failures? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Struct: PeerMonitoringMetadata] [NaN poisoning] Can a malicious peer report NaN values for ping latencies, which would make PartialEq comparisons always return false, causing the peer to never match in HashMap/BTreeMap lookups and creating ghost peers that consume resources but are never properly cleaned up? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Struct: PeerMonitoringMetadata] [Infinity manipulation] Can attackers report positive or negative infinity for average_ping_latency_secs to either always be prioritized (negative infinity = lowest latency) or deprioritized, allowing them to manipulate their position in mempool transaction forwarding queues? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Struct: PeerMonitoringMetadata] [Float precision] Can subtle differences in floating-point representation across different CPU architectures cause the same logical latency to have different binary representations, breaking peer metadata equality checks and causing unnecessary peer reprioritization storms? (Low)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Struct: PeerMonitoringMetadata] [Hash collision] Since PeerMonitoringMetadata implements Eq but not Hash, can it be accidentally used in HashMap/HashSet contexts where the derived PartialEq conflicts with manual Eq, causing peer metadata lookups to fail unpredictably? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Struct: PeerMonitoringMetadata::average_ping_latency_secs] [Statistical manipulation] Can malicious peers report artificially low average_ping_latency_secs values without corresponding low latest_ping_latency_secs, creating inconsistent metrics that bypass health checks in mempool peer prioritization while actually having high latency? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Struct: PeerMonitoringMetadata::latest_ping_latency_secs] [Time-of-check-time-of-use] If latest_ping_latency_secs is updated asynchronously while mempool is using average_ping_latency_secs for prioritization, can race conditions cause stale prioritization decisions that route transactions to degraded peers? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Struct: PeerMonitoringMetadata::latest_network_info_response] [Distance spoofing] Can a malicious fullnode claim distance_from_validators = 0 in its latest_network_info_response despite not being a validator, tricking mempool into treating it as a top-priority peer and routing all transactions through a compromised node? (Critical)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Struct: PeerMonitoringMetadata::latest_node_info_response] [Timestamp manipulation] Can attackers report future or extremely old ledger_timestamp_usecs values in latest_node_info_response to either appear fully synced when lagging (avoiding health checks) or appear lagging when synced (causing deprioritization of honest competitors)? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Struct: PeerMonitoringMetadata::internal_client_state] [Unbounded string] The internal_client_state is an unbounded String - can malicious peers inject arbitrarily large debug strings that consume excessive memory when stored in peer metadata maps, causing memory exhaustion and node crashes? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Derive: Serialize, Deserialize] [BCS format] When PeerMonitoringMetadata is serialized with BCS, can attackers exploit the serialization format to craft messages that deserialize to structurally valid but semantically invalid metadata (e.g., negative latencies represented as positive floats after bitwise manipulation)? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Derive: Serialize, Deserialize] [Deserialization bomb] Can an attacker craft a small serialized PeerMonitoringMetadata payload that expands exponentially during deserialization (e.g., through nested Option types or extremely long strings), causing memory exhaustion? (Medium)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Derive: Serialize, Deserialize] [Version skew] If PeerMonitoringMetadata schema changes without proper versioning, can older nodes deserialize newer metadata formats incorrectly, leading to silent data corruption where distance or latency values are misinterpreted? (High)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Derive: Serialize, Deserialize] [Serde edge cases] Can attackers exploit serde deserialization to bypass Rust's type safety by providing invalid discriminants for Option<NetworkInformationResponse> or Option<NodeInformationResponse>, causing undefined behavior when the None variant is accessed as Some? (Critical)",
  "[File: aptos-core/peer-monitoring-service/types/src/lib.rs] [Function: PeerMonitoringMetadata::new()] [No validation] The constructor accepts arbitrary Option values without validation - can callers construct PeerMonitoringMetadata with contradictory data (e.g., Some(average) with None for latest, or distance=0 without validator role) that causes downstream logic errors? (Medium)"
]