[
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Constant: API_PORTS] [Information disclosure] Can an attacker exploit the hardcoded list of API ports (80, 8080, 443) to identify and target Aptos nodes by systematically scanning these known ports across IP ranges, enabling targeted attacks on the validator network? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Constant: API_PORTS] [Service fingerprinting] Does the sequential port probing behavior create a distinct network signature that allows adversaries to identify and track Aptos node checker deployments, potentially enabling reconnaissance for larger attacks? (Low)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Struct: NodeHealthCheckerArgs] [URL injection] Can an attacker supply a malicious nhc_address URL containing special characters, path traversal sequences, or encoded payloads that bypass validation and cause SSRF attacks against internal NHC infrastructure? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Struct: NodeHealthCheckerArgs] [Configuration injection] Can the nhc_baseline_config_name parameter be manipulated to inject malicious configuration names that cause the NHC to apply incorrect security baselines, allowing vulnerable nodes to pass validation? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Struct: NodeHealthCheckerArgs] [Resource exhaustion] Can an attacker set nhc_timeout_secs to an extremely large value (e.g., u64::MAX) causing timeout overflow, resource exhaustion, or indefinite blocking of node checking operations? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Struct: NodeHealthCheckerArgs] [Integer overflow] Can the max_concurrent_nhc_requests value (u16) be set to 0 or manipulated to cause division by zero or incorrect semaphore initialization, leading to deadlocks or unlimited concurrent requests? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_nodes()] [Panic on client build] Does the expect() call on line 65 when building the reqwest client create a panic condition that can be triggered by specific runtime conditions, causing denial of service to the entire node checking infrastructure? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_nodes()] [URL mutation vulnerability] Can the nhc_address.set_path('/check_node') operation on line 68 be exploited if nhc_address already contains query parameters or fragments, leading to malformed requests or path traversal attacks? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_nodes()] [Semaphore exhaustion] Can an attacker cause all semaphore permits to be acquired and never released by triggering panics or network errors in futures, leading to permanent deadlock where no new checks can start? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_nodes()] [Memory exhaustion] Can an attacker provide a massive address_to_nodes HashMap with thousands of entries, causing unbounded future creation that exhausts memory before any checks complete? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_nodes()] [Race condition in HashMap] Are there race conditions in the nhc_responses HashMap insertion on lines 105-108 when multiple futures complete simultaneously, potentially causing dropped results or incorrect aggregation? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_nodes()] [Panic on unexpected enum] Does the panic!() on line 99 for unexpected SingleCheckResult variants indicate incomplete error handling that could be triggered by future code changes, causing availability issues? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_nodes()] [Logic bypass] Can the wildcard match on line 98 be exploited if new SingleCheckResult variants are added without updating this function, causing silent failures or incorrect result classification? (Low)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_nodes()] [Concurrent modification] Can concurrent access to the shared nhc_client, nhc_address, or semaphore from multiple async tasks lead to data races, use-after-free, or inconsistent request state? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_nodes()] [Future starvation] Can slow or hanging network requests cause the FuturesUnordered to never complete, leading to indefinite blocking and resource leaks in long-running processes? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_single_fn_wrapper()] [Semaphore panic] Does the unwrap() call on semaphore.acquire() at line 124 create a panic condition if the semaphore is closed or poisoned, causing cascading failures in concurrent checks? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_single_fn_wrapper()] [Permit leak] Can exceptions or panics in check_single_fn cause the semaphore permit to be dropped without proper release, leading to semaphore exhaustion and permanent denial of service? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_single_fn_wrapper()] [Clone inefficiency] Can repeated cloning of node_url on line 127 for large URLs or URLs with complex query strings cause performance degradation or memory exhaustion in high-volume scenarios? (Low)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_single_fn_wrapper()] [Async cancellation safety] If the future returned by this function is cancelled, can it leave the semaphore in an inconsistent state or leak resources, affecting subsequent check operations? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_single_fn()] [Port enumeration timing] Can an attacker use timing analysis of the port enumeration loop (lines 154-183) to determine which API ports are open on nodes, revealing infrastructure configuration details? (Low)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_single_fn()] [Array index vulnerability] Can the API_PORTS array access on line 161 cause a panic if the API_PORTS constant is modified to be empty, or if concurrent modification occurs during iteration? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_single_fn()] [Infinite loop potential] Can manipulation of API_PORTS or the index variable cause the loop to iterate indefinitely or skip valid ports, leading to incomplete node checks or resource exhaustion? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_single_fn()] [Logic error on port failure] Does the logic on lines 173-176 that only continues to next port on ApiPortClosed failure mean that other errors (like network timeouts) prevent checking remaining ports, causing false negatives? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_single_fn()] [Last result bias] Can the behavior of returning the last result on line 180 mask earlier successful checks if a subsequent port check fails, leading to incorrect node health assessment? (Low)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/check.rs] [Function: check_single_fn()] [Public key exposure] Can the passing of node_info.public_key through multiple function calls without proper zeroization lead to key material remaining in memory longer than necessary, increasing exposure to memory dumps? (Low)"
]