[
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Type: i32 Decimals] Move VM might use u8 for decimals but indexer stores as i32 - can this type widening introduce inconsistencies if on-chain decimals are later changed to larger types? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Type: Address Standardization] Creator addresses are extracted as strings - are they standardized to 0x + 64 hex format, or can short-form addresses (0x1) cause duplicate entries for the same logical address? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Integrity: Unique Constraint] Only coin_type_hash has a uniqueness constraint - can multiple coins with different types but same hash coexist temporarily during indexing before constraint violation is detected? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Integrity: Inserted_at Field] The CoinInfo struct doesn't include inserted_at but CoinInfoQuery does - is this timestamp set by database trigger, or can manual inserts skip it, causing query inconsistencies? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Integrity: Transaction Rollback] If the database transaction in coin_processor.rs rolls back after inserting coin_infos but before inserting related coin_supply, can this create orphaned coin metadata without corresponding supply records? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Query: get_by_coin_type()] [Cache Poisoning] If query results are cached, can an attacker insert malicious coin info then quickly update it, causing stale malicious data to persist in cache and be served to users? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Query: get_by_coin_type()] [Timing Attack] Can measuring query response times reveal whether specific coin types exist in the database, enabling enumeration of all registered coins including private/unlisted tokens? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Query: get_by_coin_type()] [Truncation Mismatch] When querying by coin_type, does the query use the truncated (5000 char) value or full type? Can this cause lookups to fail for coins with very long type names? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Diesel: Macro Expansion] The diesel table macros at line 16-17 are generated code - can macro hygiene issues cause identifier collisions with other database tables or create hidden SQL injection vectors? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Diesel: Identifiable Trait] The Identifiable trait requires coin_type_hash as primary key - can Diesel's internal query building inadvertently expose the hash generation algorithm in error messages or debug output? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Diesel: Insertable Trait] Does the Insertable implementation validate all required fields are present before insertion, or can missing fields cause database constraint violations at runtime instead of compile time? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Integration: coin_processor.rs] The processor deduplicates coins in a HashMap before insert - can hash collisions in the HashMap (different from coin_type_hash) cause legitimate coin infos to be silently dropped during processing? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Integration: coin_activities.rs] If CoinActivity references coin_type_hash that doesn't exist in coin_infos, can this create referential integrity issues where activities are recorded for unknown coins? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_infos.rs] [Integration: API Layer] When the indexer API serves coin info, does it validate that transaction_version_created is less than current blockchain version, or can future-dated coins appear in query results? (Low)"
]