[
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Function: set_coin()] [Integer overflow] Can an attacker manipulate the coin balance via set_coin() to cause integer overflow when setting u64 values, potentially creating unlimited coins or wrapping balances to zero? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Struct: CoinStoreResource] [Type confusion] Can an attacker exploit the PhantomData<C> type parameter to create type confusion attacks by constructing CoinStoreResource instances with mismatched coin types, allowing unauthorized minting or transfer of different coin types? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Field: frozen] [Access control bypass] Can frozen() state be bypassed during deserialization, allowing withdrawals from frozen accounts by crafting malicious BCS-encoded CoinStoreResource with frozen=false despite on-chain state indicating frozen=true? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Struct: CoinStoreResourceUntyped] [Type safety] Does CoinStoreResourceUntyped allow bypassing type safety checks by deserializing typed coin stores as untyped resources, potentially enabling cross-type coin operations and double-spending? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Function: deposit_events_mut()] [Event manipulation] Can an attacker manipulate event sequence numbers via deposit_events_mut() to create duplicate or missing event records, causing inconsistent indexer state and hiding theft transactions? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [Function: withdraw_events_mut()] [Event poisoning] Can withdraw event handles be poisoned by setting invalid EventKey values, causing event indexing failures that hide large-scale coin withdrawals from monitoring systems? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_store.rs] [BCS deserialization] [Malicious input] Does BCS deserialization of CoinStoreResource validate all field constraints, or can attackers inject resources with invalid event handles, u64::MAX coin values, or corrupted PhantomData? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: supply_aggregator_state_key()] [Null pointer] Does supply_aggregator_state_key() safely handle None cases, or can it panic via unwrap() calls when supply/aggregator are None, causing validator crashes during coin info queries? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: to_writeset()] [State corruption] Can to_writeset() create inconsistent state by writing CoinInfo and aggregator value separately without atomic guarantees, allowing supply mismatch between metadata and actual aggregated supply? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Field: supply] [Supply manipulation] Can OptionalAggregatorV1Resource be manipulated to bypass supply limits by setting aggregator=None with non-zero integer value, enabling unlimited minting beyond max supply constraints? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: random()] [Cryptographic weakness] Does random() use cryptographically secure randomness for handle/key generation, or can predictable AccountAddress::random() values be exploited to forge coin info aggregator state keys? (High)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: new()] [Initialization] Can new() be called by unauthorized code to create fake CoinInfo resources with arbitrary supply limits, decimals, or symbols that conflict with legitimate coin registrations? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Function: symbol()] [UTF-8 validation] Does symbol() properly validate UTF-8 encoding, or can malicious symbol bytes cause panics/crashes when converting Vec<u8> to String, disrupting coin metadata queries? (Low)",
  "[File: aptos-core/types/src/account_config/resources/coin_info.rs] [Field: decimals] [Precision overflow] Can decimals field be set to values >18 causing decimal precision overflows in coin amount calculations, leading to incorrect balance computations and loss of funds? (High)",
  "[File: aptos-core/types/src/account_config/resources/core_account.rs] [Field: sequence_number] [Replay attack] Can sequence_number be manipulated during deserialization to be lower than the current on-chain value, enabling transaction replay attacks that bypass nonce-based replay protection? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/core_account.rs] [Field: authentication_key] [Key substitution] Can authentication_key be replaced during BCS deserialization to point to an attacker-controlled key, allowing unauthorized transaction signing without proper key rotation ceremony? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/core_account.rs] [Field: guid_creation_num] [GUID collision] Can guid_creation_num overflow or be reset to zero, causing GUID collisions that enable duplicate resource creation, event handle conflicts, or object address prediction attacks? (High)",
  "[File: aptos-core/types/src/account_config/resources/core_account.rs] [Function: new_stateless()] [Initialization vulnerability] Does new_stateless() properly initialize all security-critical fields, or can it create accounts with predictable guid_creation_num=2 that enable GUID prediction and resource collision attacks? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/core_account.rs] [Field: rotation_capability_offer] [Capability theft] Can rotation_capability_offer be set to arbitrary addresses during deserialization, enabling unauthorized key rotation capability claims without proper offer ceremony validation? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/core_account.rs] [Field: signer_capability_offer] [Privilege escalation] Can signer_capability_offer be manipulated to offer signer capabilities to attacker addresses, enabling complete account takeover and arbitrary transaction execution? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/core_account.rs] [Function: authentication_key()] [Size validation] Does authentication_key() validate that the returned slice has correct length (32 bytes), or can truncated/oversized keys cause authentication bypass or signature verification failures? (High)",
  "[File: aptos-core/types/src/account_config/resources/core_account.rs] [BCS deserialization] [Field constraints] Are all AccountResource fields validated during deserialization (e.g., authentication_key length, valid EventHandle structures), or can malformed resources cause state corruption? (High)",
  "[File: aptos-core/types/src/account_config/resources/aggregator.rs] [Function: set()] [Race condition] Can concurrent calls to set() on AggregatorResource<T> cause race conditions when multiple transactions modify the same aggregator, leading to lost updates or inconsistent values? (High)",
  "[File: aptos-core/types/src/account_config/resources/aggregator.rs] [Field: max_value] [Limit bypass] Can max_value constraint be bypassed by setting value > max_value via set(), enabling supply limit violations in coin minting or NFT collection limits? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/aggregator.rs] [Struct: AggregatorV1Resource] [State key collision] Can state_key() generate colliding StateKey values for different aggregators with same handle/key combinations, causing unrelated aggregators to share storage and corrupt each other's values? (Critical)"
]