[
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 213-220] [G1 projective negation Z-coordinate] The g1_proj_neg benchmark negates points - does negation correctly preserve the Z coordinate, or could incorrect Z values after negation cause point validity checks to fail in signature operations? (Medium - $10K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 222-233] [G1 projective scalar multiplication constant-time] The g1_proj_scalar_mul benchmark multiplies points by scalars - if production BLS signing doesn't use constant-time algorithms, could attackers extract validator private keys through power analysis or timing measurements? (Critical - $1M)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 235-246] [G1 projective subtraction] The g1_proj_sub benchmark subtracts points (P - Q = P + (-Q)) - if subtraction has different timing than addition, could this leak information about which operation is being performed, aiding timing attacks on signature schemes? (Medium - $10K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 248-255] [G1 projective to affine conversion] The g1_proj_to_affine benchmark converts projective to affine - this requires inverting the Z coordinate - could an attacker craft points with Z=0 (infinity) to cause division by zero and crash validators during signature verification? (High - $50K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 257-264] [G2 affine addition without validation] The g2_affine_add benchmark adds G2 points without showing validation - G2 is used for public keys in BLS - could an attacker register validator public keys that are off-curve or not in the correct subgroup, breaking signature aggregation? (Critical - $1M)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 266-276] [G2 compressed deserialization vulnerability] The g2_affine_deser_comp benchmark deserializes compressed G2 points - since G2 coordinates are in Fq2 (two Fq elements), could an attacker exploit extension field deserialization bugs to inject malicious public keys? (Critical - $1M)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 278-288] [G2 uncompressed deserialization size] The g2_affine_deser_uncomp benchmark deserializes uncompressed G2 - does production code validate the exact expected byte length (4 * 32 = 128 bytes for Fq2 x and y), or could buffer overruns occur? (High - $50K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 290-301] [G2 equality check optimization] The g2_affine_eq benchmark converts one G2Affine to Projective before comparison (line 298) - does production code use consistent comparison methods, or could inconsistent equality checks cause validator disagreement on signature validity? (High - $50K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 303-307] [G2 generator trusted setup] The g2_affine_generator benchmark retrieves G2 generator - if BLS public keys are derived from this generator, could a compromised generator (via supply chain attack) allow universal signature forgery? (Critical - $1M)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 309-313] [G2 infinity in aggregation] The g2_affine_infinity benchmark gets the G2 identity - if BLS aggregate signature verification doesn't properly handle cases where aggregation results in infinity (all signatures cancel), could attackers forge empty aggregate signatures? (High - $50K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 315-322] [G2 scalar multiplication secret key] The g2_affine_scalar_mul_to_proj benchmark multiplies G2 by Fr scalars - if this is used to derive validator public keys from secret keys, is the scalar multiplication constant-time to prevent side-channel key extraction? (Critical - $1M)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 324-331] [G2 negation in signature] The g2_affine_neg benchmark negates G2 points - could an attacker exploit public key negation to create valid signatures under a negated public key, enabling validator impersonation? (High - $50K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 333-340] [G2 compressed serialization ambiguity] The g2_affine_serialize_comp benchmark compresses G2 - since G2 has Fq2 y-coordinates, how is the compression flag encoded, and could ambiguity in flag encoding cause different validators to deserialize the same bytes to different public keys? (High - $50K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 342-349] [G2 uncompressed serialization] The g2_affine_serialize_uncomp benchmark serializes full G2 coordinates - does production code enforce canonical encoding of Fq2 elements to prevent multiple valid encodings of the same public key? (Medium - $10K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 351-358] [G2 affine to projective] The g2_affine_to_proj benchmark converts G2 coordinate systems - if conversion doesn't preserve point validity, could this cause validator crashes during public key operations? (High - $50K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 360-371] [G2 projective addition for key aggregation] The g2_proj_add benchmark adds G2 projective points - if this is used for BLS public key aggregation, does it correctly handle all addition edge cases, or could malformed public keys cause aggregation to fail silently? (High - $50K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 373-380] [G2 projective doubling] The g2_proj_double benchmark doubles G2 points - if public key derivation uses repeated doubling, could an attacker exploit doubling bugs to predict derived public keys? (High - $50K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 382-393] [G2 projective equality timing] The g2_proj_eq benchmark compares G2 projective points - if BLS signature verification compares aggregate public keys using non-constant-time equality, could timing leaks reveal validator set composition? (Medium - $10K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 395-399] [G2 projective generator] The g2_proj_generator benchmark gets the G2 generator - if different nodes cache different representations of the generator, could this cause consensus divergence? (High - $50K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 401-405] [G2 projective infinity handling] The g2_proj_infinity benchmark gets the identity - if aggregate BLS signature computation doesn't detect when the result is infinity, could attackers create signatures that appear valid but have no cryptographic meaning? (High - $50K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 407-414] [G2 projective negation for subtraction] The g2_proj_neg benchmark negates G2 - if public key revocation uses subtraction (removing a key from aggregate), could negation bugs cause the wrong key to be removed? (High - $50K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 416-427] [G2 projective scalar multiplication side-channel] The g2_proj_scalar_mul benchmark multiplies G2 by scalars - if validator secret key to public key derivation uses this, are scalar bits leaked through cache timing, power analysis, or electromagnetic emanations? (Critical - $1M)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 429-440] [G2 projective subtraction for key revocation] The g2_proj_sub benchmark subtracts G2 points - if this is used to remove malicious validators' public keys from aggregates, could subtraction bugs leave the malicious key partially present? (High - $50K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Lines 442-449] [G2 projective to affine inversion] The g2_proj_to_affine benchmark converts projective to affine requiring Z inversion - if production code batch-inverts multiple public keys, could a single invalid key (Z=0) cause the entire batch to fail, enabling DoS? (Medium - $10K)",
  "[File: aptos-core/crates/aptos-crypto/benches/ark_bn254.rs] [Macro: serialize!] [Buffer overflow] The serialize! macro (lines 42-47) writes to a Vec without size limits - if production code uses similar patterns for network message serialization, could an attacker send malicious oversized curve points to cause memory exhaustion on validator nodes? (High - $50K)"
]