[
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Consensus: State synchronization] When a validator falls behind and fast-syncs using state snapshots, can it receive an inconsistent RequiredGasDeposit value that differs from what actively participating validators have, causing immediate divergence upon rejoin? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Consensus: Config caching] If validators cache RequiredGasDeposit values for performance, can stale cache entries cause them to use outdated gas_amount values after governance updates, leading to transaction validation divergence? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Transaction validation: Prologue bypass] Can an attacker craft transactions that pass prologue_common() gas checks by exploiting the difference between None (no deposit required) and Some(0) (zero deposit required) in RequiredGasDeposit::gas_amount? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Transaction validation: Balance check bypass] If RequiredGasDeposit::gas_amount is extremely large, can transactions with max_gas less than gas_amount still pass validation by exploiting integer overflow in the deposit calculation: txn_gas_price * max_gas_units? (Critical)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Transaction validation: Custom max_gas abuse] When AllowCustomMaxGasFlag is true, can malicious contracts declare #[randomness(max_gas = 1)] to minimize required deposits while actually consuming much more gas during execution, stealing funds from users? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Transaction validation: Deposit refund] After a randomness transaction completes successfully using less gas than deposited per RequiredGasDeposit requirements, is the excess deposit properly refunded, or can it be permanently locked leading to fund loss? (Medium)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Transaction validation: Error code confusion] Can transactions trigger both INSUFFICIENT_BALANCE_FOR_REQUIRED_DEPOSIT and REQUIRED_DEPOSIT_INCONSISTENT_WITH_TXN_MAX_GAS errors simultaneously, causing undefined behavior in error handling that allows bypassing deposit checks? (Medium)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Transaction validation: Gas payer manipulation] In fee payer transactions, can the gas payer account be manipulated to have exactly RequiredGasDeposit::gas_amount balance, causing is_balance_at_least() checks to succeed while actual gas charging fails? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Move VM: as_move_value() injection] Can malicious bytecode manipulate the MoveStruct returned by RequiredGasDeposit::as_move_value() to inject additional fields or modify the gas_amount value during runtime, bypassing deposit validation? (Critical)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Move VM: Type safety violation] Does the MoveStruct::Runtime(vec![...]) construction in as_move_value() validate that the vector contains exactly one element of correct type, or can malformed vectors crash the VM or cause type confusion? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Move VM: Native function interaction] When native randomness functions call is_unbiasable() which checks RandomnessConfig fetched from RequiredGasDeposit, can race conditions between config fetch and validation cause TOCTOU vulnerabilities? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Move VM: Reflection attacks] Can malicious Move code use reflection or introspection to directly access RequiredGasDeposit global resource at @aptos_framework, bypassing the intended OnChainConfig::fetch_config() path and reading stale or corrupted values? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Move VM: Capability forgery] Does the Move module randomness_api_v0_config properly protect RequiredGasDeposit resources with friend declarations, or can arbitrary modules modify these configs by forging system capabilities? (Critical)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Move VM: Gas metering bypass] Can malicious contracts exploit RequiredGasDeposit to claim they need minimal gas via custom max_gas declarations while actually consuming unlimited gas by recursive function calls or infinite loops? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Storage: State corruption] If RequiredGasDeposit is corrupted in AptosDB due to storage bugs or disk failures, does fetch_config() detect the corruption and safely abort, or can it return malformed Option<u64> values causing widespread transaction failures? (Critical)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Storage: Key collision] Can the storage key derived from MODULE_IDENTIFIER='randomness_api_v0_config' and TYPE_IDENTIFIER='RequiredGasDeposit' collide with other on-chain resources, allowing attackers to overwrite config values by manipulating unrelated storage locations? (Critical)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Storage: Pruning vulnerability] If historical RequiredGasDeposit states are pruned from storage, can this cause state sync or replay attacks where nodes compute different gas deposit requirements when replaying old transactions? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Storage: Snapshot inconsistency] During state snapshot creation for fast sync, can partial writes of RequiredGasDeposit leave snapshots with gas_amount=None while live state has Some(value), causing syncing nodes to reject valid randomness transactions? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Storage: Backup restoration] If RequiredGasDeposit is restored from backups with different gas_amount than current live state, can this create a fork where backup-restored validators use old deposit requirements while others use new ones? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [DoS: Config update spam] Can malicious governance proposals spam set_for_next_epoch() with alternating gas_amount values, causing config_buffer to grow unbounded and consume excessive memory leading to validator crashes? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [DoS: Deserialization bomb] Can crafted RequiredGasDeposit payloads with deeply nested Option structures cause exponential deserialization time, DoSing validators during OnChainConfig::fetch_config() operations? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [DoS: Impossible deposits] If RequiredGasDeposit::gas_amount is set to a value exceeding total APT supply, does this permanently disable the randomness API by making deposits impossible, or can this be emergency-reverted via governance? (High)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [DoS: Flag thrashing] Can rapid toggling of AllowCustomMaxGasFlag between true/false across epochs cause validators to constantly recompile and revalidate randomness function annotations, degrading network performance? (Medium)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Liveness: Config deadlock] If both RequiredGasDeposit and AllowCustomMaxGasFlag configs fail to apply during on_new_epoch() due to storage errors, can this deadlock the epoch transition process preventing any new blocks from being finalized? (Critical)",
  "[File: aptos-labs/aptos-core/types/src/on_chain_config/randomness_api_v0_config.rs] [Liveness: Validator crash] Can malformed RequiredGasDeposit values cause panic!() in as_move_value() conversion, crashing >1/3 of validators simultaneously and halting consensus? (Critical)"
]