[
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: connect_via_proxy()] [Error message leak] Do error messages at lines 280-283 and 290-293 leak sensitive proxy authentication details or network topology information? (Low)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: connect_via_proxy()] [Stream reuse] After successful CONNECT, is the TcpStream properly cleared of any residual proxy data, or can leftover bytes corrupt subsequent protocol handshakes? (High)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: connect_via_proxy()] [Proxy authentication] Does the CONNECT request support proxy authentication (Proxy-Authorization header), and if not, can this be exploited to bypass authenticated proxy security? (Medium)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: connect_via_proxy()] [Host header injection] Can parse_tcp() return host values containing newlines or other special characters that break HTTP request formatting? (High)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: invalid_addr_error()] [Information disclosure] Does formatting the entire NetworkAddress in error messages leak sensitive network topology, internal IP addresses, or validator identity information? (Medium)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: invalid_addr_error()] [Error injection] Can specially crafted NetworkAddress formats cause the error message to include attacker-controlled content that could exploit log injection vulnerabilities? (Low)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Struct: TcpListenerStream] [Concurrent accept] Can multiple poll_next() calls be made concurrently on the same TcpListenerStream, causing race conditions in socket acceptance or configuration application? (Medium)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: poll_next()] [Configuration failure handling] When apply_config() fails at line 323, does returning Err(e) properly clean up the accepted socket, or is the connection left in a half-open state? (Medium)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: poll_next()] [Address spoofing] Is the dialer_addr derived from poll_accept() trustworthy, or can attackers spoof source addresses to bypass IP-based authentication or rate limiting? (High)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: poll_next()] [Stream termination] When poll_accept() returns Err, does the stream terminate properly, or can error conditions leave the listener in an inconsistent state? (Low)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: poll_next()] [TcpSocket wrapping] Is the immediate wrapping in future::ready(Ok(TcpSocket::new(socket))) safe, or can the socket be in an invalid state that causes issues in later processing? (Medium)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Struct: TcpOutbound] [Future cancellation] If the TcpOutbound future is dropped before completion, is the underlying connection properly cleaned up, or can there be resource leaks or half-open connections? (Medium)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: poll() for TcpOutbound] [Configuration timing] Is apply_config() called at the right time (after socket is ready but before use), or can race conditions cause configuration to be applied too late or to the wrong socket? (Medium)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: poll() for TcpOutbound] [Error propagation] Does the ready!() macro properly propagate all connection errors, including timeout and cancellation scenarios? (Low)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: poll() for TcpOutbound] [Pinned future safety] Is the Pin::new(&mut self.inner) call safe with respect to the underlying future's Pin requirements, or can there be undefined behavior? (Low)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Struct: TcpSocket] [Compat layer vulnerability] Does the Compat wrapper from TokioAsyncReadCompatExt properly handle all edge cases in AsyncRead/AsyncWrite trait implementations, or can there be data corruption or loss? (High)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: new()] [Stream state validation] Is the TcpStream validated to be in a connected state before wrapping with compat(), or can disconnected or partially connected streams cause undefined behavior? (Medium)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: poll_read()] [Buffer overflow] Does poll_read() properly validate the buf slice length before reading, or can buffer overflows occur with malicious input? (High)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: poll_read()] [Partial read handling] Are partial reads handled correctly, or can attackers send data in small chunks to cause resource exhaustion or timing attacks? (Medium)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: poll_write()] [Buffer underflow] Does poll_write() handle zero-length writes correctly, or can empty write operations cause protocol state confusion? (Low)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: poll_write()] [Partial write handling] If partial writes occur, does the caller properly handle continuation, or can data be lost or duplicated? (High)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: poll_flush()] [Flush failure] What happens when poll_flush() fails - is the connection terminated, or can unflushed data remain in buffers causing message reordering or loss? (High)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: poll_close()] [Close semantics] Does poll_close() properly shutdown both read and write halves of the connection, or can half-close states cause protocol violations? (Medium)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Function: poll_close()] [Close during write] If poll_close() is called while data is still being written, is the data flushed first, or is there potential for data loss? (High)",
  "[File: aptos-core/network/netcore/src/transport/tcp.rs] [Integration] [Config synchronization] Is tcp_buff_cfg properly synchronized between TcpTransport and the actual socket configuration, or can config changes be lost during concurrent operations? (Medium)"
]