[
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Field: module_data Vec] [Unbounded Growth] At line 579, module_data is unbounded Vec. Can an attacker cause OOM by registering millions of tiny modules? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Field: global_invariants BTreeMap] [Invariant Accumulation] At line 583, global_invariants has no size limit. Can an attacker register millions of invariants to exhaust memory? (Low)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Field: exp_info BTreeMap] [Node Info Accumulation] At line 577, exp_info grows unbounded. Can an attacker create modules with millions of expressions to exhaust memory? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: type_abilities()] [Ability Inference] At line 1563, abilities are inferred using AbilityInferer. Can an attacker craft types with circular dependencies that cause infinite recursion in ability inference? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: is_wellknown_event_handle_type()] [Type Matching] At lines 1549-1559, EventHandle type is detected by module and struct name. Can an attacker create fake EventHandle types to bypass event handling logic? (Low)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: is_pragma_true()] [Pragma Precedence] At line 4755, pragmas are checked at function then module level. Can an attacker exploit precedence to override security-critical module-level settings with function-level pragmas? (High)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: get_num_pragma()] [Numeric Pragma Validation] At line 4780, numeric pragmas are returned without range validation. Can an attacker set extreme pragma values to cause integer overflow in pragma consumers? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: get_ident_pragma()] [Pragma Symbol Injection] At lines 4793-4806, identifier pragmas are retrieved as symbols. Can an attacker inject malicious symbols through pragmas to redirect function calls? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: get_friend_env()] [Friend Resolution] At line 4968, friend function is resolved via pragma. Can an attacker exploit missing validation to create friend relationships to non-existent functions? (Low)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: get_transitive_friend()] [Friend Transitivity] At lines 4971-4979, transitive friends are resolved recursively. Can an attacker create circular friend chains causing infinite recursion? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: is_exposed()] [Exposure Detection] At lines 4902-4910, function exposure is determined by visibility and entry status. Can an attacker exploit edge cases where private entry functions are incorrectly considered exposed? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: has_unknown_callers()] [Caller Analysis] At lines 4913-4920, functions determine if they have unknown callers. Can an attacker exploit this to bypass optimization passes that assume limited callers? (Low)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: has_package_visibility()] [Package Visibility] At line 4935, package visibility is stored as a separate flag. Can an attacker exploit inconsistency between has_package_visibility and actual visibility enum to bypass access checks? (High)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: is_inline()] [Inline Detection] At line 4885, inline status is checked via kind field. Can an attacker mark functions inline to bypass certain verification checks that skip inline functions? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: get_used_functions_with_transitive_inline()] [Transitive Inline Explosion] At lines 5273-5292, transitive inline functions are collected. Can deeply nested inline calls cause exponential explosion in the collected set? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: get_variants()] [Variant Ordering] At lines 3979-3986, variants are sorted by order field. Can an attacker manipulate variant order to cause field offset confusion? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: get_field_by_offset_optional_variant()] [Variant Field Access] At lines 4084-4095, variant field lookup iterates all fields. Can an attacker exploit O(n) complexity with thousands of fields to cause DoS? (Low)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: make_variant_field_id_str()] [Field ID Collision] At lines 353-358, variant field IDs are created by concatenating variant and field names. Can an attacker create collisions by using dots in field names? (Low)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Struct: NamedConstantData] [Constant Value Type] At line 4300, constant value is stored as Value enum. Can an attacker exploit type mismatches between type_ and value to cause type confusion? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: get_local_name()] [Source Map Injection] At lines 5067-5092, local names come from source_map which can be maliciously crafted. Can an attacker inject names with special characters that break downstream tools? (Low)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: get_function_def_idx()] [Index Consistency] At line 3480, function def_idx is returned from function_data. Can an attacker exploit inconsistency between function_idx_to_id and function_data.def_idx? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: is_phantom_parameter()] [Phantom Validation] At lines 4098-4105, phantom parameters are checked by index. Can an attacker exploit out-of-bounds indices to bypass phantom type checks? (Medium)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Struct: TypeParameter] [Ability Constraints] At line 4407, TypeParameter includes ability constraints. Can an attacker craft type parameters with inconsistent ability sets to bypass ability checking? (High)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: get_access_specifiers()] [Access Validation] At lines 5049-5057, access specifiers are returned without validation. Can an attacker craft contradictory access specifiers (both reads and writes negated) to bypass access control? (High)",
  "[File: aptos-core/third_party/move/move-model/src/model.rs] [Function: get_acquired_structs()] [Acquires Validation] At line 5061, acquired structs are returned as Option. Can an attacker exploit None acquires to bypass resource access validation? (Medium)"
]