[
  "[File: token_ownerships.rs::TokenOwnership::from_token()] [Token Properties Cloning] token_properties are cloned without validation - can excessively large property maps cause memory exhaustion when creating CurrentTokenOwnership entries? (Medium)",
  "[File: token_ownerships.rs::CurrentTokenOwnership] [Transaction Version Race] last_transaction_version tracks the latest update - can out-of-order transaction processing cause newer ownership states to be overwritten by older ones? (High)",
  "[File: token_ownerships.rs::TokenOwnership::from_token()] [Missing TokenId Validation] Function returns early if key is not TokenId type - can this allow WriteTableItems with different key types to bypass ownership tracking, creating invisible transfers? (Medium)",
  "[File: token_ownerships.rs::TokenOwnership::from_token()] [Collection Hash Mismatch] collection_data_id_hash is copied from Token - if Token was created with incorrect hash, all ownerships inherit the error, causing collection-wide query failures? (Medium)",
  "[File: token_ownerships.rs::TokenOwnership::from_token()] [Timestamp Cloning] transaction_timestamp is cloned from Token - can manipulated timestamps cause incorrect ordering in ownership history queries? (Low)",
  "[File: token_activities.rs::TokenActivity::from_transaction()] [Event Sequence Manipulation] Events are processed by index - can an attacker reorder events within a transaction to make token transfers appear in incorrect sequence, confusing activity history? (Medium)",
  "[File: token_activities.rs::TokenActivity::from_parsed_event()] [Transfer Type Spoofing] transfer_type is set directly from event_type string - can an attacker emit fake event types to make burns appear as transfers or vice versa, hiding malicious activity? (High)",
  "[File: token_activities.rs::TokenActivity::from_parsed_event()] [From/To Address Validation] Addresses are standardized but not validated - can zero addresses or system addresses be used to hide token origin/destination in activity logs? (Medium)",
  "[File: token_activities.rs::TokenActivity::from_parsed_event()] [Amount Overflow] token_amount is taken directly from events - can extremely large amounts cause BigDecimal overflow in activity aggregation queries? (Medium)",
  "[File: token_activities.rs::TokenActivity::from_parsed_event()] [Mint Event Abuse] MintTokenEvent sets property_version to zero and from_address to event_account_address - can this be exploited to create fake mint activities hiding actual token source? (High)",
  "[File: token_activities.rs::TokenActivity::from_parsed_event()] [Event Guid Collision] Primary key includes event_creation_number and event_sequence_number - can attackers manipulate these to create duplicate activities or overwrite legitimate events? (High)",
  "[File: token_activities.rs::TokenActivity::from_parsed_event()] [Token ID Hash Inconsistency] token_data_id_hash is computed per-event - can hash computation inconsistencies across different events for the same token cause fragmented activity history? (Medium)",
  "[File: token_activities.rs::TokenActivity::from_parsed_event()] [Mutate Event Property Version] MutateTokenPropertyMapEvent uses new_id.property_version - can this create activity records with property versions that don't exist in token ownership tables? (Medium)",
  "[File: token_activities.rs::TokenActivity::from_parsed_event()] [Withdraw/Deposit Balance Tracking] WithdrawEvent and DepositEvent have no balance validation - can imbalanced withdraws/deposits hide actual token movements or create phantom supply? (High)",
  "[File: token_activities.rs::TokenActivity::from_parsed_event()] [Coin Type Injection] coin_type is Option<String> set to None for most events - can custom event types inject coin_type data to fake payment activities? (Low)",
  "[File: collection_datas.rs::CollectionData::from_write_table_item()] [Creator Address Database Lookup] When creator not in table_handle_to_owner, db query is attempted - can an attacker cause excessive db queries by providing collections with unknown table handles, causing DoS? (Medium)",
  "[File: collection_datas.rs::CollectionData::from_write_table_item()] [Retry Logic Timing Attack] get_collection_creator retries 5 times with 500ms delay - can an attacker exploit this 2.5s window to front-run collection creation or cause transaction timeout? (Medium)",
  "[File: collection_datas.rs::CollectionData::from_write_table_item()] [Supply Exceeds Maximum] supply and maximum are taken from CollectionData without validation - can supply > maximum violate collection invariants and enable unlimited minting? (Critical)",
  "[File: collection_datas.rs::CollectionData::from_write_table_item()] [Mutability Config Manipulation] mutability_config flags control future modifications - can an attacker set immutable flags on mutable collections or vice versa to lock/unlock unexpected changes? (High)",
  "[File: collection_datas.rs::CollectionData::from_write_table_item()] [Collection Hash Collision] collection_data_id_hash is computed from creator and name - can two creators with similar addresses and identical collection names create hash collisions? (High)",
  "[File: collection_datas.rs::CollectionData::from_write_table_item()] [Missing Creator Validation] If db lookup fails, function returns Ok(None) - can this silently drop collection creation events, causing collections to exist on-chain but not in indexer? (High)",
  "[File: collection_datas.rs::CollectionData::from_write_table_item()] [Name Truncation Collision] Collection name is truncated to NAME_LENGTH (128) - can attackers create multiple collections with identical truncated names to cause confusion or takeover attacks? (Medium)",
  "[File: collection_datas.rs::CollectionData::from_write_table_item()] [URI Truncation Injection] URI is truncated to URI_LENGTH (512) - can attackers inject malicious URIs that appear legitimate after truncation but resolve to phishing sites? (Low)",
  "[File: collection_datas.rs::CollectionData::from_write_table_item()] [Table Handle Reuse] table_handle uniquely identifies collections - can handle reuse across transactions cause new collections to overwrite old ones in current_collection_datas? (High)",
  "[File: collection_datas.rs::CurrentCollectionDataQuery::get_by_table_handle()] [SQL Injection] Raw SQL query with table_handle parameter - although using Diesel binding, can special characters in table_handle cause unexpected query behavior? (Low)"
]