[
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_event()] [Special Addresses] At line 91, if event.guid.account_address is a system address like 0x1 or 0x0, does standardize_address handle these correctly, or could they be treated as regular accounts in account_transactions, causing confusion in queries? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Incomplete Processing] At lines 75-83, the match statement only handles DeleteResource and WriteResource, with `_ => {}` for all other WriteSetChange variants - are there other variants (e.g., WriteModule, DeleteModule, WriteTable) that should also trigger account_transactions tracking? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Module Deployment Bypass] At line 82, the catch-all `_ => {}` means WriteModule and DeleteModule changes are ignored - if an account deploys or upgrades Move modules, will this not be reflected in account_transactions, hiding important account activity? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Table Item Bypass] The TODO at line 37 states 'include table items in the detection path' - currently, WriteTableItem changes are ignored - can attackers perform account-related operations via table items (e.g., token transfers in table-based collections) without being tracked in account_transactions? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Partial Resource Tracking] The comment at line 99 mentions 'This handles partial deletes as well' - but what is a partial delete, and does the current implementation at lines 100-117 actually handle it correctly, or could partial state changes be lost? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_delete_resource()] [Resource Type Filtering] At lines 124-134, all delete resources are tracked regardless of type - should certain system resource deletions (e.g., temporary resources) be filtered out to avoid noise in account_transactions? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Primary Key Consistency] The composite primary key at line 23 is (account_address, transaction_version) - if the same account appears multiple times in a transaction (signer, event emitter, resource owner), does the HashMap ensure only one entry per account, or could duplicate inserts cause primary key violations? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Transaction Version Consistency] At lines 46, 52, and 58, transaction version is extracted differently for each transaction type - if these extractions produce inconsistent values for the same underlying transaction, could account_transactions have duplicate or conflicting entries? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Address Format Consistency] At lines 105, 108, and 114, account addresses are used - are all three guaranteed to use standardized format, or could mixing standardized and non-standardized addresses cause the same account to appear under multiple keys? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Determinism] Is the HashMap iteration order at line 85 deterministic? If the function is called multiple times with the same transaction, will it always produce the same HashMap entries in the same order, or could non-deterministic ordering cause database insertion inconsistencies? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Idempotency] If from_transaction is called multiple times for the same transaction (e.g., during indexer retry after failure), will it produce identical results, or could stateful operations (e.g., caching in ObjectWithMetadata) cause different account_transactions entries on subsequent calls? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Struct: AccountTransaction] [Schema Mismatch] At lines 25-27, the struct has transaction_version and account_address fields, but the schema at line 7-12 shows account_address comes before transaction_version - does this ordering mismatch cause database insertion errors or silent data corruption? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Struct: AccountTransaction] [Missing Timestamp] The schema defines inserted_at as Timestamp, but the AccountTransaction struct at lines 25-28 has no inserted_at field - does this mean the database auto-populates it, or will inserts fail due to missing required field? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Struct: AccountTransaction] [Address Length] The schema shows account_address as Varchar with max_length = 66 - if standardize_address produces addresses longer or shorter than 66 characters, will database inserts fail or truncate data? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Batch Insert Failure] If the returned HashMap at line 85 contains thousands of entries (e.g., transaction affects many accounts), could the database batch insert fail due to size limits, causing all account_transactions for that transaction to be lost? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Type: AccountTransactionPK] [Composite Key] At line 20, AccountTransactionPK is defined as (String, i64) - if this doesn't match the database's actual primary key type or ordering, could it cause insertion conflicts or incorrect uniqueness checking? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Incomplete Ownership] The TODO at line 36 states 'recursively find the parent account of an object' - currently only one level of ownership is tracked (line 112) - can attackers create nested object hierarchies to hide the ultimate owner, evading account_transactions tracking? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Ownership Chain] At line 112, only inner.object_core.get_owner_address() is tracked - if this owner is itself an object (not an account), will the actual human-controlled account not appear in account_transactions, breaking accountability? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Circular Ownership] If object A is owned by object B, and object B is owned by object A (circular reference), will the current one-level tracking at line 112 fail to detect this, potentially causing infinite loops if recursive tracking is ever implemented? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Transfer Detection] At lines 110-115, object ownership is tracked, but only for write resources - if object ownership transfers happen via DeleteResource followed by WriteResource, will both old and new owners appear in account_transactions, or only the new owner? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Object Creation] When a new object is created (WriteResource with new ObjectCore), lines 110-115 track both the object address and owner - but does this distinguish between object creation vs object modification, potentially causing false positives where owners appear associated with object creation they didn't perform? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Table Item Bypass] The TODO at line 37 explicitly states 'include table items in the detection path' - currently WriteSetChange::WriteTableItem is ignored at line 82 - can attackers use table items to transfer tokens or assets without any account_transactions record? (Critical)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Token Transfer Evasion] Many token collections use table-based storage - if table items are not tracked at lines 74-83, will token transfers not appear in account_transactions for the involved accounts, breaking NFT ownership audit trails? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Staking Bypass] If staking operations use table items for delegation tracking, will the current code at lines 74-83 fail to associate stakers with their delegation transactions, hiding staking activity from account_transactions? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Governance Bypass] If governance votes are stored in table items, will the catch-all `_ => {}` at line 82 cause voters not to be tracked in account_transactions, making it impossible to query which accounts participated in governance? (Medium)"
]