[
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [Generic Type Confusion] Can the generic type parameter in get_account_resource_bcs<ValidatorSet>() be exploited through type confusion if the REST API returns data matching a different type's BCS schema? (High)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [BCS Version Mismatch] Can BCS serialization version mismatches between the REST endpoint and the client cause deserialization failures that prevent validator set discovery and isolate nodes from the network? (High)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [Nested Resource Injection] Can attackers exploit nested resource types within ValidatorSet to inject malicious data that bypasses top-level validation but corrupts nested validator info structures? (High)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [Eclipse Attack via REST] Can an attacker compromise the REST endpoint to return a validator set containing only attacker-controlled nodes, eclipsing honest validators and enabling network partition or double-spending attacks? (Critical)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [Selective Validator Hiding] Can malicious REST responses selectively omit specific validators from the ValidatorSet, causing targeted isolation of honest nodes and reducing network resilience against Byzantine attacks? (High)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [Network Split via Inconsistent Data] Can the REST endpoint serve different ValidatorSet data to different nodes based on their source IP, creating intentional network partitions that violate consensus safety? (Critical)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: new()] [Single Point of Failure] Does relying on a single rest_url create a single point of failure where compromise or outage of one REST endpoint can prevent all discovery, causing network-wide validator isolation? (High)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [Network ID Bypass] Can extract_validator_set_updates be called with incorrect network_context, causing testnet validators to be injected into mainnet discovery or vice versa? (High)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Struct: RestStream] [Multi-Network Instance] If multiple RestStream instances run for different networks on the same node, can cross-contamination occur where validator sets from one network leak into another? (Medium)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [Replay Attack] Can an attacker replay old ValidatorSet data from a previous REST response, causing nodes to revert to outdated validator configurations and creating temporary network partitions? (High)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [Timestamp Validation Missing] Does the ValidatorSet include timestamp or epoch number validation to prevent accepting stale data, or can nodes unknowingly use outdated validator information? (High)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [Monotonicity Violation] Can validator set updates violate monotonicity guarantees, allowing newer updates to be replaced by older ones if REST responses arrive out of order? (Medium)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: new()] [URL Scheme Validation] Does new() validate that rest_url uses HTTPS and not insecure HTTP, preventing man-in-the-middle attacks that could inject malicious validator sets? (High)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: new()] [Interval Bounds Check] Does new() validate that interval_duration is within reasonable bounds (not too small causing spam, not too large causing staleness), or can misconfiguration lead to discovery failures? (Medium)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [ValidatorSet Size Limit] Does poll_next() enforce maximum size limits on the returned ValidatorSet to prevent memory exhaustion from maliciously large validator sets? (Medium)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [Address Validation] Are validator addresses in the ValidatorSet properly validated for correctness and uniqueness before being passed to extract_validator_set_updates? (High)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [PeerSet Corruption] Can corrupt data from REST responses cause extract_validator_set_updates to return a malformed PeerSet that crashes downstream connectivity manager components? (High)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [Discovery Source Confusion] Can validator sets discovered via REST be incorrectly attributed to other discovery sources (on-chain, file), causing improper priority handling in peer selection? (Medium)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [Update Channel Overflow] Can rapid validator set changes from REST polling overflow downstream update channels, causing backpressure that blocks discovery and prevents peer updates? (Medium)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: new()] [TimeService Manipulation] Can malicious TimeService implementations cause the interval at line 34 to behave incorrectly (never fire, fire too frequently), disrupting discovery timing? (Medium)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: new()] [Client Clone Safety] If the rest_client is cloned across multiple streams, can shared state cause race conditions or connection pool exhaustion? (Low)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [Critical Path Failure] Since poll_next() is the only data retrieval path, can a single bug or attack on this function completely disable REST-based discovery for all nodes relying on it? (Critical)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [No Fallback Mechanism] Does RestStream have fallback mechanisms if REST discovery fails, or will validator set updates completely stop, causing network stagnation? (High)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [None Return Condition] Under what conditions can poll_next() return Poll::Ready(None), and could this premature stream termination cause permanent discovery shutdown? (High)",
  "[File: aptos-core/network/discovery/src/rest.rs] [Function: poll_next()] [Panic on into_inner] Can the into_inner() call at line 54 panic if the Response wrapper is in an invalid state, causing validator node crashes? (Medium)"
]