[
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Front-Running] Can an attacker front-run epoch change transactions to manipulate validator set composition? (High)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [MEV Extraction] Can validators extract MEV during epoch transitions by ordering transactions favorably? (Medium)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Censorship Resistance] Can a malicious validator set in epoch N censor epoch change proofs to prevent transition to epoch N+1 where they lose control? (Critical)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Chain Reorganization] Can epoch changes trigger chain reorganizations that revert confirmed transactions? (Critical)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Fast Sync Attacks] Can an attacker exploit fast sync mechanisms during epoch changes to serve malicious state to syncing nodes? (High)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Checkpoint Manipulation] If checkpoints are used with waypoints, can an attacker manipulate checkpoint data to inject malicious epoch states? (Critical)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [State Sync Attacks] During epoch transitions, can an attacker serve inconsistent state to nodes performing state sync? (High)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Snapshot Poisoning] Can an attacker poison state snapshots at epoch boundaries to compromise nodes that bootstrap from those snapshots? (Critical)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Archive Node Attacks] Can an attacker manipulate historical epoch data on archive nodes to rewrite history? (High)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Light Client Exploits] Can light clients be tricked with malicious epoch change proofs due to insufficient verification? (High)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [SPV Proof Attacks] If simplified payment verification is used, can SPV proofs be forged during epoch transitions? (High)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Cross-Epoch Transaction Validity] Can transactions from epoch N be replayed in epoch N+1 after validator set changes? (High)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Pending Transaction Handling] How are pending transactions in the mempool handled during epoch changes, and can this be exploited? (Medium)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Validator Sync During Transition] Can an attacker exploit the window where validators are syncing to the new epoch to commit malicious blocks? (High)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Epoch Boundary Race Conditions] Can race conditions at exact epoch boundaries cause validators to operate on different validator sets? (Critical)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Block Production Gap] Can an attacker cause a gap in block production during epoch transitions to halt the chain? (High)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Leader Election Reset] When epoch changes, is leader election properly reset, or can an attacker maintain leadership advantage? (High)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Round Number Continuity] Are round numbers reset or continued across epochs, and can this be exploited for consensus attacks? (High)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Pacemaker Synchronization] Does the pacemaker properly synchronize across epoch changes, or can timing attacks disrupt consensus? (High)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Safety Rule Persistence] Are safety rules properly carried over across epochs, or can an attacker cause validators to violate safety in the new epoch? (Critical)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Liveness Rule Reset] Can liveness guarantees be violated during the epoch transition period? (High)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Vote Collection Reset] When transitioning epochs, can votes from the old epoch be mixed with votes from the new epoch causing confusion? (Critical)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Timeout Certificate Validity] Do timeout certificates from epoch N remain valid in epoch N+1, and can this be exploited? (High)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [View Change Attacks] Can an attacker force unnecessary view changes during epoch transitions to disrupt consensus? (Medium)",
  "[File: aptos-core/types/src/epoch_change.rs] [Function: verify()] [Proposer Rotation] Is proposer rotation fair across epoch boundaries, or can an attacker bias it to their advantage? (Medium)"
]