[
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [MoveType Integration] When TableItemRequest.value_type is used with try_into_move_value() for deserialization, can type coercion allow reading values as different types than they were stored, bypassing Move's type safety? (Critical)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Vector<u8> Confusion] If key_type is specified as vector<u8> vs string for byte arrays, does the serialization differ in a way that allows accessing the same underlying data with different keys? (High)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Address Type Confusion] Can an attacker exploit differences between 'address' and 'signer' types in key_type to access privileged table entries by type substitution? (Critical)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Integer Type Truncation] If key_type uses smaller integer types (u8, u16, u32) but the key JSON value exceeds the range, does validation catch this before serialization causes data truncation? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Signed Integer Confusion] Can negative values in the key field be interpreted differently when key_type uses unsigned types (u64, u128, u256), leading to unintended table lookups? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Serde JSON Exploit] Can an attacker exploit serde_json::Value deserialization of the key field to inject arbitrary Rust types or cause memory corruption? (Critical)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Serde Clone Safety] The TableItemRequest derives Clone - can cloning a TableItemRequest with complex nested key values lead to double-free or use-after-free vulnerabilities? (High)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [PartialEq Bypass] Can an attacker exploit the PartialEq implementation to make two TableItemRequests appear equal when they actually access different table items? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Debug Information Leak] Does the Debug derive on TableItemRequest leak sensitive information from the key field that should remain private? (Low)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: RawTableItemRequest] [HexEncodedBytes Security] Can the HexEncodedBytes wrapper in RawTableItemRequest.key be exploited to bypass size limits or inject malicious byte sequences? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [State Inconsistency] Can concurrent TableItemRequests for the same table with different key_type/value_type combinations cause state view inconsistencies or race conditions? (High)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Ledger Version Manipulation] When TableItemRequest is used with different ledger_version parameters, can attackers exploit timing differences to infer private table data? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Cache Poisoning] Can an attacker send malformed TableItemRequests that poison API response caches, causing subsequent legitimate requests to return incorrect data? (High)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: RawTableItemRequest] [BCS-Only Restriction] The raw_table_item endpoint only returns BCS format - can this restriction be bypassed by manipulating RawTableItemRequest to force JSON responses? (Low)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Error Message Information Leak] Do validation errors from verify() leak information about the internal structure of tables or valid key types that could aid reconnaissance? (Low)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [TableHandle Injection] Can an attacker manipulate the table_handle parameter (passed separately to the API) in conjunction with TableItemRequest to access tables they shouldn't have access to? (Critical)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [StateKey Construction] When TableItemRequest is used to construct StateKey::table_item, can hash collisions allow accessing arbitrary state values beyond the intended table? (Critical)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Move VM Bypass] Can carefully crafted TableItemRequest types bypass Move VM access controls when the key is converted to vm_key.undecorate().simple_serialize()? (Critical)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: RawTableItemRequest] [Direct Storage Access] Does RawTableItemRequest allow direct access to internal system tables that should be protected by the Move VM layer? (Critical)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Converter Context Exploit] Can attackers exploit the state_view.as_converter() context used with TableItemRequest to access resources from different accounts or modules? (Critical)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Complex Type DoS] Can an attacker create TableItemRequests with extremely complex generic types (e.g., nested structs with many type parameters) that cause CPU exhaustion during verification? (High)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Large Key DoS] Can an attacker send TableItemRequests with massive JSON keys (e.g., huge nested objects) that pass validation but cause memory exhaustion during VM conversion? (High)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: RawTableItemRequest] [Bulk Request Attack] Can an attacker flood the API with thousands of concurrent RawTableItemRequests with different keys to exhaust database connection pools or state view resources? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Type String DoS] Can extremely long type strings in key_type or value_type (e.g., types with hundreds of generic parameters) cause parser exhaustion in parse_type_tag? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Null Key Handling] What happens if the key field in TableItemRequest is JSON null - does it serialize to a valid table key or cause an error? (Low)"
]