[
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_resource_group_member()] [Error suppression] The function returns None for both missing modules and missing group membership - can an attacker exploit this ambiguity to hide resource group violations? (High)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_resource_group_member()] [Circular group references] Can an attacker create circular resource group references in module metadata that cause infinite loops when resolving group membership? (High)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_resource_group_member()] [Cross-module exploitation] Can an attacker reference resource groups from different modules to bypass access control checks in resource group operations? (Medium)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_resource_group_member()] [Metadata cache inconsistency] If module metadata is updated but cached modules aren't invalidated, can stale resource group information be used leading to state inconsistencies? (Medium)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_resource()] [Struct tag mismatch] Can an attacker provide a StructTag that doesn't match the blob's actual type, causing incorrect field interpretation that could lead to funds being attributed to wrong accounts? (Critical)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_resource()] [Resource deserialization] Does view_resource() validate that the blob contains exactly one resource instance, or can an attacker pack multiple resources in one blob violating Move's resource uniqueness invariant? (Critical)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_resource()] [Generic resource exploitation] Can an attacker instantiate resource structs with malicious generic parameters that cause incorrect field sizes or layouts during annotation? (High)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_resource()] [Ability violation] Does the function verify that the struct has the 'store' ability required for resources, or can non-resource structs be falsely presented as resources? (High)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_resource()] [Field count mismatch] If the blob contains more or fewer fields than the struct definition, does view_resource() detect this or silently misinterpret the data? (Medium)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_resource()] [Nested resource handling] Can an attacker exploit nested resources within the main resource to bypass resource tracking or cause double-counting in indexers? (Medium)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_struct_fields()] [Field reordering] Can an attacker exploit struct field ordering to cause fields to be interpreted as different types, leading to value confusion attacks? (Critical)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_struct_fields()] [Identifier collision] Can malicious field identifiers cause hash collisions or name conflicts that lead to wrong fields being accessed? (High)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_struct_fields()] [Vector field overflow] For vector-typed fields, can an attacker craft blobs that cause integer overflow when calculating vector lengths or element offsets? (High)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_struct_fields()] [Option handling] Does the function properly handle Option<Identifier> return value, or can None struct names cause downstream systems to crash? (Medium)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_struct_fields()] [Move value corruption] Can the Vec<(Identifier, MoveValue)> contain malformed MoveValues that violate Move's type invariants? (Medium)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_function_arguments()] [Argument count mismatch] Can an attacker provide more or fewer arguments than the function expects, causing type confusion or out-of-bounds access during annotation? (Critical)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_function_arguments()] [Type argument substitution] Can malicious ty_args be used to instantiate generic functions with unexpected types that bypass validation checks? (Critical)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_function_arguments()] [Function signature spoofing] Can an attacker reference a non-existent function to cause the annotator to use arbitrary type layouts for argument interpretation? (High)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_function_arguments()] [Module mismatch] If the function signature changes between module versions, can stale signatures be used to misinterpret arguments? (High)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_function_arguments()] [Serialized argument tampering] Can an attacker provide args blobs that don't match the expected argument types, causing type confusion during deserialization? (Medium)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_function_arguments()] [Reference argument handling] For reference parameters (&T or &mut T), does the function properly handle the indirection or can pointer arithmetic be exploited? (Medium)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_function_returns()] [Return value forgery] Can an attacker craft return value blobs that don't match the function's actual return signature, causing downstream consumers to process fraudulent data? (Critical)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_function_returns()] [Multiple return handling] For functions returning multiple values, can an attacker exploit tuple unpacking to cause return values to be assigned to wrong variables? (High)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_function_returns()] [Resource return leakage] If a function returns a resource, does view_function_returns() properly track it or can resources be duplicated through incorrect annotation? (Critical)",
  "[File: aptos-core/aptos-move/aptos-resource-viewer/src/lib.rs] [Function: view_function_returns()] [Generic return exploitation] Can type parameters in return types be instantiated incorrectly to cause return values to be interpreted as different types? (Medium)"
]