[
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Feature: CommissionChangeDelegationPool] [Commission theft] Can validators exploit CommissionChangeDelegationPool to retroactively increase commissions and steal delegator rewards? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Feature: PeriodicalRewardRateReduction] [Economic imbalance] Can timing attacks around PeriodicalRewardRateReduction activation allow validators to claim disproportionate rewards? (Medium)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Feature: TransactionSimulationEnhancement] [Side channel] Can TransactionSimulationEnhancement leak information about private state or pending transactions through simulation results? (Medium)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Feature: EnableEnumTypes] [Type confusion] Can EnableEnumTypes introduce type confusion vulnerabilities if enums are not properly validated during deserialization or type checking? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Feature: EnableFunctionValues] [Higher-order exploit] Can EnableFunctionValues enable higher-order function exploits where function pointers are manipulated to execute unauthorized code paths? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Feature: SessionContinuation] [State pollution] Can SessionContinuation leave stale state from failed transactions that pollutes subsequent transaction execution? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Feature: EnableLazyLoading] [Time-of-check-time-of-use] Can EnableLazyLoading introduce TOCTOU vulnerabilities where resource states change between lazy load time and use time? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Feature: MonotonicallyIncreasingCounter] [Counter overflow] What happens when MonotonicallyIncreasingCounter reaches maximum value? Can overflow cause counter reuse or wrap-around exploits? (Medium)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Feature: EnableTrustedCode] [Trust abuse] Can EnableTrustedCode be exploited to bypass security checks for code marked as trusted, even if that code has vulnerabilities? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Feature: NativeMemoryOperations] [Memory safety] Do NativeMemoryOperations maintain Move's memory safety guarantees, or can they be exploited for buffer overflows or use-after-free? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Feature: PermissionedSigner] [Permission bypass] Can PermissionedSigner's permission checks be bypassed through delegation or indirect calls? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Feature: EnableLoaderV2] [Loader bypass] Does EnableLoaderV2 properly validate loaded modules, or can it be exploited to load malicious bytecode that bypasses verification? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Feature: DisallowInitModuleToPublishModules] [Publishing bypass] If this feature is disabled, can init_module functions deploy additional modules to bypass deployment restrictions? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Feature: OrderlessTransactions] [Replay attacks] Does OrderlessTransactions properly prevent replay attacks when transaction ordering is relaxed? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Feature: DistributeTransactionFee] [Fee distribution exploit] Can DistributeTransactionFee be exploited to redirect transaction fees to attacker addresses through fee distribution manipulation? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Governance] [Proposal frontrunning] Can an attacker frontrun a legitimate governance proposal to enable/disable features by submitting their own proposal with higher gas, gaining control over feature activation timing? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Governance] [Voting power calculation] If feature flags affect voting power calculation (like PartialGovernanceVoting), can an attacker enable features that increase their voting power mid-proposal to pass malicious governance changes? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Governance] [Proposal atomicity] Are feature flag changes atomic with the governance reconfigure() call at line 230? Could race conditions between feature activation and reconfiguration cause inconsistent validator states? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Governance] [Emergency disable] Is there a mechanism to emergency-disable a malicious feature after activation? Could lack of rapid response enable prolonged exploitation? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Governance] [Proposal expiry] Do feature flag proposals have expiration? Could old proposals be revived and executed in unintended contexts? (Medium)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Governance] [Multi-step dependencies] In multi-step proposals, can step dependencies be violated, allowing steps to execute in wrong order or skip critical safety checks? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Governance] [Testnet/mainnet isolation] How is the is_testnet flag at line 182 enforced? Can testnet governance proposals accidentally execute on mainnet? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Governance] [Proposal replay] Can feature flag proposals be replayed across epochs or after rollback, causing features to be re-enabled unexpectedly? (High)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Epoch] [Mid-epoch activation] The code calls change_feature_flags_for_next_epoch (line 227). What prevents features from being activated mid-epoch, causing validators to process transactions with different feature sets? (Critical)",
  "[File: aptos-move/aptos-release-builder/src/components/feature_flags.rs] [Epoch] [Reconfiguration timing] Can reconfigure() at line 230 be called at inopportune times (like during consensus voting) to cause validator disagreement or halt progress? (Critical)"
]