[
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Struct: EventFilter] [Memory exhaustion] Can an attacker craft EventFilter instances with extremely long data_substring_filter strings (e.g., millions of characters) to exhaust memory during deserialization, causing indexer node crashes and loss of availability? (High)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Struct: EventFilter] [State inconsistency] Does the OnceCell data_substring_finder field at line 41 create thread-safety issues where multiple concurrent filter operations could initialize different Finder instances, leading to inconsistent filtering results across parallel event processing? (Medium)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Struct: EventFilter] [Logic bypass] Can an attacker exploit the Option<String> type for data_substring_filter to inject empty strings that pass validation but match all events, effectively bypassing intended filtering restrictions? (Medium)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Struct: EventFilter] [Serialization attack] Does the #[serde(deny_unknown_fields)] at line 29 properly prevent attackers from injecting malicious additional fields during deserialization that could corrupt filter state or bypass security checks? (Low)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Struct: EventFilter] [Clone safety] Does the Clone implementation properly handle the OnceCell field, or can cloning create shared mutable state between filter instances leading to data races in concurrent filtering operations? (Medium)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: from() proto to EventFilter] [Input validation] Can an attacker send maliciously crafted protobuf messages with invalid UTF-8 sequences in data_substring_filter that bypass proto validation but cause panics during Finder initialization at line 92? (High)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: from() proto to EventFilter] [Resource exhaustion] Does the proto conversion at lines 45-50 validate the size of data_substring_filter, or can attackers send gigabyte-sized strings that exhaust heap memory during the conversion process? (High)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: from() proto to EventFilter] [Null pointer] Can the proto_filter.struct_type.map() at line 48 cause undefined behavior if the protobuf library allows null pointers in the Option, leading to crashes or memory corruption? (Medium)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: from() proto to EventFilter] [State corruption] Does the OnceCell initialization at line 49 create an uninitialized state where subsequent calls to matches() could fail silently if the data_substring_finder was not properly set up? (Medium)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: from() proto to EventFilter] [Type confusion] Can an attacker manipulate the proto_filter.struct_type field to contain malformed MoveStructTagFilter data that causes type confusion during the conversion at line 48, potentially leading to incorrect filtering or crashes? (Medium)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: into() EventFilter to proto] [Data loss] Does the conversion at lines 55-60 properly handle cases where data_substring_finder was initialized, or does it silently drop the cached Finder state, potentially causing performance degradation or inconsistent behavior? (Low)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: into() EventFilter to proto] [Information leak] Can the conversion expose sensitive information from the internal data_substring_finder field that should remain private, potentially revealing filtering logic to unauthorized parties? (Low)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: into() EventFilter to proto] [Move semantics] Does the move semantics of the Into trait at line 55 properly consume the EventFilter, or can use-after-move bugs allow accessing the moved filter, causing undefined behavior? (Low)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: validate_state()] [Logic bypass] Can an attacker bypass the validation at line 66 by setting both data_substring_filter and struct_type to Some but with empty/trivial values, passing validation but effectively creating a match-all filter? (Medium)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: validate_state()] [Validation bypass] Does line 66 properly check if both fields are None, or can attackers exploit race conditions during filter construction where fields are temporarily None, allowing invalid filters to pass validation? (Medium)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: validate_state()] [Error handling] Can line 67 return an error that leaks sensitive information about the filter configuration through the error message, potentially revealing internal system details to attackers? (Low)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: validate_state()] [Recursive validation] Does the validation at line 70 (data_substring_filter.is_valid()) properly recurse into Option<String> validation, or can malformed strings bypass validation and cause crashes during substring matching? (High)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: validate_state()] [Nested filter attack] Can the struct_type.is_valid() call at line 71 be exploited by providing deeply nested MoveStructTagFilter structures that cause stack overflow during recursive validation? (Medium)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: validate_state()] [Short-circuit evaluation] Does the validation properly check both data_substring_filter and struct_type at lines 70-71, or can short-circuit evaluation allow an invalid struct_type to pass if data_substring_filter validation fails first? (Low)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: validate_state()] [TOCTOU vulnerability] Can time-of-check-time-of-use races occur between validate_state() execution and subsequent matches() calls where filter fields are modified by concurrent threads, bypassing validation? (High)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: matches()] [Input validation] Does matches() properly validate the Event parameter at line 76, or can maliciously crafted Event objects with null pointers or invalid data cause crashes during filtering? (High)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: matches()] [Panic on malformed input] Can the matches() function at lines 76-99 panic if the Event contains malformed UTF-8 in the data field, causing the entire indexer process to crash and leading to loss of availability? (High)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: matches()] [Logic error] Does the early return pattern at lines 82 and 85 correctly implement AND logic between filters, or can certain combinations of filter values cause incorrect matching behavior that allows unauthorized events through? (Medium)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: matches()] [Performance DoS] Can an attacker flood the indexer with events that trigger worst-case matching complexity, such as events with gigabytes of data requiring full substring scans at line 93, causing CPU exhaustion? (High)",
  "[File: ecosystem/indexer-grpc/transaction-filter/src/filters/event.rs] [Function: matches()] [Immutability assumption] Does the &self parameter ensure thread-safety, or can interior mutability in OnceCell at line 90-92 create data races when multiple threads call matches() concurrently on the same filter instance? (High)"
]