[
  "[File: config/global-constants/src/lib.rs] [MAX_GAS_AMOUNT] [Block gas limit relationship] How does MAX_GAS_AMOUNT relate to per-block gas limits, and can attackers exploit this relationship to cause block production failures? (Medium)",
  "[File: config/global-constants/src/lib.rs] [DEFAULT_BUCKETS] [Bucket selection algorithm] Can attackers craft gas usage values that consistently fall between buckets, evading histogram-based anomaly detection? (Low)",
  "[File: config/global-constants/src/lib.rs] [All constants] [Initialization order] Can attackers exploit module initialization order to read these constants before they are properly initialized, obtaining invalid or zero values? (Medium)",
  "[File: config/global-constants/src/lib.rs] [Gas constants] [Circular dependency] Can circular dependencies between this module and gas calculation modules cause initialization deadlocks or incorrect constant values? (Medium)",
  "[File: config/global-constants/src/lib.rs] [Storage constants] [Name collision with user data] Can users create storage entries with the same names as CONSENSUS_KEY, SAFETY_DATA, etc., causing collisions that corrupt validator data? (High)",
  "[File: config/global-constants/src/lib.rs] [adjust_gas_headroom] [Mathematical correctness] Has the 1.5x headroom formula been formally verified to provide adequate margin for all transaction types, or can certain edge cases cause insufficient headroom? (Medium)",
  "[File: config/global-constants/src/lib.rs] [Gas constants] [Economic game theory] Have the fixed gas constants been analyzed for game-theoretic exploits, or can strategic attackers manipulate transaction ordering to maximize damage within gas limits? (Medium)",
  "[File: config/global-constants/src/lib.rs] [String constants] [Unicode normalization] Can different Unicode normalization forms of CONSENSUS_KEY or other string constants cause storage lookups to fail or access wrong keys? (Low)",
  "[File: config/global-constants/src/lib.rs] [Storage constants] [Locale-specific issues] Can locale-specific string handling in some storage backends cause these English string constants to be misinterpreted? (Low)",
  "[File: config/global-constants/src/lib.rs] [adjust_gas_headroom] [No error return] The function returns u64 with no error indication - can this silent failure mode hide critical errors in gas calculation that should halt transactions? (Medium)",
  "[File: config/global-constants/src/lib.rs] [All constants] [No runtime validation] Can the lack of runtime validation of these compile-time constants allow corrupted binaries to run with invalid constant values? (High)"
]