[
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 64-69] [Memory exhaustion] Can an attacker inject STACK_SIZE = u64::MAX, causing each thread to reserve enormous virtual memory, leading to OOM when combined with NUM_THREADS configuration? (High)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 64-69] [Integer overflow] When parsing STACK_SIZE from string to usize, are there platform-specific differences (32-bit vs 64-bit) that could cause overflow or truncation issues? (Low)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 64-69] [Default stack size safety] Is the default 4MB stack size (4 * 1024 * 1024) sufficient for deep recursion in test scenarios, or could complex test cases cause stack overflow despite this configuration? (Low)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 12-69] [Lazy initialization race] Can concurrent access to all Lazy<T> statics from multiple threads during first initialization cause race conditions, data races, or inconsistent state if initialization has side effects? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 12-69] [Initialization panic] If any Lazy initialization panics (e.g., URL parsing failure, env var parsing error), can this poison the Lazy cell and cause all subsequent access attempts to panic, DoSing the entire test suite? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 12-69] [Memory visibility] Are Lazy<T> memory barriers sufficient to prevent visibility issues where one thread sees uninitialized or partially initialized values when accessing these constants concurrently? (Low)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 12-69] [Environment variable leakage] Are environment variables properly sanitized in logs/error messages, or could sensitive values (auth tokens, custom URLs) be leaked through debug output or error traces? (Low)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 12-69] [Configuration injection] Can attackers with access to the environment where tests run inject arbitrary values for all these environment variables, completely controlling test behavior and potentially extracting sensitive data from real networks? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 12-69] [Type conversion safety] Are all string-to-numeric conversions using parse() safe against panic on invalid input, or could malformed environment variables cause unwrap() panics that crash the test process? (Low)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 12-69] [Unicode handling] Do environment variable parsing routines properly handle Unicode, null bytes, or non-UTF8 sequences that could bypass validation or cause unexpected behavior in downstream string processing? (Low)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 12-69] [Configuration validation] Is there any validation that the combination of NUM_THREADS, STACK_SIZE, PERSISTENCY_TIMEOUT, and SLEEP_PER_CYCLE values is coherent and doesn't create impossible test conditions? (Low)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Line: 31] [FUND_AMOUNT usage] In downstream code that uses FUND_AMOUNT for balance checks or transfers, can integer overflow occur when performing arithmetic operations (multiplication, addition) without checked math? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 19-29] [URL cloning cost] Do all downstream usages of DEVNET_NODE_URL/TESTNET_NODE_URL/etc. properly clone() the Url, or could reference lifetime issues cause use-after-free or dangling pointer bugs? (Low)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 36-51] [Duration arithmetic] When combining PERSISTENCY_TIMEOUT and SLEEP_PER_CYCLE in loops, can duration arithmetic overflow or underflow, causing infinite loops or immediate timeouts? (Low)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 56-69] [Runtime builder] Does the tokio/async runtime builder properly validate NUM_THREADS and STACK_SIZE, or can invalid combinations cause runtime initialization failure or silent degradation? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 19-29] [Production network risk] If these test constants are accidentally imported and used in production code, could transactions be sent to devnet/testnet URLs instead of mainnet, causing fund loss? (High)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 12-17] [Network confusion] Can incorrect NETWORK_NAME configuration cause tests to run against the wrong network (testnet vs devnet), potentially affecting real user accounts or mainnet if accidentally configured? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Line: 31] [Faucet abuse] If FUND_AMOUNT is used in a loop without rate limiting, can tests drain the devnet/testnet faucet, causing DoS for other developers trying to test? (Low)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 36-42] [Test timeout bypass] Can malicious tests exploit PERSISTENCY_TIMEOUT to run indefinitely, occupying CI/CD resources and preventing other tests from running? (Low)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 19-20] [SSRF potential] If DEVNET_NODE_URL is somehow made configurable via environment variable in future changes, could attackers use this to perform SSRF attacks against internal infrastructure by pointing to http://localhost or internal IPs? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 56-61] [Thread exhaustion] If tests create additional threads beyond NUM_THREADS, can the total thread count exceed system limits, causing thread creation failure and test hangs? (Medium)",
  "[File: aptos-core/crates/aptos-api-tester/src/consts.rs] [Lines: 64-69] [Virtual memory exhaustion] On systems with memory limits, can NUM_THREADS * STACK_SIZE exceed available virtual memory, causing thread creation to fail silently or with cryptic errors? (Medium)"
]