[
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: get_derived_test_dir()] [Path Traversal] Can an attacker manipulate the GlobalConfig to inject malicious path components (e.g., '../../../etc/passwd') that bypass sanitization in get_config_location(), allowing arbitrary directory access or deletion when combined with force_restart? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 239-248] [Directory Deletion Race] When force_restart is enabled and remove_dir_all() is called, can an attacker create a symlink in test_dir pointing to critical system directories during the prompt_yes window, causing deletion of system files when the removal executes? (Critical)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 244] [TOCTOU Attack] Between the test_dir.exists() check at line 239 and remove_dir_all() at line 244, can an attacker replace the test directory with a symlink to critical data, causing unintended deletion of important system or blockchain state? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 250-256] [Race Condition] Between checking !test_dir.exists() and calling create_dir_all(), can concurrent execution or an attacker-controlled process create the directory with malicious permissions or contents, leading to privilege escalation or data corruption? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: get_derived_test_dir() line 503-511] [Path Injection] Does GlobalConfig::load() properly sanitize user-controlled configuration paths, or can an attacker inject absolute paths or '..' traversal sequences to point test_dir to arbitrary locations like /root or system directories? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 220-233] [Docker Network Validation Bypass] When a custom docker_network is provided, the code only checks network existence via network_exists() - can an attacker specify a malicious network they control to intercept or manipulate traffic between localnet containers? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: get_docker_network() line 121-126] [Network Name Injection] Can an attacker inject special characters or Docker API commands in the docker_network parameter that get executed when passed to Docker operations, leading to container escape or host compromise? (Critical)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 212-216] [Logic Bypass] The check preventing docker_network without with_indexer_api can be bypassed if indexer_api_args.with_indexer_api is manipulated - is there proper validation that Docker operations only occur when truly needed? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: wait_for_startup() line 131-194] [Health Check Race] The futures are collected in a Vec and joined with join_all - can an attacker trigger conditions where health checkers return out of order, causing dependent services to start before their prerequisites are truly ready, leading to state corruption? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 403-419] [Service Startup Race] The tokio::select! waits for either wait_for_startup() or join_set.join_next() - if a service crashes immediately after passing its health check but before wait_for_startup() completes, can this create inconsistent state where some services think prerequisites are ready when they're not? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 391-396] [Manager Spawn Race] Services are spawned into a JoinSet without synchronization - can race conditions during concurrent manager.run() calls lead to resource conflicts, duplicate port bindings, or inconsistent initialization of shared state? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 374-378] [Pre-Run Race] Multiple managers execute pre_run() sequentially, but can an attacker exploit timing windows between pre_run() calls to manipulate shared resources (Docker networks, volumes, filesystem) causing subsequent managers to operate on corrupted state? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 438-444] [Signal Handler Registration Delay] The ctrl-c handler is only registered AFTER all services have started - can an attacker send SIGTERM or other signals during startup to terminate the process without running shutdown_steps, leaving containers/volumes/networks orphaned? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 469-476] [Double Ctrl-C Handler Race] When the second ctrl-c handler is registered at line 469, can race conditions occur if multiple signals arrive simultaneously, causing some shutdown steps to be skipped or executed multiple times, leading to data corruption? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 450-458] [Task ID Comparison Vulnerability] The code uses task ID comparison to determine if ctrl-c was pressed - can an attacker manipulate task IDs through timing attacks or JoinSet manipulation to make a service failure appear as ctrl-c, hiding error conditions? (Low)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: run_shutdown_steps() line 493-501] [Shutdown Step Ordering] Shutdown steps are collected with .rev() but executed sequentially - can an attacker exploit dependencies between shutdown steps to cause some steps to fail, leaving resources (Docker containers, network connections) in inconsistent states? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 479] [Shutdown Step Error Handling] If run_shutdown_steps() returns an error, the process still continues to line 481 - can this lead to situations where critical cleanup (Docker container removal, network deletion) is skipped, causing resource exhaustion or security issues on subsequent runs? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 286-348] [Manager Construction Race] Managers are built sequentially but may access shared state (test_dir, Docker daemon) - can concurrent access to these resources from already-running managers during construction lead to race conditions in file creation, Docker operations, or network setup? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 352-355] [Health Checker Deduplication] Health checkers are collected into a HashSet - if two managers return health checkers with the same hash but different underlying state, can this cause one to be silently dropped, leading to services starting before prerequisites are ready? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: wait_for_startup() line 139-153] [Silent Health Check Logic] Processors have silent=true to avoid spam, but IndexerApiMetadata health checks are skipped with 'continue' - can an attacker exploit this to start the indexer API with invalid metadata, causing subsequent queries to return corrupted data? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 424-429] [Post Healthy Step Execution] Post healthy steps run after services start but may depend on each other - if one step modifies state that another depends on, can race conditions cause inconsistent application of metadata or configuration? (Low)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Struct: RunLocalnet line 68] [Test Dir Input Validation] The test_dir Option<PathBuf> accepts arbitrary user input - can an attacker provide paths like '/dev/null', '/proc/self/fd/1', or paths with null bytes to cause file operation failures, information disclosure, or crashes? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Struct: RunLocalnet line 115] [Docker Network Name Injection] The docker_network Option<String> is not validated for Docker naming constraints - can an attacker inject names containing newlines, Unicode, or Docker API special characters that cause command injection or API parsing vulnerabilities? (High)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Struct: RunLocalnet line 103] [Bind Address Validation] While bind_to accepts Ipv4Addr which is type-safe, can an attacker exploit the automatic detection logic at lines 273-283 by manipulating .dockerenv file presence to force binding to 0.0.0.0, exposing services to unauthorized network access? (Medium)",
  "[File: aptos-core/crates/aptos/src/node/local_testnet/mod.rs] [Function: execute() line 415] [Unwrap on JoinSet] The code uses 'res.unwrap()' assuming the JoinSet is never empty - if a race condition causes the JoinSet to be empty (e.g., all tasks abort immediately), this will panic, potentially bypassing shutdown steps and leaving resources in inconsistent state? (High)"
]