[
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: next()] [Block Size Limits] If consensus has a maximum block size, does the iterator respect this limit, or can it return more transactions than fit in a block causing execution failures? (Medium)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn()] [Gas Limit Tracking] Does the iterator consider cumulative gas usage, or can it return transactions that exceed block gas limits leading to rejected blocks? (Medium)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn_inner()] [Transaction Dependencies] If transactions have dependencies (e.g., sequence numbers), can the shuffling logic reorder dependent transactions incorrectly causing execution failures? (High)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: extended_with()] [Mempool Integration] When transactions come from mempool, does extended_with() preserve mempool priority hints, or does shuffling override mempool ordering without validation? (Medium)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Struct: ShuffledTransactionIterator] [Reconfiguration] During epoch changes or validator set reconfigurations, is the iterator state properly cleared, or can stale delayed_queue entries persist across epochs? (High)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Generic: Txn] [Type Confusion] The generic Txn must implement UseCaseAwareTransaction - can incorrect trait implementations cause parse_sender() or parse_use_case() to return inconsistent values across invocations for the same transaction? (High)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Generic: Txn] [Debug Trait Requirement] Why does Txn require Debug trait, and can Debug implementations that panic or have side effects cause issues during logging or error handling? (Low)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: extended_with()] [IntoIterator Safety] Can malicious IntoIterator implementations passed to extended_with() exploit the iterator protocol to inject malicious transactions or cause panics? (Low)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Trait: Iterator] [Lifetime Issues] Does the Iterator implementation properly handle lifetimes, or can returned transactions have dangling references if the iterator is dropped while transactions are still being processed? (Medium)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Struct: ShuffledTransactionIterator] [Clone Safety] ShuffledTransactionIterator is not Clone - if code incorrectly clones it via unsafe code, can this cause two iterators to share mutable state leading to race conditions? (Low)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn_inner()] [Sequence Number Ordering] Can the shuffling logic reorder transactions from the same sender such that higher sequence numbers execute before lower ones, causing transaction failures? (High)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn_inner()] [Account Nonce Gaps] If sender_spread_factor causes transactions from the same account to be spread out, can this create nonce gaps that prevent subsequent transactions from executing? (Medium)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn_inner()] [Multi-Sender Coordination] Can multiple senders coordinate to submit transactions with specific sequence numbers that, when shuffled, create patterns exploitable for front-running? (Medium)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn_inner()] [Sequence Number Verification] Does the iterator verify that sequence numbers are valid before shuffling, or can invalid sequence numbers cause execution errors after shuffling? (Low)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn_inner()] [MEV Extraction] Can validators manipulate Config parameters (spread factors) per block to reorder transactions favorably for MEV extraction without being detected? (High)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn_inner()] [Front-Running] By understanding the shuffling algorithm, can attackers time their transaction submissions to land in positions that allow front-running victim transactions? (High)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: extended_with()] [Transaction Priority Fees] Does the shuffler consider transaction priority fees/tips, or does it ignore economic signals potentially causing inefficient block space allocation? (Medium)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn_inner()] [Censorship Resistance] Can the shuffling mechanism be exploited to censor specific transactions by delaying them indefinitely through use_case or sender manipulation? (High)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn_inner()] [Fair Ordering] Does the three-stage selection provide fair ordering guarantees, or can sophisticated attackers exploit the priority logic to consistently order their transactions favorably? (Medium)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn_inner()] [Early Return Path] At line 51, if pop_head(true) returns Some, the function returns early - can this cause input_idx and output_idx tracking to become misaligned over time? (Medium)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn_inner()] [Loop Exit Condition] The while loop at line 56 exits when input_queue is empty - can this condition be met prematurely due to concurrent modifications if the iterator is unsafely accessed? (Low)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn_inner()] [Return None Path] If the function reaches line 66 and pop_head(false) returns None, does this correctly represent that all transactions have been processed, or can transactions remain stuck in delayed_queue? (High)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn_inner()] [Input Index Gap] Between lines 57-58 where input_idx is captured and incremented, can race conditions cause multiple transactions to receive the same input_idx? (Low - requires unsafe concurrent access)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn_inner()] [Queue or Return None] At line 60, if queue_or_return returns None (transaction was queued), the loop continues - can this loop infinitely if input_queue keeps getting refilled externally? (Medium)",
  "[File: consensus/src/transaction_shuffler/use_case_aware/iterator.rs] [Function: select_next_txn_inner()] [Placeholder Draining] delayed_queue.bump_output_idx() drains placeholders - if placeholders are incorrectly drained, can this cause subsequent transactions from those accounts to bypass delays? (High)"
]