[
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: is_resource_supported()] [Module address hardcoding] The function checks for '0x1::coin::' prefix - if governance upgrades the coin module to a different address, will this break all coin indexing until code update? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: from_write_resource()] [Type string construction] Lines 215-220 manually construct the type string - can mismatches between this construction and Move's canonical type representation cause the indexer to miss coin resources? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: CoinInfoResource] [String memory] The name and symbol are unbounded Strings - can an attacker create coins with multi-megabyte names causing memory exhaustion when the indexer loads all coin metadata? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: CoinInfoType] [coin_type length] The coin_type String can be extremely long (generic type parameters) - can deeply nested generic types like 'Coin<Coin<Coin<...>>>' cause exponential memory usage or parsing DoS? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: get_coin_type_trunc()] [Truncation allocation] Truncating to 5000 chars still requires allocating the full string first - can attackers flood the indexer with coins having multi-megabyte type names causing memory DoS before truncation? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: CoinStoreResource] [Balance vs events] The struct tracks both current balance (coin.value) and event handles - can discrepancies between balance and cumulative events (deposits - withdrawals) indicate indexer bugs or on-chain exploits? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: OptionalAggregatorResource] [Dual tracking] The struct has both aggregator (for table-based supply) and integer (for direct supply) - if both are populated with different values, which is authoritative, and can this duality be exploited? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: get_supply()] [None semantics] Returning None from get_supply() is ambiguous - does it mean supply is not tracked, zero, or unknown? Can this ambiguity cause UI to display incorrect 'unlimited supply' for coins with zero supply? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: to_hash()] [Hash collision resistance] If hash_str() produces 32-byte hashes, the birthday paradox suggests collisions after ~2^16 coins - is this acceptable for the number of expected coins on Aptos? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: to_hash()] [Hash preimage attack] Can an attacker who knows the hash algorithm find two different coin_type strings that hash to the same value, then register one legitimately and use the other for phishing? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: EventGuidResource] [Compound key uniqueness] The struct uses (addr, creation_num) as a compound key for event identity - can two different accounts have events with the same creation_num, and does the indexer properly handle this? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: get_name_trunc()] [Database index efficiency] If coin names are indexed in the database after truncation, can attackers create many coins with identical prefixes to degrade index performance on name lookups? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: get_symbol_trunc()] [UI collision] Truncated 10-char symbols displayed in UIs - can attackers create scam coins with symbols like 'Bitcoin   ' (with trailing spaces) that truncate to 'Bitcoin', confusing users? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: CoinInfoResource] [Zero decimals] If decimals = 0, can arithmetic operations that assume decimals > 0 cause division by zero when normalizing amounts? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: CoinInfoResource] [Negative decimals] The decimals field is i32 - if negative values are allowed, can they cause exponential growth when denormalizing amounts (amount * 10^(-decimals))? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: Coin] [Zero balance] Does the indexer correctly handle CoinStore resources with value = 0, or can zero balances cause division-by-zero in percentage calculations or be incorrectly filtered out? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: IntegerResource] [Supply overflow] If a coin's supply exceeds BigDecimal's maximum representable value, does get_supply() return an error, saturate, or wrap around silently? (Critical)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: from_resource()] [Version parameter usage] The txn_version parameter is only used in error messages - should it also be used for versioned parsing logic to handle breaking changes in coin resource formats across protocol upgrades? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: from_write_resource()] [Write ordering] The function doesn't track write ordering within a transaction - can reordering of CoinStore writes cause the indexer to process balance changes out of order? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Derive: Serialize/Deserialize] [Circular references] If coin resource JSON contains circular references (possible with table handles), can deserialization loop infinitely or cause stack overflow? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: from_resource()] [JSON bomb] Can an attacker craft JSON with deeply nested objects or arrays that exponentially expand during deserialization, causing DoS via memory/CPU exhaustion? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Macro: deserialize_from_string] [String escaping] When deserializing numeric strings, can special characters (NaN, Infinity, exponent notation) bypass validation and inject invalid BigDecimal values? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: CoinInfoResource] [Field addition] If future protocol upgrades add new fields to CoinInfo (e.g., max_supply), will the indexer silently ignore them causing incomplete coin metadata? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Struct: OptionalAggregatorResource] [Structure changes] The nested wrapper structure (OptionalAggregatorWrapperResource -> OptionalAggregatorResource) seems fragile - can Move framework changes break this without compile-time errors? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/coin_utils.rs] [Function: is_resource_supported()] [Version compatibility] Hardcoded type strings assume specific module structure - if the coin module is refactored in a protocol upgrade, will all historical coins become unsupported? (High)"
]