[
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g1_multi_exp()] [Single element] Is the single-element case at line 69 (bases[0].mul(scalars[0])) timing-safe, or does it leak information about scalar values through execution time? (Medium)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g1_multi_exp()] [blst_hell bug] What is the 'blst_hell' bug mentioned in the comment, and could attackers still exploit it by crafting inputs that bypass the length check to cause heisenbugs in DKG? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g1_multi_exp()] [Scalar validity] Does g1_multi_exp() validate that scalars are properly reduced modulo the field order, or can unreduced scalars cause incorrect multi-exp results breaking DKG security? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g1_multi_exp()] [Point validity] Are G1Projective points validated to be on the curve before multi-exp, or can malicious validators provide invalid points that break pairing checks? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g1_multi_exp()] [Subgroup check] Does the implementation verify that G1 points are in the prime-order subgroup, or can small-subgroup attacks compromise DKG security? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g1_multi_exp()] [Integer overflow] Can the multi-exp algorithm overflow when computing window tables or bucket indices for very large input arrays, causing incorrect DKG public key generation? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g1_multi_exp()] [Memory exhaustion] Does G1Projective::multi_exp() limit the maximum array size, or can attackers provide millions of points to exhaust validator memory during DKG? (Medium)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g1_multi_exp()] [Determinism] Is the multi_exp() result deterministic across different CPU architectures and parallel execution strategies, ensuring all validators compute identical DKG outputs? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g1_multi_exp()] [Zero scalar] How are zero scalars handled in the multi-exp - are they skipped for efficiency, or could timing differences leak information about which validators contributed to DKG? (Medium)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g1_multi_exp()] [Infinity point] Can the multi-exp result be the point at infinity, and if so, is this properly handled in downstream DKG verification to prevent trivial forgeries? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g1_multi_exp()] [Race condition] If multiple threads call g1_multi_exp() concurrently during parallel DKG verification, could race conditions in the underlying blstrs library cause non-deterministic results? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g2_multi_exp()] [Length mismatch] Does the panic at line 76-80 when bases.len() != scalars.len() create a DoS vector where malicious validators send mismatched arrays to crash honest nodes? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g2_multi_exp()] [Empty input] When bases.len()=0, does returning G2Projective::identity() correctly represent empty multi-exp, or could this allow bypass of G2 signature aggregation checks? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g2_multi_exp()] [Single element] Is the single-element case at line 85 constant-time, or do timing variations leak scalar values used in DKG encryption? (Medium)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g2_multi_exp()] [blst_hell bug] Is the G2 multi_exp vulnerable to the same 'blst_hell' bug as G1, and could attackers exploit G2-specific edge cases? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g2_multi_exp()] [Scalar validity] Are G2 scalars validated to be in the correct range, or can out-of-range scalars cause wrapping and incorrect DKG key shares? (High)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g2_multi_exp()] [Point validity] Does g2_multi_exp() verify G2 points are valid curve points, or can invalid points cause pairing checks to pass incorrectly? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g2_multi_exp()] [Subgroup check] Are G2 points checked to be in the prime-order subgroup (not just the curve), preventing small-subgroup attacks on DKG? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g2_multi_exp()] [Performance] Is G2 multi_exp significantly slower than G1 due to larger field size, creating timing-based DoS opportunities during DKG verification? (Low)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g2_multi_exp()] [Memory allocation] Does G2Projective::multi_exp() allocate excessive memory for window tables with large arrays, causing OOM during DKG aggregation? (Medium)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g2_multi_exp()] [Determinism] Is G2 multi_exp deterministic across different optimization levels and CPU features (AVX2, AVX512), ensuring consensus? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g2_multi_exp()] [Twist security] Does the G2 implementation use the correct twist of the BLS12-381 curve, or could twist attacks compromise pairing security? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: g2_multi_exp()] [Zero handling] Are zero scalars in G2 multi_exp properly handled without leaking information through timing or branching? (Low)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: parallel_multi_pairing()] [Iterator exhaustion] Does the zip() at line 101 properly handle iterators of different lengths, or could mismatched lengths cause silent truncation and incorrect pairing results? (Critical)",
  "[File: aptos-core/crates/aptos-dkg/src/utils/mod.rs] [Function: parallel_multi_pairing()] [Memory allocation] Does the double collect() at lines 102-106 allocate excessive memory by creating intermediate vectors, causing OOM during large DKG verification? (Medium)"
]