[
  "[File: tokens.rs::Token::from_transaction()] [Integer Overflow] Can an attacker craft a transaction with extremely large transaction_version values that could overflow when cast to i64, potentially causing panics or incorrect indexing of token data? (High)",
  "[File: tokens.rs::Token::from_write_table_item()] [Hash Collision] In token_data_id.to_hash() computation, can an attacker create two different tokens with identical hashes by manipulating creator/collection/name fields, causing database conflicts and token ownership confusion? (Critical)",
  "[File: tokens.rs::Token::from_write_table_item()] [Type Confusion] Can an attacker provide a table_item with value_type claiming to be Token but containing malformed data, bypassing TokenWriteSet::from_table_item_type validation and causing deserialization errors or incorrect token creation? (Medium)",
  "[File: tokens.rs::Token::from_write_table_item()] [Missing Owner Validation] When table_handle_to_owner lookup returns None, token ownership tracking fails silently - can this be exploited to create 'orphaned' tokens with no tracked owner, enabling theft or double-spending? (High)",
  "[File: tokens.rs::Token::from_delete_table_item()] [Zero Amount Exploit] When deleting tokens, amount is hardcoded to BigDecimal::zero() - can an attacker exploit this by repeatedly deleting and recreating tokens to manipulate supply tracking or create inconsistent ownership records? (Medium)",
  "[File: tokens.rs::Token::from_transaction()] [HashMap Collision] The tokens HashMap uses (token_data_id_hash, property_version) as key - can an attacker create multiple tokens in one transaction with identical keys to cause silent overwrites and token loss? (High)",
  "[File: tokens.rs::Token::from_transaction()] [Race Condition] Multiple write_set_changes are processed sequentially into HashMaps - can concurrent processing of the same transaction lead to race conditions where token ownership updates are lost or duplicated? (High)",
  "[File: tokens.rs::TableMetadataForToken::get_table_handle_to_owner()] [Resource Exhaustion] The function builds a complete HashMap from all transactions in a batch - can an attacker submit transactions with excessive WriteResource changes to cause memory exhaustion and DoS? (Medium)",
  "[File: tokens.rs::TableMetadataForToken::get_table_handle_to_owner()] [Type Filter Bypass] Only tokens with TokenResource::is_resource_supported types are processed - can an attacker create custom resource types mimicking token structures to bypass indexing or manipulate token data? (Medium)",
  "[File: tokens.rs::Token::from_write_table_item()] [Property Truncation] Token properties are stored as-is without validation - can an attacker inject excessively large JSON properties to cause database bloat, slow queries, or trigger JSON parsing vulnerabilities? (Low)",
  "[File: token_datas.rs::TokenData::from_write_table_item()] [Supply Manipulation] Token supply and maximum are taken directly from table_item data without validation - can an attacker craft TokenData with supply > maximum to violate supply invariants and mint unlimited tokens? (Critical)",
  "[File: token_datas.rs::TokenData::from_write_table_item()] [Royalty Division by Zero] royalty_points_denominator is stored without validation - can setting it to zero cause division-by-zero errors in royalty calculations, freezing marketplace transactions or enabling fee bypass? (High)",
  "[File: token_datas.rs::TokenData::from_write_table_item()] [Mutability Flag Abuse] Mutability flags (maximum_mutable, uri_mutable, etc.) are set from untrusted input - can an attacker set all flags to true on immutable collections to later modify locked token properties? (High)",
  "[File: token_datas.rs::TokenData::from_write_table_item()] [Missing Key Validation] The code expects TokenDataId as key when value is TokenData but only logs a warning if missing - can an attacker provide mismatched key/value types to create orphaned TokenData entries with no valid ID? (Medium)",
  "[File: token_datas.rs::TokenData::from_write_table_item()] [Address Standardization Race] standardize_address is called on creator and payee addresses - can inconsistent address formats between transactions cause the same user to have multiple token_data_id_hash values, fragmenting ownership? (Medium)",
  "[File: token_datas.rs::CurrentTokenData] [State Overwrite] CurrentTokenData uses token_data_id_hash as primary key - can an attacker create transactions that overwrite existing current state with older data, causing supply inconsistencies or metadata rollback? (High)",
  "[File: token_datas.rs::TokenData::from_write_table_item()] [Collection Hash Mismatch] collection_data_id_hash is computed from token_data_id fields - can mismatches between this derived hash and actual CollectionData cause tokens to reference non-existent collections? (Medium)",
  "[File: token_datas.rs::TokenData::from_write_table_item()] [BigDecimal Precision] Supply, maximum, and largest_property_version use BigDecimal - can precision loss in conversions or comparisons lead to incorrect supply tracking when values exceed certain thresholds? (Medium)",
  "[File: token_datas.rs::TokenData::from_write_table_item()] [URI Length Exploit] metadata_uri is truncated via get_uri_trunc() - can an attacker create tokens with identical truncated URIs but different full URIs to cause confusion or phishing attacks? (Low)",
  "[File: token_datas.rs::TokenData::from_write_table_item()] [Default Properties Injection] default_properties is deserialized from BCS hex string - can an attacker inject malicious BCS payloads to trigger deserialization vulnerabilities or cause parser crashes? (High)",
  "[File: token_ownerships.rs::TokenOwnership::from_token()] [Type Check Bypass] Function returns early if table_type != '0x3::token::TokenStore' - can an attacker create custom table types that bypass this check while still being indexed as ownerships, enabling phantom ownership? (High)",
  "[File: token_ownerships.rs::TokenOwnership::from_token()] [Amount Validation Missing] The amount parameter is passed directly without validation - can negative amounts be provided to represent debts or cause integer underflow in supply calculations? (High)",
  "[File: token_ownerships.rs::TokenOwnership::from_token()] [Owner Address None] When table metadata is missing, owner_address is set to None - can this create ownerships with no owner, enabling token theft by claiming these orphaned tokens? (Critical)",
  "[File: token_ownerships.rs::CurrentTokenOwnership] [Primary Key Collision] PK is (token_data_id_hash, property_version, owner_address) - can an attacker exploit property_version manipulation to create multiple ownership records for the same token, enabling double-spending? (Critical)",
  "[File: token_ownerships.rs::TokenOwnership::from_token()] [Table Handle Manipulation] table_handle is standardized but not validated against known TokenStore handles - can an attacker provide fake table handles to associate tokens with incorrect owners? (High)"
]