[
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: parse_program()] [Path Traversal] Can an attacker craft malicious IndexedPackagePath entries with path traversal sequences (../, symbolic links) in the targets or deps vectors to read arbitrary files from the validator's filesystem, potentially exposing private keys or configuration data? (Critical)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: parse_program()] [Race Condition] If multiple threads call parse_program() concurrently with overlapping file paths, can race conditions in the FilesSourceText HashMap insertion lead to inconsistent compilation state where different validators parse different versions of the same file? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: parse_program()] [Memory Exhaustion] Can an attacker provide an extremely large number of Move files in the targets/deps vectors to exhaust validator memory during the Vec allocation and extension operations, causing validator crashes and loss of liveness? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: parse_program()] [Named Address Manipulation] Can malicious named_address_maps with conflicting or circular address mappings cause undefined behavior or crashes during the address resolution phase, potentially halting all validators processing the same malicious package? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: parse_program()] [Diagnostic Bypass] At lines 109-112, can an attacker craft inputs that cause env_result to return Err with diagnostics that get silently absorbed into the diags collection, allowing BlockingError-level issues to bypass the safety checks and proceed to compilation? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: parse_program()] [Integer Overflow] Can extremely large targets or deps vectors cause integer overflow during Vec::extend operations or when calculating total file counts, leading to buffer overflows or incorrect memory allocation? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: parse_program()] [State Inconsistency] If parse_file() returns partial results before failing, can the source_definitions and lib_definitions vectors contain inconsistent or partially-parsed AST nodes that later cause determinism failures across validators? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: parse_program()] [Comment Map Injection] At line 88, can malicious files inject specially-crafted comments into the source_comments CommentMap that later get interpreted as code during macro expansion or spec processing, bypassing Move's type safety? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: parse_program()] [Package Definition Ordering] Can an attacker exploit the order of PackageDefinition construction in lines 83-87 and 99-103 to cause different validators to produce different AST orderings for the same input files, breaking consensus determinism? (Critical)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: parse_program()] [Error Handling Bypass] At line 114, can attackers craft inputs where diags.is_empty() returns true despite having suppressed critical errors, allowing malformed code to proceed past the parser phase? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: find_move_filenames_with_address_mapping()] [Symbolic Link Attack] At line 52, does find_move_filenames follow symbolic links? Can an attacker create symlinks pointing outside the package directory to include arbitrary .move files from sensitive locations like /etc or validator key directories? (Critical)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: find_move_filenames_with_address_mapping()] [Path Canonicalization] Can attackers provide paths with mixed case, Unicode normalization issues, or alternate representations that bypass the sort_by comparison at line 63, causing non-deterministic file ordering across validators? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: find_move_filenames_with_address_mapping()] [Named Address Duplication] At lines 54-58, can an attacker provide the same named_address_mapping for multiple different paths, causing address resolution conflicts that lead to different compilation results on different validators? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: find_move_filenames_with_address_mapping()] [File Enumeration Timing] Does the file discovery process have deterministic timing? Can differences in filesystem performance or directory entry ordering cause validators to timeout at different points, leading to inconsistent partial file lists? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: find_move_filenames_with_address_mapping()] [Resource Exhaustion] Can an attacker provide a directory path containing millions of .move files, causing the Vec extension at line 51 to exhaust memory before the OOM killer terminates the validator process? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: ensure_targets_deps_dont_intersect()] [Path Canonicalization Bypass] At lines 135-138, can attackers exploit std::fs::canonicalize failures or provide paths with different representations (hardlinks, mount points) that canonicalize differently on different validators, causing non-deterministic intersection detection? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: ensure_targets_deps_dont_intersect()] [Race Condition on Filesystem] Between the canonicalize() call at line 135 and the BTreeSet construction at lines 140-147, can filesystem modifications (file moves, symlink changes) cause TOCTOU vulnerabilities where intersection checks pass but actual file reads fail differently across validators? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: ensure_targets_deps_dont_intersect()] [sources_shadow_deps Flag Exploitation] At line 152, can an attacker manipulate the compilation_env flags to toggle sources_shadow_deps() dynamically, causing some validators to retain deps while others remove them via deps.retain() at line 153? (Critical)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: ensure_targets_deps_dont_intersect()] [Error Message Information Leak] At lines 156-164, does the error message leak sensitive filesystem paths that could help attackers map the validator's directory structure for further attacks? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: ensure_targets_deps_dont_intersect()] [BTreeSet Collision] Can hash collisions or equivalent string representations after canonicalization cause the intersection calculation at line 148 to miss actual duplicates, allowing the same file to be parsed twice with different package metadata? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: ensure_targets_deps_dont_intersect()] [deps.retain() Mutation] At line 153, can the in-place mutation of the deps vector cause memory corruption if other threads are simultaneously reading from deps, leading to use-after-free vulnerabilities? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: canonicalize()] [Symlink Loop] Can attackers create symlink loops that cause std::fs::canonicalize at line 135 to hang indefinitely or consume excessive stack space, causing validator DoS? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: parse_file()] [Path Injection] At line 178, can an attacker inject control characters, null bytes, or Unicode direction overrides into the fname Symbol that corrupt the File::open path resolution, potentially opening unintended files? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: parse_file()] [TOCTOU File Access] Between File::open at line 178 and read_to_string at line 181, can an attacker modify or replace the file, causing different validators to read different content for the same FileHash? (Critical)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/mod.rs] [Function: parse_file()] [FileHash Collision] At line 182, can attackers craft Move files with intentional SHA-256 collisions in FileHash::new() to cause different source files to map to the same hash, corrupting the FilesSourceText HashMap? (Critical)"
]