[
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: poll()] [Spurious wakeup] If poll returns Poll::Pending at line 390 but the waker is not properly stored, can the task never be woken again even when advance() is called, causing permanent hangs in consensus timeout logic? (Critical)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Struct: Inner] [BTreeMap ordering] The pending queue at line 67 uses BTreeMap<(Duration, SleepIndex), Option<Waker>> - can sleeps with identical deadlines cause insertion order to be ambiguous if SleepIndex wraps, leading to incorrect wakeup order in consensus? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance()] [BTreeMap iteration] At line 241-245, the function uses .position() to find the first non-expired waiter - can this be inefficient for large pending queues, causing consensus timeouts to miss their deadlines? (Low)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: unregister_min_sleep()] [BTreeMap consistency] Lines 315-321 manually iterate .keys().next() and then remove_entry - can this race with concurrent insertions, causing the wrong entry to be removed? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Struct: Inner] [Memory leak] The pending BTreeMap at line 67 stores Option<Waker> - if sleeps are created but never polled or dropped, can they accumulate indefinitely, causing memory exhaustion in long-running consensus tests? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: drop()] [Resource leak] MockSleep::drop at lines 398-405 unregisters from pending queue - can panics during drop (e.g., if lock() panics) cause the entry to remain in pending queue forever? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: register_sleep()] [Memory growth] Each sleep allocates a new SleepIndex at line 285 - in a long test with millions of sleeps, can this cause SleepIndex to overflow despite checked_add, or exhaust memory before overflow is detected? (Low)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Struct: Inner] [Non-determinism] The base_time field at line 52 is initialized with Instant::now() at lines 93, 112 - the comment claims determinism is maintained, but can different Instant values cause tests to produce different results, masking consensus bugs? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: now()] [Time anchor leak] At line 200, base_time + now is returned - can code that stores and compares these Instant values across different MockTimeService instances break determinism assumptions? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance_async()] [Non-deterministic scheduling] The yield_now() at line 174 depends on tokio's task scheduler - can different scheduler behavior cause tests to pass/fail non-deterministically, masking real consensus race conditions? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: sleep()] [Zero duration] When sleep(ZERO_DURATION) is called at line 207-209, the sleep should complete immediately - can this cause issues with consensus timeout logic that expects all timeouts to be pending for at least one poll? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance()] [Zero advance] If advance(Duration::ZERO) is called, self.now += duration at line 235 doesn't change time - can this cause the loop at lines 248-251 to wake 0 waiters when some waiters have deadline == self.now and should wake? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance_next()] [Empty queue] At line 225, if pending is empty, trigger_min_sleep returns None - can calling advance_next repeatedly on empty queue cause performance issues or expose underlying state in consensus tests? (Low)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance()] [Maximum duration] If advance(Duration::MAX) is called, can line 235's self.now += duration overflow, wrapping time to zero and waking all pending sleeps incorrectly? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: reset_until()] [Past deadline] At line 374, saturating_duration_since is used - if deadline is in the past, can this reset to Duration::ZERO, causing the sleep to complete immediately when it should have already completed? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance_next()] [Past deadline] At line 228, if deadline is in the past (deadline < self.now), time is not advanced backwards - but can this cause advance_next to return a past time, confusing callers expecting time to move forward? (Low)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: lock()] [Deadlock potential] The lock() method at lines 121-123 directly calls inner.lock() - can this deadlock if a panic occurs while holding the lock in another thread, permanently hanging all consensus timeout logic? (Critical)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance_async()] [Lock hold time] The comment at line 173 says 'don't hold the lock while yielding', but what if another function forgets this pattern - can long lock holds in consensus timeout code cause validator performance degradation? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: poll()] [Lock contention] MockSleep::poll at line 383 locks the inner mutex - if many sleeps poll concurrently during consensus operation, can lock contention cause delays that make timeouts miss their actual deadlines? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: num_waiters()] [Stale data] At line 127, num_waiters locks and immediately returns pending.len() - can the value become stale immediately after release, causing callers to make incorrect decisions about timeout state? (Low)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Struct: MockTimeService] [Clone semantics] MockTimeService derives Clone at line 39 and clones the Arc - can multiple clones in different parts of consensus code lead to confusion about which instance controls time, causing test failures? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: sleep()] [Shared state mutation] At line 208, self.clone() is passed to MockSleep::new - can mutations through one MockTimeService clone affect sleeps created by another clone in unexpected ways, causing non-deterministic consensus test results? (Medium)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Struct: MockSleep] [Service lifetime] MockSleep stores a clone of MockTimeService at line 76 - can this create reference cycles if the time service also stores sleep handles, causing memory leaks? (Low)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: next_sleep_index()] [Panic on overflow] At lines 258-261, checked_add().expect() will panic if overflow occurs - can this panic in production consensus code using mock time service for testing, causing validator crashes? (High)",
  "[File: aptos-core/crates/aptos-time-service/src/mock.rs] [Function: advance()] [Panic on expect] At line 250, expect() will panic if trigger_min_sleep returns None - can concurrent modifications cause this expect to fail despite num_expired being calculated, crashing consensus tests? (High)"
]