[
  "[File: network/framework/src/constants.rs] [Constant: MAX_CONCURRENT_INBOUND_RPCS] [Slot leak on disconnect] When a peer disconnects while having active inbound RPCs, are the slots in MAX_CONCURRENT_INBOUND_RPCS properly freed, or can connection churn cause slot leaks that permanently reduce available capacity below 100? (High)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_CONCURRENT_INBOUND_RPCS] [Sybil amplification] Can a Sybil attacker create multiple validator identities and send 100 inbound RPCs from each identity, multiplying the attack by the number of Sybil nodes to overwhelm the target validator despite the per-peer MAX_CONCURRENT_INBOUND_RPCS limit? (High)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_CONCURRENT_INBOUND_RPCS] [FuturesUnordered overflow] In InboundRpcs::handle_inbound_request(), does the FuturesUnordered queue properly enforce MAX_CONCURRENT_INBOUND_RPCS (100), or can tasks be added beyond the limit due to async timing issues, causing unbounded memory growth? (Medium)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_CONCURRENT_INBOUND_RPCS] [Rejection amplification] When MAX_CONCURRENT_INBOUND_RPCS (100) is exceeded and RPCs are rejected with RpcError::TooManyPending, can malicious peers use these rejections to trigger expensive error handling code repeatedly, amplifying the DoS impact? (Medium)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_CONCURRENT_INBOUND_RPCS] [Handler thread exhaustion] Does MAX_CONCURRENT_INBOUND_RPCS (100) account for the total number of handler threads available, or can 100 concurrent inbound RPCs exhaust the thread pool and prevent processing of other critical network events? (High)",
  "[File: network/framework/src/constants.rs] [Constant: NETWORK_CHANNEL_SIZE] [Channel overflow] Can a malicious peer flood network channels with messages faster than they can be processed, filling the NETWORK_CHANNEL_SIZE buffer of 1024 and causing message drops, potentially losing critical consensus votes or proposals? (Critical)",
  "[File: network/framework/src/constants.rs] [Constant: NETWORK_CHANNEL_SIZE] [Message ordering violation] When NETWORK_CHANNEL_SIZE (1024) is reached and messages are dropped, does this violate FIFO ordering guarantees that consensus depends on, potentially causing validators to process messages out of order and break safety invariants? (Critical)",
  "[File: network/framework/src/constants.rs] [Constant: NETWORK_CHANNEL_SIZE] [Backpressure propagation] When network channels reach NETWORK_CHANNEL_SIZE capacity (1024 messages), does backpressure properly propagate to senders, or can senders continue enqueueing messages to other queues, causing cascading buffer exhaustion across the network stack? (High)",
  "[File: network/framework/src/constants.rs] [Constant: NETWORK_CHANNEL_SIZE] [Priority queue bypass] Does NETWORK_CHANNEL_SIZE (1024) apply uniformly across all priority levels, or can low-priority messages fill the buffer and prevent high-priority consensus messages from being enqueued, causing liveness failures? (Critical)",
  "[File: network/framework/src/constants.rs] [Constant: NETWORK_CHANNEL_SIZE] [Memory amplification] With NETWORK_CHANNEL_SIZE set to 1024 and MAX_MESSAGE_SIZE at 64 MiB, can each channel theoretically buffer up to 64 GiB of data (1024 * 64 MiB), and can attackers exploit this to cause memory exhaustion on validators? (High)",
  "[File: network/framework/src/constants.rs] [Constant: NETWORK_CHANNEL_SIZE] [Channel selection attack] If multiple network channels each have NETWORK_CHANNEL_SIZE capacity (1024), can attackers selectively fill specific channels (e.g., consensus channels) while leaving others empty, partitioning network functionality and breaking consensus? (High)",
  "[File: network/framework/src/constants.rs] [Constant: NETWORK_CHANNEL_SIZE] [try_send vs send] When channels reach NETWORK_CHANNEL_SIZE (1024), does the code use try_send (fails immediately) or blocking send (waits for space), and can blocking sends cause deadlocks in async consensus code? (High)",
  "[File: network/framework/src/constants.rs] [Constant: NETWORK_CHANNEL_SIZE] [Channel leak] If network channels are created per-peer and each has NETWORK_CHANNEL_SIZE capacity (1024), can connection churn cause channel leaks that permanently consume memory even after peers disconnect? (Medium)",
  "[File: network/framework/src/constants.rs] [Constant: NETWORK_CHANNEL_SIZE] [Slow consumer attack] Can a malicious consumer deliberately process messages slowly from a channel with NETWORK_CHANNEL_SIZE (1024) capacity, causing the buffer to fill and blocking all senders, effectively creating a DoS bottleneck? (High)",
  "[File: network/framework/src/constants.rs] [Constant: NETWORK_CHANNEL_SIZE] [Message loss detection] When NETWORK_CHANNEL_SIZE (1024) is exceeded and messages are dropped, is there proper error detection and handling, or are dropped messages silently lost, potentially causing consensus divergence? (Critical)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_FRAME_SIZE] [Frame boundary attack] Can attackers craft messages with sizes just under MAX_FRAME_SIZE (4 MiB) to maximize network overhead while avoiding chunking, repeatedly sending 3.99 MiB frames to waste bandwidth without triggering frame size limits? (Medium)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_FRAME_SIZE] [Chunking vulnerability] When messages exceed MAX_FRAME_SIZE (4 MiB) and are chunked, does the reassembly logic in InboundStreamBuffer properly validate chunk ordering and completeness, or can attackers send malformed chunk sequences to cause memory corruption? (High)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_FRAME_SIZE] [Integer overflow in chunking] When calculating the number of chunks for messages exceeding MAX_FRAME_SIZE (4 MiB), can integer overflow occur if MAX_MESSAGE_SIZE (64 MiB) / MAX_FRAME_SIZE is computed incorrectly, allowing unbounded chunking? (Medium)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_FRAME_SIZE] [Frame amplification] Since MAX_FRAME_SIZE is 4 MiB and MAX_MESSAGE_SIZE is 64 MiB, each message can be split into up to 16 frames - can attackers send many 64 MiB messages simultaneously to amplify the frame processing load by 16x and overwhelm validators? (High)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_FRAME_SIZE] [Partial frame attack] Can malicious peers send the first few frames of a 64 MiB message (within MAX_FRAME_SIZE of 4 MiB per frame) but never send the final frames, causing validators to hold partial message buffers in memory indefinitely until reaching memory exhaustion? (High)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_FRAME_SIZE] [Frame validation bypass] Does the peer/mod.rs code properly validate that each frame does not exceed MAX_FRAME_SIZE (4 MiB) before processing, or can attackers send oversized frames that bypass validation and cause buffer overflows? (Critical)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_FRAME_SIZE] [Frame size inconsistency] Are MAX_FRAME_SIZE values consistent between network/framework/src/constants.rs (4 MiB) and config/src/config/network_config.rs, or can configuration mismatches cause frame size violations and network incompatibility? (Medium)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_FRAME_SIZE] [Streaming resource leak] When OutboundStream chunks messages into MAX_FRAME_SIZE (4 MiB) frames, are stream resources properly cleaned up if the connection drops mid-stream, or can this cause resource leaks that accumulate over time? (Medium)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_FRAME_SIZE] [Frame padding attack] Can attackers add padding to messages to artificially inflate them to exactly MAX_FRAME_SIZE (4 MiB), forcing maximum per-frame overhead for every message and degrading network throughput? (Low)",
  "[File: network/framework/src/constants.rs] [Constant: MAX_FRAME_SIZE] [Concurrent chunking race] When multiple messages are being chunked concurrently using MAX_FRAME_SIZE (4 MiB) as the chunk size, can race conditions cause frames from different messages to be interleaved incorrectly, corrupting message integrity? (High)"
]