[
  "[File: consensus/src/liveness/proposer_election.rs] [Overall security] [Validator removal] When validators are removed from the set mid-epoch, can stale weights or indices cause selection of non-existent validators? (High)",
  "[File: consensus/src/liveness/proposer_election.rs] [Overall security] [Validator addition] When new validators join, can weight synchronization delays cause inconsistent proposer selection across the network? (High)",
  "[File: consensus/src/liveness/proposer_election.rs] [Function: next_in_range()] [State grinding] Can validators grind through many possible states off-chain to find states that favor their selection, then influence on-chain state to match? (High)",
  "[File: consensus/src/liveness/proposer_election.rs] [Function: next_in_range()] [State source] If state comes from previous block data, can validators manipulate block contents to influence future proposer selection? (Critical)",
  "[File: consensus/src/liveness/proposer_election.rs] [Function: next_in_range()] [State determinism] Is the state guaranteed to be identical across all validators for the same round, or can subtle differences cause proposer disagreement? (Critical)",
  "[File: consensus/src/liveness/proposer_election.rs] [Function: choose_index()] [Large number precision] With weights near u128::MAX, could precision loss in cumulative addition cause incorrect selections? (Low)",
  "[File: consensus/src/liveness/proposer_election.rs] [Function: next_in_range()] [Modulo precision] Does the modulo operation on 128-bit integers introduce any precision issues that could affect randomness quality? (Low)",
  "[File: consensus/src/liveness/proposer_election.rs] [Overall security] [Censorship attack] Can a coalition of validators manipulate proposer selection to maximize their control over proposal ordering, enabling transaction censorship? (High)",
  "[File: consensus/src/liveness/proposer_election.rs] [Overall security] [MEV extraction] Does knowledge of future proposer selection allow validators to engage in MEV (Maximal Extractable Value) extraction strategies that harm users? (Medium)",
  "[File: consensus/src/liveness/proposer_election.rs] [Overall security] [Front-running] Can validators use proposer selection knowledge to front-run transactions by timing their submissions to favorable rounds? (Medium)"
]