[
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Struct: Entry] [String Field Length] Are there maximum length limits on the url and public_key strings in Entry, or can attackers provide gigabyte-sized strings causing memory exhaustion? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Struct: Entry] [Unicode Normalization] Does the url string handling properly normalize Unicode, or can attackers use different Unicode representations of the same URL to bypass deduplication or validation? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Struct: Entry] [Null Byte Injection] Can the url or public_key strings contain null bytes (\\0) that cause truncation in C FFI boundaries or string processing, bypassing validation? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Struct: Entry] [Whitespace Handling] Are leading/trailing whitespaces in url and public_key properly trimmed, or can attackers bypass exact string matching checks by adding spaces? (Low)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Function: get_node_infos()] [Allowlist String Sanitization] Does the allowlist comparison properly handle whitespace, case variations, and Unicode in account address strings, or can these be exploited for bypass? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Function: get_node_infos()] [Allowlist Bypass via Continue] When account_address_allowlist is non-empty and address not in list, the code uses 'continue' - does this skip ALL validation, potentially allowing invalid data structures to persist in memory? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Function: get_node_infos()] [Invalid Entry Accumulation] Can the invalid_node_address_results HashMap grow unboundedly if attackers provide many invalid entries, causing memory exhaustion even if they don't bypass allowlist? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Function: get_node_infos()] [Valid/Invalid Separation] Is the separation between node_infos (valid) and invalid_node_address_results (invalid) enforced, or could race conditions or logic errors cause entries to appear in both? (Low)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Function: get_node_infos()] [Return Value Interpretation] Do consumers of this function properly handle the case where both HashMaps are empty (all entries filtered by allowlist), which might indicate a misconfiguration attack? (Low)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Struct: Entry] [Dead Code Field] The metrics_port field has #[allow(dead_code)] - is this field truly unused, or could it be exploited in unused code paths that lack proper validation? (Low)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Struct: Entry] [Public Visibility] Are the Entry struct fields appropriately private to prevent direct construction bypass, or could external code create Entry with invalid field combinations? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Impl: TryInto<NodeInfo>] [NodeInfo Field Validation] When constructing NodeInfo, are there any invariants (e.g., api_port must be different from noise_port) that are not validated, allowing conflicting configurations? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Function: get_node_infos()] [AccountAddress Parsing] Does AccountAddress deserialization from JSON perform proper validation, or can malformed addresses slip through serde and cause issues in HashMap key operations? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Impl: TryInto<NodeInfo>] [x25519 Curve Security] Does the x25519::PublicKey validation check for weak keys (small subgroup points, identity), or can attackers register nodes with cryptographically weak public keys? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Impl: TryInto<NodeInfo>] [Url Crate CVE] Are there known CVEs in the reqwest::Url dependency that could be exploited through malicious URL strings in the Entry.url field? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Function: get_node_infos()] [Serde CVE] Are there known deserialization vulnerabilities in the serde_json version being used that could allow RCE or arbitrary code execution? (Critical)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Function: get_node_infos()] [Untrusted Input File] Since the input_file path comes from command-line arguments (PathBuf), is it treated as untrusted input with proper validation against directory traversal and symlinks? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Function: get_node_infos()] [Trust Boundary] Does the function properly validate that the input_file originates from a trusted source, or can any user provide arbitrary file paths potentially pointing to privileged locations? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Function: get_node_infos()] [Output Validation] Are the returned NodeInfo objects from node_infos HashMap properly validated by consumers, or is there an implicit trust that could be exploited if validation is bypassed? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Function: get_node_infos()] [File Size Limit] Is there a maximum file size check before reading, or can attackers provide multi-gigabyte JSON files causing OOM when loading into memory? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Function: get_node_infos()] [Entry Count Limit] Is there a limit on the number of entries in the Vec<Entry>, or can attackers provide millions of entries causing excessive processing time and memory usage? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Function: get_node_infos()] [Per-Account Entry Limit] Is there a limit on how many NodeInfo entries can be associated with a single AccountAddress in the HashMap, preventing one account from monopolizing resources? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Function: get_node_infos()] [Processing Timeout] Does the async function have a timeout, or can processing a malicious file take arbitrarily long, blocking other operations? (Medium)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Impl: TryInto<NodeInfo>] [Public Key Uniqueness] Can multiple entries share the same public_key, potentially enabling impersonation or man-in-the-middle attacks where one operator controls multiple registered nodes? (High)",
  "[File: aptos-core/ecosystem/node-checker/fn-check-client/src/get_pfns.rs] [Impl: TryInto<NodeInfo>] [Key Format Validation] Does from_encoded_string() validate that the public key is exactly 32 bytes for x25519, or can shorter/longer keys be accepted causing downstream cryptographic failures? (High)"
]