[
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: unpack_tar_gz()] [Decompression Bomb] Does the function impose limits on decompressed archive size before calling archive.unpack() at line 108, or can a small compressed archive expand to fill all available disk space causing validator crash and loss of liveness? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: unpack_tar_gz()] [Resource Exhaustion] Can a tar archive with millions of tiny files exhaust inodes or file descriptors during extraction, causing filesystem corruption and permanent validator downtime? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: unpack_tar_gz()] [Race Condition Window] Between fs::remove_dir_all() at line 110 and fs::rename() at line 111, can an attacker create a new directory at target_db_path causing the rename to fail and leaving the system with no valid database? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: unpack_tar_gz()] [Unwrap on Error] Does using .unwrap_or(()) at line 110 silently ignore failures in removing the old database directory, potentially causing fs::rename() to fail and leave corrupted state with both old and new databases present? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: unpack_tar_gz()] [Non-Atomic Replace] Is the combination of fs::remove_dir_all() and fs::rename() atomic, or can a validator crash between these operations leave no database at target_db_path causing permanent state loss? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: unpack_tar_gz()] [Corrupt Archive Handling] If the tar archive is corrupted, does archive.unpack() fail gracefully at line 108 or create a partially extracted database that appears valid but contains corrupt state causing consensus failures? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: unpack_tar_gz()] [Permission Preservation] Does extraction preserve file permissions from the archive, or can permission mismatches cause the restored database to be readable by unauthorized processes exposing sensitive blockchain state? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: unpack_tar_gz()] [Timestamp Manipulation] Can malicious archives manipulate file timestamps during extraction to bypass change detection mechanisms or create timing-based attacks affecting consensus synchronization? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: unpack_tar_gz()] [Disk Space Pre-Check] Does the function verify sufficient disk space before extraction, or can partial extraction due to disk exhaustion create a corrupted database that passes initial validation but fails during operation? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: unpack_tar_gz()] [Temp Directory Cleanup] If unpack() fails at line 108, is the temp_dir_path created at line 103 properly cleaned up, or do repeated failures accumulate temporary directories causing disk exhaustion? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: unpack_tar_gz()] [Extension Collision] Can the temp_dir_path created with .with_extension('tmp') at line 102 collide with existing directories, causing fs::create_dir() to fail or overwrite existing data? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Integration] [State Consistency] Can an attacker trigger unpack_tar_gz() while a validator is actively using the database, causing the fs::remove_dir_all() at line 110 to delete active database files mid-transaction leading to state corruption and consensus failure? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Integration] [Backup-Restore Mismatch] If create_tar_gz() runs concurrently with database modifications, can the resulting archive contain an inconsistent snapshot mixing old and new state, which when restored via unpack_tar_gz() produces invalid state roots diverging from network consensus? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Integration] [Integrity Verification Missing] Do any functions verify the cryptographic hash or signature of backup archives before restoration, or can an attacker substitute malicious archives that restore fabricated blockchain state with altered transaction history? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Integration] [Version Compatibility] Are database format versions checked during restore operations, or can restoring a backup from an incompatible version cause silent data corruption that manifests as incorrect state transitions? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Integration] [Concurrent Backup/Restore] Can simultaneous backup and restore operations on the same database create deadlocks or race conditions leading to filesystem corruption and permanent data loss? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Integration] [Error Propagation] Do all error cases properly propagate with sufficient context for recovery, or can certain failures be silently swallowed causing the system to continue with corrupted state? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: rename_db_folders_and_cleanup()] [Error Handling] If the system crashes immediately after line 20 succeeds but before line 31, does the error handling provide any mechanism to detect and recover from this inconsistent state on restart? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: create_tar_gz()] [Error Context] Do the .context() error annotations at lines 68, 73, 76, 81, 94 provide sufficient information to prevent operators from making incorrect recovery decisions that could worsen state corruption? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: unpack_tar_gz()] [Silent Failure] Does the .unwrap_or(()) at line 110 mask critical errors like permission denials or filesystem corruption that should halt the restore operation rather than proceeding with potentially incomplete cleanup? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: create_tar_gz()] [Buffer Overflow] Can the BufWriter at line 59 encounter buffer size limits with extremely large files, causing silent truncation or data corruption in the resulting archive? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: unpack_tar_gz()] [File Descriptor Leak] If archive.unpack() at line 108 is interrupted, are all file descriptors properly closed, or can repeated interruptions exhaust available descriptors causing validator failure? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: rename_db_folders_and_cleanup()] [Input Validation] Are the three PathBuf parameters validated to be absolute paths within expected boundaries, or can relative paths cause operations in unexpected directories leading to data corruption? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: create_tar_gz()] [Input Validation] Is the backup_file_name parameter sanitized to prevent command injection if it's later used in shell commands or path traversal if it contains directory separators? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-table-info/src/backup_restore/fs_ops.rs] [Function: create_tar_gz()] [Path Canonicalization] Is dir_path canonicalized before use to resolve symlinks and prevent an attacker from creating backups of arbitrary filesystem locations by providing a symlink path? (High)"
]