[
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Line: 16] [spawn_blocking deadlock] Can the tokio::task::spawn_blocking() calls for service initialization deadlock if all blocking thread pool threads become exhausted, preventing the main task from completing? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Function: main()] [Resource cleanup] If the service receives SIGTERM during startup, are all partially initialized resources (network sockets, file handles, database connections) properly cleaned up before exit? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Function: main()] [Exit code handling] Does the service return appropriate exit codes on different failure scenarios, allowing orchestrators (Kubernetes, systemd) to distinguish between recoverable and non-recoverable errors? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Function: main()] [Restart safety] If the service crashes and restarts multiple times rapidly, could residual state from previous runs (stale locks, zombie processes, open ports) prevent successful restart? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Function: main()] [Core dump exposure] If the service crashes during startup, could core dumps expose sensitive configuration data (TLS keys, database credentials) that was loaded into memory? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Line: 16] [Task join error handling] Does the futures::future::try_join_all() properly handle errors from individual tasks, or could one task's failure cause other tasks to continue running in an inconsistent state? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Line: 16] [Task cancellation safety] If try_join_all() is cancelled, are all spawned tasks properly cancelled and cleaned up, or could background tasks continue processing data after the main service appears to have stopped? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Line: 16] [Error aggregation] When multiple tasks fail simultaneously, does the error aggregation preserve enough context to diagnose the root cause, or could critical error details be lost? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Line: 16] [Certificate validation] When loading TLS certificates, does the service validate certificate expiration, proper key usage flags, and certificate chain validity before accepting them? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Line: 16] [Private key exposure] Are TLS private keys read from disk protected with proper file permissions, or could other processes on the system read the key material during startup? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Line: 16] [Certificate reload] If TLS certificates expire while the service is running, does it support certificate reloading without restart, or does it continue serving with expired certificates? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Line: 16] [Mixed TLS mode] Can the service accidentally run with TLS partially enabled (e.g., cert loaded but key missing), creating a false sense of security while actually transmitting data in cleartext? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Lines: 9-11] [Non-Unix behavior] On non-Unix platforms where jemalloc is not used, could different default allocator behavior lead to security vulnerabilities that only manifest on specific platforms? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Function: main()] [Linux-specific attacks] Does the service have Linux-specific code paths (CPU profiling) that could be exploited differently than on other platforms, creating platform-specific vulnerabilities? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Line: 16] [Environment variable override] Can an attacker use the Figment Env provider with the split delimiter '__' to inject nested configuration values that override security-critical settings? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-data-service-v2/src/main.rs] [Line: 16] [YAML merge key exploit] Can an attacker use YAML merge keys (<<) or anchors/aliases to create circular references that cause infinite loops during configuration parsing? (High)"
]