[
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Invalid UTF-8] If comment extraction includes invalid UTF-8 sequences in String values of FileCommentMap, can this cause panics during to_string() conversion or serialization, blocking compilation of governance proposals? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Normalization attacks] Can Unicode normalization differences (NFC vs NFD) in comment strings cause validators to generate different MatchedFileCommentMap contents, leading to consensus failures when comments affect code generation? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [BOM injection] Can byte-order marks (BOM) in source files shift u32 position calculations in FileCommentMap tuple keys, causing off-by-three errors in comment span matching and misattribution of documentation? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Deep nesting] Can extremely deeply nested block comments (1000+ levels) cause exponential growth of intermediate entries in FileCommentMap before final comments are matched, exhausting memory during compilation? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Delimiter confusion] Can mixed comment styles (/// vs /**) at the same position create duplicate entries in MatchedFileCommentMap, causing later string merging operations to produce incorrect documentation? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Unclosed nesting] If nested block comments remain unclosed, do position spans in FileCommentMap grow unboundedly until EOF, potentially allocating multi-gigabyte String values for comment content? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Matching ambiguity] When multiple documentation comment styles precede the same language item, can the merging logic in MatchedFileCommentMap values concatenate them in non-deterministic order across validators? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Comment flooding] Can a Move file with a documentation comment before every token create millions of (u32, u32) entries in FileCommentMap, causing O(n²) performance during range queries in match_doc_comments()? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Match explosion] Can pathological comment placement cause every position in a 4GB file to have a matched comment entry in MatchedFileCommentMap, requiring gigabytes of memory just for position-to-string mappings? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Per-file overhead] Does each FileHash key in CommentMap allocate separate MatchedFileCommentMap instances, allowing an attacker to multiply memory cost by submitting many small files instead of one large file? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Span overhead] Can interleaved small comments create worst-case BTreeMap fragmentation in FileCommentMap, causing cache misses and compilation slowdowns affecting validator performance during framework upgrades? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Leak via mismatch] If documentation comments in FileCommentMap are never matched to language items, do they persist in memory until check_and_get_doc_comments() is called, allowing memory leaks in error recovery paths? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Orphaned matches] Can parser errors leave partially populated MatchedFileCommentMap entries that are never retrieved or cleaned up, causing memory leaks across multiple failed compilation attempts? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Session persistence] If CommentMap persists across compilation sessions for caching, can old FileHash entries accumulate indefinitely, causing memory leaks in long-running validator processes? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Error path leaks] During lexer errors that abort parsing, are FileCommentMap entries properly dropped, or can panics/unwinding leave dangling String allocations in intermediate comment storage? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Lookup complexity] Can an attacker craft comment positions that cause worst-case O(log n) lookups in FileCommentMap to degrade to O(n) due to BTreeMap rebalancing during concurrent insertions? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Range scan cost] If match_doc_comments() performs BTreeMap range queries over large spans, can strategically placed comments in MatchedFileCommentMap cause O(n) scans instead of O(log n) lookups, slowing compilation? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Iteration overhead] Can a governance proposal with thousands of Move files cause CommentMap iteration in check_and_get_doc_comments() to take unbounded time, blocking finalization of protocol upgrades? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Deletion cost] Does removing matched comments from FileCommentMap via remove() calls cause BTreeMap rebalancing overhead that scales poorly with comment density, impacting real-time compilation requirements? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Clone overhead] If CommentMap (BTreeMap) is cloned frequently during compilation pipeline stages, can deep copying of all FileHash -> MatchedFileCommentMap mappings cause unexpected memory spikes and GC pressure? (Medium)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [Borrow conflicts] Can simultaneous mutable references to MatchedFileCommentMap during comment matching and immutable references during AST annotation cause borrow checker violations that panic in unsafe code paths? (Low)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: FileCommentMap] [Lifetime issues] If FileCommentMap references are stored with incorrect lifetimes, can dangling references to source file Strings cause use-after-free bugs when files are unloaded during incremental compilation? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Send/Sync assumptions] If CommentMap is incorrectly assumed to be Send/Sync for parallel compilation but contains non-thread-safe internal state, can this cause data races or corruption across validator threads? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: CommentMap] [Insertion order] Can the insertion order of FileHash keys into CommentMap affect BTreeMap iteration order in ways that make compilation non-deterministic across validators, causing consensus failures on governance bytecode? (High)",
  "[File: aptos-core/third_party/move/move-compiler-v2/legacy-move-compiler/src/parser/comments.rs] [Type: MatchedFileCommentMap] [String comparison] If comment matching depends on String equality in MatchedFileCommentMap, can locale-specific string comparisons cause validators in different regions to generate different bytecode from identical source? (Medium)"
]