[
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Move integration] [Resource move] If a config resource is moved from address 0x1 to another address, can validators still find it or do all config reads fail? (Critical)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Move integration] [Resource deletion] Can Move code delete config resources, and if so, how do validators handle sudden config absence during execution? (Critical)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Move integration] [Type parameter changes] If Move code changes a config's type parameters, does the Rust side detect this or silently deserialize with wrong types? (High)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Move integration] [Module upgrade] When config modules are upgraded via governance, are old cached struct tags invalidated or can stale tags persist? (High)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Deserialization: Integer overflow] [Field overflow] Can BCS payloads specify integer field values that overflow when cast to smaller types in Rust structs? (High)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Deserialization: String injection] [UTF-8 validation] Does BCS deserialization validate that string fields contain valid UTF-8, or can invalid encodings cause panics or security issues? (Medium)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Deserialization: Collection sizes] [Vector bombs] Can BCS specify vectors with claimed length near u64::MAX but actual length 0, causing allocation failures? (High)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Deserialization: Uninitialized memory] [Padding bytes] Does BCS handle struct padding correctly, or can padding bytes contain uninitialized memory that leaks sensitive data? (Medium)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [HashMap: InMemoryOnChainConfig] [Hash collision attacks] Can attackers craft ConfigIDs that hash to the same bucket, causing O(n) lookup degradation and DoS? (Medium)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [HashMap: InMemoryOnChainConfig] [Memory ordering] Are HashMap operations atomic, or can concurrent reads during insertion see partial state? (Medium)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Epoch: Timestamp] [Time monotonicity] Does last_reconfiguration_time strictly increase, or can clock skew/NTP attacks cause it to decrease breaking time-based assumptions? (High)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Epoch: Timestamp] [Microsecond overflow] Can last_reconfiguration_time (u64 microseconds) overflow in 584,000 years, and is this considered in long-term protocol design? (Low)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Epoch: Events] [Event ordering] Are epoch change events guaranteed to be ordered, or can out-of-order delivery cause validators to process reconfigurations incorrectly? (High)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Constant: CORE_CODE_ADDRESS] [Address hardcoding] Is CORE_CODE_ADDRESS truly immutable, or can dynamic linker attacks or memory corruption modify it to redirect config access? (Low)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Constant: CORE_CODE_ADDRESS] [Cross-chain compatibility] If Aptos forks or testnets use different CORE_CODE_ADDRESS values, can configs from one chain be replayed on another? (Medium)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Trait: Send + Sync] [Thread safety] Do all OnChainConfig implementations properly satisfy Send + Sync bounds, or can they contain non-thread-safe interior mutability? (High)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Trait: DeserializeOwned] [Lifetime issues] Does the DeserializeOwned bound ensure all deserialized data is owned, or can lifetime confusion cause use-after-free? (High)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Integration: Features] [Feature flag races] Can feature flags in TimedFeatures change during config reads, causing validators to see inconsistent feature states? (High)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Integration: Randomness] [Config-dependent randomness] If randomness configs change mid-epoch, can this break VRF-based leader selection causing consensus failures? (Critical)",
  "[File: aptos-core/types/src/on_chain_config/mod.rs] [Integration: JWK] [JWK config timing] Can JWK consensus configs be updated to remove valid keys mid-validation, causing legitimate validators to be rejected? (High)"
]