[
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Function: name()] [Name collision] Can multiple tokens within the same collection have identical names returned by name(), violating the uniqueness constraint that token names should be unique within collections? (High)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Function: name()] [Name spoofing] Does name() allow homograph attacks using Unicode lookalike characters (e.g., Cyrillic 'a' vs Latin 'a') to create tokens with visually identical names that could be used for phishing or impersonation? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Function: name()] [Length violation] Can name() return strings exceeding MAX_TOKEN_NAME_LENGTH (128 chars) if the on-chain data was corrupted or if the Move-Rust synchronization is broken, causing buffer overflows in fixed-size UI components? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Function: name()] [Empty name] Does name() properly handle empty string names that could cause tokens to be invisible or unsearchable in indexers and marketplaces? (Low)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Function: uri()] [URI validation] Does uri() return URIs that are validated for proper format, or can malformed URIs (missing scheme, invalid characters) cause crashes in HTTP clients or metadata fetchers? (Low)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Function: uri()] [SSRF attack] Can an attacker store malicious URIs pointing to internal network resources (localhost, 169.254.169.254) that cause Server-Side Request Forgery when indexers or wallets fetch metadata? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Function: uri()] [Malware distribution] Does uri() allow storage of URIs pointing to malware, phishing sites, or illegal content, creating liability issues for infrastructure operators who fetch and cache token metadata? (Low)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Function: uri()] [Length exploit] Can uri() return strings exceeding MAX_URI_LENGTH (512 chars) due to Move-Rust desync, causing truncation errors or buffer issues in URI parsers and HTTP libraries? (Low)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Function: uri()] [Data URI injection] Can uri() contain data: URIs with embedded JavaScript or HTML that execute when rendered in browsers, bypassing Content Security Policy protections? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Function: mutation_events()] [EventHandle tampering] Does mutation_events() expose the EventHandle in a way that allows its counter to be manipulated, potentially allowing event replay attacks or mutation history falsification? (High)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Function: mutation_events()] [GUID collision] Can multiple tokens share the same EventHandle GUID returned by mutation_events(), causing event stream collisions where mutation events from different tokens are merged or lost? (High)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Function: mutation_events()] [Counter overflow] What happens when the EventHandle counter returned by mutation_events() reaches u64::MAX - can continued mutations cause counter wraparound leading to event ordering corruption? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Function: mutation_events()] [Event history] Does mutation_events() provide access to the complete mutation history, or can event pruning cause loss of critical audit trail information for token provenance tracking? (Low)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Trait: MoveStructType] [Module name mismatch] Does the MODULE_NAME constant ('token') correctly match the actual on-chain Move module, or can a mismatch cause type confusion where TokenResource is deserialized from incompatible Move structures? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Trait: MoveStructType] [Struct name mismatch] Does the STRUCT_NAME constant ('Token') exactly match the on-chain struct name including capitalization, or can case mismatches cause deserialization failures or type substitution attacks? (High)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Trait: MoveStructType] [Address prefix] Is the implicit address prefix (0x4) for the token module validated, or can an attacker deploy a malicious module at a different address with the same module::struct name to create counterfeit tokens? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Trait: MoveStructType] [Version compatibility] If the on-chain Token struct is upgraded with additional fields or changed field types, does the MoveStructType implementation gracefully handle version mismatches or cause deserialization panics? (High)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Trait: MoveResource] [Resource safety] Does the MoveResource trait implementation ensure that TokenResource instances maintain Move's resource safety guarantees (no copy, no drop) when translated to Rust, or can Rust code violate resource uniqueness? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Trait: MoveResource] [Clone semantics] Since TokenResource derives Clone, can this be exploited to duplicate token resources in memory, potentially allowing double-spending attacks if cloned instances are both written back to storage? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Trait: MoveResource] [Drop semantics] Does the automatic Drop implementation for TokenResource properly handle cleanup, or can dropped tokens leave dangling references in EventHandles or Object registries causing memory leaks or use-after-free? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Field: collection] [Address spoofing] Can an attacker modify the collection Object's inner AccountAddress to point to a different collection, allowing tokens to be fraudulently reassigned to high-value collections for pump-and-dump scams? (Critical)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Field: collection] [Null/zero address] Does the collection field validation prevent zero addresses (0x0) or other invalid addresses that could cause null pointer dereferences when dereferencing the Object? (Medium)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Field: collection] [Circular reference] Can a token's collection Object point back to itself or create circular references that cause infinite loops during collection traversal or graph queries? (Low)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Field: collection] [Type mismatch] Is there runtime validation that the Object actually contains a Collection resource, or can it point to arbitrary resource types (Account, Token, etc.) breaking type safety? (High)",
  "[File: aptos-core/types/src/account_config/resources/token.rs] [Field: index] [Race condition] In concurrent token minting scenarios, can race conditions cause multiple tokens to be assigned the same index before uniqueness checks complete, leading to index collisions? (High)"
]