[
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: MAX_NUM_EPOCH_ENDING_LEDGER_INFO] [Consensus DoS] Is the hardcoded limit of 100 epoch ending ledger infos sufficient to prevent memory exhaustion attacks when malicious validators request epoch proofs during state synchronization, or can an attacker cause validator node crashes by triggering repeated large epoch queries? (High)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: MAX_NUM_EPOCH_ENDING_LEDGER_INFO] [Liveness attack] Can the fixed limit of 100 epochs create a liveness issue where nodes more than 100 epochs behind cannot synchronize with the network, requiring manual intervention or causing permanent network splits? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: MAX_NUM_EPOCH_ENDING_LEDGER_INFO] [Integer overflow] Does the usize type for MAX_NUM_EPOCH_ENDING_LEDGER_INFO create potential integer overflow vulnerabilities when cast to u64 in arithmetic operations during epoch iteration or when multiplied by epoch data sizes? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: MAX_NUM_EPOCH_ENDING_LEDGER_INFO] [State synchronization attack] Can an attacker exploit the TODO comment about 'very old client' scenarios to force validators into an unrecoverable state by preventing epoch synchronization beyond the 100-epoch limit, causing validators to be permanently out of sync? (High)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: MAX_NUM_EPOCH_ENDING_LEDGER_INFO] [Consensus safety] If the 100-epoch limit is reached during epoch proof verification, can this cause validators to accept invalid epoch transitions or skip critical validator set changes, breaking consensus safety guarantees? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: MAX_NUM_EPOCH_ENDING_LEDGER_INFO] [Resource exhaustion] When multiple concurrent requests each fetch 100 epoch ending ledger infos, can this cause memory pressure or OOM conditions on validator nodes, especially if epoch ending ledger infos contain large validator sets with many signatures? (High)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: MAX_NUM_EPOCH_ENDING_LEDGER_INFO] [Validation bypass] Is the limit properly enforced in all code paths that fetch epoch ending ledger infos, or can attackers bypass it through alternative APIs or internal functions to request unbounded epoch data? (High)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: MAX_NUM_EPOCH_ENDING_LEDGER_INFO] [State inconsistency] If different parts of the codebase use different epoch limits (hard-coded values vs this constant), can this create state inconsistencies where some validators accept epoch proofs that others reject? (High)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: MAX_NUM_EPOCH_ENDING_LEDGER_INFO] [Network partition] During network partitions lasting more than 100 epochs, can nodes on different sides of the partition become permanently unable to reconcile their epoch histories due to this limit, requiring a hard fork? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: MAX_NUM_EPOCH_ENDING_LEDGER_INFO] [Pagination attack] Does the pagination mechanism using this limit properly validate continuation tokens, or can attackers manipulate pagination to cause validators to fetch overlapping or inconsistent epoch ranges? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: MAX_NUM_EPOCH_ENDING_LEDGER_INFO] [Type safety] Is the conversion from usize (100) to u64 in saturating_sub operations safe on all platforms, or can 32-bit vs 64-bit architecture differences cause inconsistent behavior? (Low)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: MAX_NUM_EPOCH_ENDING_LEDGER_INFO] [Cryptographic verification] When fetching 100 epochs of ledger infos, are all BLS signature aggregations verified atomically, or can partial verification failures leave validators in an inconsistent state? (High)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: MAX_NUM_EPOCH_ENDING_LEDGER_INFO] [Storage corruption] If the database contains corrupted epoch ending ledger infos within the 100-epoch window, can this prevent all future synchronization attempts and cause permanent validator failure? (High)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: MAX_NUM_EPOCH_ENDING_LEDGER_INFO] [Bootstrapping attack] Can new validators joining the network be tricked into accepting invalid genesis states by manipulating the epoch proof chain within the 100-epoch limit window? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: MAX_NUM_EPOCH_ENDING_LEDGER_INFO] [Upgrade vulnerability] If a protocol upgrade changes epoch duration or validator set size, can the fixed 100-epoch limit become insufficient or excessive, causing synchronization failures during the upgrade transition? (High)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: LEDGER_DB_NAME] [Path traversal] Does the hardcoded 'ledger_db' string undergo proper path sanitization when concatenated with user-controlled or configuration-provided directory paths, or can attackers perform directory traversal attacks to access arbitrary filesystem locations? (High)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: LEDGER_DB_NAME] [Namespace collision] Can the generic name 'ledger_db' cause namespace collisions if multiple AptosDB instances run on the same system, potentially leading to data corruption or unauthorized access to another instance's ledger data? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: LEDGER_DB_NAME] [Database confusion] If multiple database backends or storage configurations use similar naming conventions, can validators accidentally open the wrong database or mix ledger data with other data types, causing state corruption? (High)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: LEDGER_DB_NAME] [Symbolic link attack] When opening the ledger database, are symbolic links properly validated, or can an attacker use symlinks to redirect the 'ledger_db' path to a malicious database containing forged transaction history? (Critical)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: LEDGER_DB_NAME] [Character encoding] Does the ASCII string 'ledger_db' handle all filesystem encoding scenarios correctly, or can Unicode normalization or encoding attacks cause the database to be opened at an unexpected location on certain operating systems? (Low)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: LEDGER_DB_NAME] [Duplicate definition] Since LEDGER_DB_NAME is also defined in ledger_db/mod.rs, can inconsistencies between these duplicate constants cause different parts of the codebase to reference different databases, leading to state inconsistencies? (High)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: LEDGER_DB_NAME] [Access control] Is the 'ledger_db' directory created with appropriate filesystem permissions, or can unprivileged processes on the same system read or modify critical ledger data? (Medium)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: LEDGER_DB_NAME] [Backup/restore attack] During backup or restore operations, can the hardcoded 'ledger_db' name be exploited to restore malicious data into the ledger database while validators believe they're loading legitimate backup data? (High)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: LEDGER_DB_NAME] [Sharding confusion] When storage sharding is enabled vs disabled, does the usage of LEDGER_DB_NAME vs specialized database names (EVENT_DB_NAME, TRANSACTION_DB_NAME) create confusion that could lead to data being written to or read from the wrong database? (High)",
  "[File: aptos-core/storage/aptosdb/src/common.rs] [Constant: STATE_MERKLE_DB_NAME] [Merkle proof manipulation] Does the hardcoded 'state_merkle_db' name allow proper isolation of Merkle tree data, or can attackers manipulate the database path to substitute a malicious Merkle tree database containing forged state commitments? (Critical)"
]