[
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Module: metrics] [Metrics manipulation] The public metrics module at line 4 exposes counters that can be accessed externally, but can an attacker manipulate these metrics to hide data corruption or mask upload failures from monitoring systems? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: chain_id] [Cross-chain pollution] If multiple IndexerGrpcFileStoreWorkerConfig instances with different chain_ids share the same file_store_config bucket, can transactions from different chains overwrite each other if the file naming scheme doesn't properly include chain ID? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: chain_id] [Chain migration] During chain ID migration or testnet/mainnet setup, can configuration mistakes where chain_id doesn't match the Redis cache's stored chain ID cause the processor to upload testnet transactions to mainnet storage or vice versa? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Struct: IndexerGrpcFileStoreWorkerConfig] [Config file permissions] If the configuration file containing this struct is world-readable, can attackers extract sensitive information like redis_main_instance_address or gcs_file_store_service_account_key_path to compromise the indexer infrastructure? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Struct: IndexerGrpcFileStoreWorkerConfig] [Config injection] Can environment variables or command-line arguments override serde-deserialized config fields, and if so, can an attacker with process environment access inject malicious redis_main_instance_address or chain_id values? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: chain_id] [Boundary conditions] When chain_id is set to 1 (the minimum valid chain), can edge case arithmetic in version calculations cause wraparound to 0, potentially corrupting file metadata or causing version tracking failures? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: chain_id] [Type size] Since chain_id is u64 at line 19, can extremely large values (> 2^53) cause precision loss when converted to JSON for API responses or lose precision in JavaScript-based monitoring tools? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: enable_expensive_logging] [Log injection] When enable_expensive_logging is enabled, can malicious transaction data contain newline or control characters that inject fake log entries, potentially hiding security incidents or causing log parsing failures? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: enable_expensive_logging] [Log storage DoS] Can enable_expensive_logging=true generate such large volumes of log data that disk space is exhausted, causing the service to crash or preventing other critical logs from being written? (Low)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Import: RunnableConfig] [Trait implementation] Does the RunnableConfig trait from aptos-indexer-grpc-server-framework enforce proper error handling in run(), or can framework changes break the expect() usage at lines 56 and 60, causing unexpected panics? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Import: IndexerGrpcFileStoreConfig] [Dependency vulnerability] Can vulnerabilities in the IndexerGrpcFileStoreConfig deserialization from aptos-indexer-grpc-utils be exploited to inject malicious configurations that bypass validation in this module? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Error propagation] The function returns Result<()> at line 48 but always returns Ok(()) at line 61, meaning any errors from processor.run() must panic - can this prevent graceful degradation and cause cascading failures in the indexer infrastructure? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Silent failures] If processor.run() encounters non-critical errors that don't panic (e.g., temporary Redis disconnections), are these properly logged and monitored, or can silent failures accumulate until data loss occurs? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: enable_cache_compression] [Format migration] If enable_cache_compression is changed from false to true while Redis still contains uncompressed data, can the processor fail to detect this mismatch and attempt to decompress plain protobuf data, causing corruption or crashes? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: enable_cache_compression] [Compression compatibility] When enable_cache_compression is true and passed to Processor::new() at line 53, can version mismatches between the LZ4 compression library and decompression implementation cause data corruption that's silently written to file store? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: file_store_config] [Enum confusion] Can deserialization errors in the tagged enum for IndexerGrpcFileStoreConfig cause the wrong variant to be selected, resulting in local file operations being sent to GCS or vice versa, leading to authentication failures or data exposure? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: file_store_config] [Default behavior] If file_store_config deserialization fails partially, can the Default implementation create a LocalFileStore pointing to current_dir(), potentially writing blockchain data to unexpected locations like the binary's directory? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: redis_main_instance_address] [Data poisoning] Can an attacker with write access to the Redis instance at redis_main_instance_address inject malicious transaction data that bypasses signature verification in the cache worker, which then gets blindly uploaded to file store by this worker? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: redis_main_instance_address] [Cache eviction] If Redis memory limits cause transaction data to be evicted before the file store worker fetches it, can this create gaps in the archived data that are never detected or filled, leading to incomplete historical records? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Multi-instance race] If multiple instances of this worker are deployed with identical configurations for high availability, can they race to upload the same transaction batches, causing duplicate data in file store and wasting storage resources? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Leader election absence] Since there's no leader election mechanism in run(), can deploying multiple instances for redundancy cause all instances to upload data simultaneously, overwhelming the file store backend and causing throttling or failures? (Medium)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Version continuity] Can bugs in the processor's version tracking logic cause the worker to skip version ranges when uploading batches, creating permanent gaps in the file store that make the archive unusable for full node bootstrapping? (Critical)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Function: run()] [Batch atomicity] If file uploads are interrupted mid-batch during processor.run() execution, can partial batches be committed to file store while metadata indicates the full batch was uploaded, causing data inconsistency? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: file_store_config] [GCS IAM bypass] When file_store_config uses GcsFileStore, can insufficient IAM permissions on the service account cause silent write failures that the processor treats as success, leading to data loss without detection? (High)",
  "[File: aptos-core/ecosystem/indexer-grpc/indexer-grpc-file-store/src/lib.rs] [Field: file_store_config] [Bucket lifecycle] If the GCS bucket has lifecycle policies that delete or archive old files, can this conflict with the processor's metadata tracking, causing it to attempt to reference or update files that no longer exist? (Medium)"
]