[
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Integration] [Module Lock vs Resource Lock] Module lock mode (lines 36-38) and resource access checks (lines 169-189) use different mechanisms. Can an attacker exploit inconsistencies between these two protection modes? (High)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Integration] [Panic Safety] If any function panics during execution, will the Drop implementation properly clean up counters, or will panics leave the checker in a permanently corrupted state? (Critical)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Integration] [Transaction Boundary] When a transaction completes (success or failure), is the ReentrancyChecker reset? Can state leak between transactions, allowing reentrancy in transaction B based on calls in transaction A? (Critical)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Integration] [Parallel Execution] Aptos uses Block-STM for parallel execution. Is each parallel transaction execution using a separate ReentrancyChecker instance, or can parallel transactions interfere with each other's reentrancy state? (Critical)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Integration] [Error Propagation] When functions return PartialVMResult errors (lines 72, 123, 158, 169), are these errors always propagated up to abort the transaction, or can some call sites swallow errors and continue execution? (High)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Integration] [StatusCode Consistency] Errors use StatusCode::RUNTIME_DISPATCH_ERROR at lines 88 and 180. Are VM error handlers properly distinguishing reentrancy errors from other runtime errors to prevent confusion in debugging? (Low)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [AIP-112 Compliance] [Resource Lock Mechanism] Lines 7-9 reference AIP-122 (likely meant AIP-112) for closure dispatch resource locking. Does the implementation correctly prevent ALL resource access on reentrancy, or are there edge cases? (Critical)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [AIP-73 Compliance] [Module Lock Mechanism] Lines 10-12 reference AIP-73 for native dispatch module locking. Does the implementation truly prevent ANY function call on reentrancy, or can certain call types bypass this? (Critical)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [AIP Mode Switching] [Mode Transition Logic] Lines 17-19 describe mode (1) and (2) with override behavior. Can an attacker exploit the transition between modes to perform actions that should be blocked in either mode? (High)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [AIP Compliance] [Specification Gap] The comment states mode (2) entails mode (1) at lines 13-15, but is this mathematical relationship formally verified, or can there be cases where (2) allows something that (1) blocks? (Medium)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Edge Case] [Script Execution] The code references 'module_or_script_id' implying scripts are supported. Do scripts have different reentrancy rules than modules, and can this be exploited? (High)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Edge Case] [Genesis Transaction] During genesis or special system transactions, are reentrancy checks enforced, or can these privileged contexts bypass checks allowing exploitable patterns? (High)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Edge Case] [Recursive Data Structures] If Move code uses recursive data structures that require multiple resource accesses during a single operation, can this trigger false positive reentrancy errors? (Medium)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Edge Case] [Module Upgrades] When a module is upgraded on-chain, does the InternedModuleId change? Can this cause counter inconsistencies if a function is entered before upgrade and exited after? (High)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Edge Case] [Empty Module] Can an attacker create an empty module with no code to bypass reentrancy checks, then use this as a trampoline for reentrant calls? (Medium)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Edge Case] [Maximum Nesting Depth] Is there a maximum call stack depth in the VM? If so, can an attacker reach this depth in a way that corrupts reentrancy counters or causes integer overflow? (Medium)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Concurrency] [No Synchronization] The struct has no Mutex, RwLock, or atomic operations. Is ReentrancyChecker guaranteed to be used in a single-threaded context, or can concurrent access cause data races? (Critical)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Concurrency] [HashMap Thread Safety] FxHashMap is not thread-safe. If multiple VM instances share checker state (e.g., in parallel execution), can this cause undefined behavior and memory corruption? (Critical)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Concurrency] [Counter Increment Atomicity] At lines 96, 112, and 155, counters are incremented with non-atomic operations. Can race conditions cause lost updates where multiple increments result in only one increment? (High)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Concurrency] [Check-Then-Act Pattern] Multiple functions use check-then-act patterns (e.g., lines 87-96, 159-161). Without synchronization, can these create TOCTOU vulnerabilities? (High)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Gas Metering] [No Gas Charging] The checker performs HashMap operations and counter manipulations but doesn't appear to charge gas. Can an attacker perform many enter/exit operations to consume VM resources without gas cost? (High)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Resource Exhaustion] [Unbounded Counter Growth] Counters can grow unbounded. Can an attacker cause memory exhaustion by entering modules in patterns that prevent counter cleanup? (Medium)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Resource Exhaustion] [HashMap Growth] The active_modules HashMap can grow unbounded. Can an attacker enter many distinct modules to exhaust memory and crash the validator? (High)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Memory Safety] [No Unsafe Code] The file contains no unsafe blocks. However, does it rely on unsafe code in LoadedFunction, InternedModuleId, or FxHashMap that could cause memory unsafety? (Medium)",
  "[File: aptos-core/third_party/move/move-vm/runtime/src/reentrancy_checker.rs] [Type Safety] [Phantom Types] Does InternedModuleId use phantom types or newtype patterns to prevent confusion with other ID types, or can IDs be mixed up causing logic errors? (Low)"
]