[
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Empty Struct Types] Can an attacker use empty struct types (structs with no fields) in key_type or value_type to create zero-byte keys that collide with other entries? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: RawTableItemRequest] [Unicode in Hex] Can Unicode characters or special encodings in the hex string of RawTableItemRequest.key bypass HexEncodedBytes validation? (Low)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Bool Key Edge Case] If key_type is 'bool', are there only two possible keys (true/false), or can JSON booleans be represented in multiple ways causing key mismatches? (Low)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Option Type Confusion] Can attackers exploit LEGACY_OPTION_VEC handling in type parsing to access optional table values in unexpected ways? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Resource Type Violation] Can TableItemRequest be used to read Move resources from tables as plain values, bypassing Move's resource safety guarantees? (Critical)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Ability Check Bypass] Does TableItemRequest validation check that types have the required abilities (copy, drop, store, key) for table operations? (High)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Generic Type Escape] Can unbound generic type parameters in key_type be used to access table entries with concrete types that shouldn't match? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Phantom Type Exploit] Can phantom type parameters in struct types be manipulated in TableItemRequest to bypass type-level access controls? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Field Order Dependency] Does the order of key_type, value_type, and key fields in TableItemRequest affect serialization or validation in a security-relevant way? (Low)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Default Values] Since TableItemRequest doesn't derive Default, can attackers exploit systems that expect default initialization? (Low)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: RawTableItemRequest] [Single Field Vulnerability] With only one field (key), can the simplicity of RawTableItemRequest be exploited for attacks that wouldn't work with TableItemRequest? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [OpenAPI Validation Bypass] Does the poem_openapi::Object derive add additional validation that could be bypassed or exploited? (Low)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: RawTableItemRequest] [OpenAPI Schema Mismatch] Can discrepancies between the OpenAPI schema for RawTableItemRequest and actual validation lead to accepting invalid requests? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Content-Type Confusion] Can attackers send TableItemRequest with mismatched Content-Type headers to bypass validation or cause deserialization errors? (Low)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Type Confusion Chain] Can an attacker chain type confusion in key_type with deserialization issues in value_type to achieve arbitrary table reads across type boundaries? (Critical)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest + RawTableItemRequest] [Consistency Attack] Can an attacker use TableItemRequest to probe for valid keys and then use RawTableItemRequest with raw bytes to bypass type safety? (High)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Recursive Type with Large Keys] Can combining deeply nested types in key_type with very large JSON key values multiply resource consumption to create an amplified DoS attack? (High)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Multi-Version Attack] Can sending the same TableItemRequest with different ledger_version values expose data consistency issues or enable TOCTOU attacks? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Function: TableItemRequest::verify()] [Insufficient Depth Check] Does verify() properly validate all nested components, or can deeply nested function types or reference chains bypass recursion limits? (High)",
  "[File: aptos-core/api/types/src/table.rs] [Function: TableItemRequest::verify()] [Module Existence Check] Does the verification process check if modules referenced in struct types actually exist, or can non-existent modules be specified? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Function: TableItemRequest::verify()] [Type Visibility Check] Does verify() enforce visibility rules for types (public vs private), or can private types be accessed through table queries? (Medium)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Cross-Module Table Access] Can TableItemRequest be used to access tables owned by different modules without proper authorization checks? (Critical)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [System Table Exposure] Can attackers use specially crafted TableItemRequests to read from system tables (e.g., validator sets, stake pools) that should be access-controlled? (Critical)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: RawTableItemRequest] [Account Resource Leak] Can RawTableItemRequest be abused to directly read account resources by constructing raw keys that match resource storage patterns? (Critical)",
  "[File: aptos-core/api/types/src/table.rs] [Struct: TableItemRequest] [Snapshot Isolation] Do TableItemRequests at specific ledger versions properly maintain snapshot isolation, or can concurrent writes cause inconsistent reads? (Medium)"
]