[
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Type confusion] Can an attacker craft malicious type arguments that pass the structure_from_ty_arg! macro check but reference incompatible algebraic structures, causing the match statement to select the wrong Structure variant and perform subtraction on mismatched curve elements? (Critical)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Type confusion] In the type argument assertion at line 28, can an attacker bypass the single type argument requirement by exploiting Move VM type system bugs to pass zero or multiple type arguments, leading to out-of-bounds access or undefined behavior? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Type confusion] Can malicious Move bytecode manipulate the ty_args slice during execution to inject a different Structure type between the structure_from_ty_arg! call at line 29 and the match statement at line 31, causing type confusion in cryptographic operations? (Critical)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Type confusion] Does the structure_from_ty_arg! macro properly validate that the TypeTag corresponds to a legitimate algebra structure, or can an attacker provide custom type tags (e.g., '0x1::fake_algebra::Fr') that parse successfully but lead to None in structure_opt, bypassing security checks? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Feature flag bypass] Can an attacker exploit race conditions in the abort_unless_arithmetics_enabled_for_structure! macro at line 30 to perform cryptographic operations after feature flags are disabled but before the check executes, causing unauthorized algebra operations? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Handle manipulation] In the ark_binary_op_internal! macro calls (lines 32-101), can an attacker provide handle values that exceed the AlgebraContext.objs vector length, causing out-of-bounds access despite the safe_borrow_element! macro checks? (Critical)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Handle manipulation] Can an attacker exploit integer overflow in handle casting from u64 to usize (in ark_binary_op_internal! macro) on 32-bit systems, causing handles to wrap around and reference unintended memory locations in AlgebraContext? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Use-after-free] If the same handle is provided for both operands in ark_binary_op_internal!, does the macro properly handle the Rc reference counting, or can the second safe_borrow_element! invalidate the first reference due to Rc::clone() semantics? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Handle reuse] Can an attacker reuse the same element handle multiple times in different subtraction operations to bypass memory limits, since safe_borrow_element! only borrows without consuming memory quota? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Type confusion] Does safe_borrow_element! in ark_binary_op_internal! properly validate that both handle_1 and handle_2 reference elements of the same arkworks type ($ark_typ), or can an attacker mix handles pointing to different types (e.g., BLS12381Fr and BN254Fr) within the same operation? (Critical)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Cryptographic correctness] For BLS12381Fr subtraction at lines 32-38, does the arkworks ark_bls12_381::Fr::sub() implementation properly handle modular reduction, or can subtraction of specific field elements cause underflow that wraps incorrectly modulo the BLS12-381 field order? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Cryptographic correctness] For BLS12381Fq12 subtraction at lines 39-45, can an attacker craft Fq12 elements where component-wise subtraction produces invalid results due to towering field structure inconsistencies in the Fq12 extension field? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Cryptographic correctness] For BLS12381G1 subtraction at lines 46-52, does the ark_bls12_381::G1Projective::sub() correctly handle point at infinity cases, or can subtracting a point from itself (P - P) result in an invalid representation rather than the proper identity element? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Cryptographic correctness] For BLS12381G2 subtraction at lines 53-59, can an attacker exploit coordinate system inconsistencies in projective coordinates where subtraction of equivalent points in different representations fails to produce the correct identity? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Semantic error] For BLS12381Gt subtraction at lines 60-66, the implementation uses div instead of sub - can an attacker exploit the fact that Gt group operations are multiplicative to cause confusion in smart contracts expecting additive semantics, potentially breaking cryptographic protocol implementations? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Cryptographic correctness] For BLS12381Gt at line 64, does the ark_bls12_381::Fq12::div() operation properly verify that the divisor is non-zero in the multiplicative group, or can division by the identity element cause undefined behavior or incorrect results? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Cryptographic correctness] For BN254Fr subtraction at lines 68-70, does the implementation correctly handle the different field order of BN254 compared to BLS12-381, or can edge cases near the field modulus cause incorrect modular arithmetic results? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Cryptographic correctness] For BN254Fq subtraction at lines 71-73, can an attacker exploit differences between Fr and Fq field orders in BN254 to cause confusion when Move contracts incorrectly substitute one for the other? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Cryptographic correctness] For BN254Fq12 subtraction at lines 74-80, does the extension field arithmetic properly handle the towering structure (Fq -> Fq2 -> Fq6 -> Fq12), or can specific element combinations cause incorrect subtraction due to implementation bugs in intermediate field operations? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Cryptographic correctness] For BN254G1 subtraction at lines 81-87, can subtracting points near the group order cause issues with projective coordinate normalization that lead to indistinguishable results for cryptographically distinct points? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Cryptographic correctness] For BN254G2 subtraction at lines 88-94, does the implementation properly handle the fact that G2 is defined over Fq2, and can coordinate component arithmetic produce incorrect results when subtracting points with specific Fq2 coordinate patterns? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Semantic error] For BN254Gt subtraction at lines 95-101, similar to BLS12381Gt, the use of div instead of sub for multiplicative group operations - can this semantic mismatch be exploited in zk-SNARK verification or pairing-based protocols that expect consistent group operation semantics? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Cryptographic correctness] For BN254Gt at line 98, does Fq12::div() properly compute multiplicative inverses in the cyclotomic subgroup, or can certain Gt elements cause incorrect division results that break pairing equation verification? (High)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Gas exhaustion] Can an attacker craft a sequence of subtraction operations that cause disproportionate gas consumption by exploiting differences in computational cost between different Structure types (e.g., Fq12 operations costing more than Fr operations) to grief the network? (Medium)",
  "[File: aptos-core/aptos-move/framework/src/natives/cryptography/algebra/arithmetics/sub.rs] [Function: sub_internal()] [Gas manipulation] Are the gas constants (ALGEBRA_ARK_BLS12_381_FR_SUB, ALGEBRA_ARK_BLS12_381_FQ12_SUB, etc.) properly calibrated to actual computational cost, or can an attacker exploit underpriced operations to perform expensive cryptographic computations at below-market rates? (Medium)"
]