[
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: RosettaContext::new()] [Currency Injection] Can an attacker inject malicious currencies into the supported_currencies HashSet parameter that bypass validation, allowing unauthorized token operations or fake currency creation? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: RosettaContext::new()] [Chain ID Spoofing] Can an attacker provide a mismatched chain_id that doesn't correspond to the actual network, causing cross-chain transaction replay attacks or state confusion between mainnet and testnet? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: RosettaContext::new()] [Currency Override] When currencies.insert(native_coin()) is called, can the native APT coin be overridden by a pre-existing malicious currency with the same symbol in the HashSet, leading to fund theft? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: RosettaContext::new()] [USDC Injection] Does the automatic USDC currency insertion based on chain_id.is_mainnet() and chain_id.is_testnet() properly validate the USDC addresses, or can an attacker manipulate chain_id to inject fake USDC currencies? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: RosettaContext::new()] [Multiple Currency Registration] Can the same currency be registered multiple times with different metadata, causing inconsistent balance calculations or double-spending opportunities? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: RosettaContext::rest_client()] [Offline Mode Bypass] Can an attacker bypass the NodeIsOffline error check by manipulating the Option<Arc<Client>> state, allowing operations that should be restricted in offline mode? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: RosettaContext::rest_client()] [Race Condition] Is there a TOCTOU (Time-Of-Check-Time-Of-Use) vulnerability where rest_client becomes None between the check and usage, leading to panic or inconsistent state? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: RosettaContext::rest_client()] [Client Replacement] Can the Arc<Client> be replaced mid-operation by another thread, causing requests to be sent to a malicious or incorrect endpoint? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: RosettaContext::block_cache()] [Cache Poisoning] Can an attacker manipulate the BlockRetriever cache to return fraudulent block data, leading to incorrect transaction history or balance calculations? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: RosettaContext::block_cache()] [Offline Mode Exploitation] Does returning NodeIsOffline when block_cache is None properly prevent all operations, or can certain API endpoints still access stale or unvalidated data? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: bootstrap()] [Runtime Poisoning] Can an attacker inject malicious code into the 'rosetta' named runtime that persists across requests, potentially compromising all subsequent API calls? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: bootstrap()] [Configuration Injection] Can malicious values in api_config be exploited to override security settings, such as disabling authentication or increasing resource limits to cause DoS? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: bootstrap()] [Client Validation Bypass] Is the rest_client parameter validated before being passed to bootstrap_async, or can a malicious Client implementation bypass security checks? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: bootstrap()] [Currency Set Tampering] Can the supported_currencies HashSet be modified between bootstrap() and bootstrap_async() calls, allowing unauthorized currencies to be added? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: bootstrap_async()] [Chain ID Validation Race] The chain_id assertion at lines 126-135 uses .expect(), which will panic - can an attacker trigger this panic condition to crash the Rosetta server and cause DoS? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: bootstrap_async()] [Ledger Information Poisoning] Can the ledger information retrieved from get_ledger_information() be manipulated by a compromised REST endpoint to provide false chain_id, bypassing the validation check? (Critical)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: bootstrap_async()] [Initialization TOCTOU] Between the chain_id validation and RosettaContext creation, can the rest_client be modified to point to a different chain, causing chain_id mismatch vulnerabilities? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: bootstrap_async()] [BlockRetriever Manipulation] Is the max_transactions_page_size from api_config properly validated, or can an attacker set it to extreme values (0 or MAX) causing memory exhaustion or DoS? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: bootstrap_async()] [Context Clone Safety] When context.clone() is called in routes, are there race conditions where the cloned context references stale or inconsistent data? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: bootstrap_async()] [Async Spawn Abuse] Can multiple concurrent calls to bootstrap_async() create resource exhaustion or race conditions in context initialization? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: routes()] [CORS Bypass] The CORS configuration uses .allow_any_origin() - can this be exploited to bypass same-origin policy and enable CSRF attacks against the Rosetta API? (High)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: routes()] [Route Order Attack] Can the order of route registration (account, block, construction, network, health_check) be exploited to bypass authentication or validation checks on specific endpoints? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: routes()] [Context Sharing Race] Since context.clone() is called multiple times for different route groups, can concurrent modifications to shared state cause race conditions or inconsistent responses? (Medium)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: routes()] [Method Restriction Bypass] Only GET and POST methods are allowed - can an attacker use other HTTP methods (PUT, DELETE, PATCH) to bypass security checks or access restricted functionality? (Low)",
  "[File: aptos-core/crates/aptos-rosetta/src/lib.rs] [Function: routes()] [Content-Type Validation] Is the CONTENT_TYPE header properly validated, or can attackers send malformed content types to bypass input validation or cause deserialization errors? (Medium)"
]