[
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Race to Replace] Between checking file_path validity in new() and writing in write(), can an attacker replace file_path with a symlink redirecting writes to attacker-controlled locations? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: new()] [Relative Path Exploitation] If file_path is relative, can an attacker change the process working directory to redirect key storage to unintended locations? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [Special File Access] Does File::open() validate that file_path is a regular file, or can it open special files (/dev/random, named pipes) causing hangs or unexpected behavior? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: new()] [Hard Link Attack] Can an attacker create hard links to the storage file, maintaining access to consensus keys even after the original file is deleted? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Mount Point Crossing] If file_path crosses mount point boundaries during fs::rename(), does the atomic rename guarantee break, causing partial data visibility? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: get()] [Timing Side Channel] Does get() take constant time regardless of whether the key exists, or can timing differences leak information about which consensus keys are stored? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [File Size Leakage] Can an attacker with filesystem access learn the number and size of stored keys by observing file_path size changes after set() operations? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: set()] [Timestamp Leakage] Does setting keys update file modification timestamps visible to other processes, leaking information about when consensus keys are rotated? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Cache Timing] Can an attacker with local access measure filesystem cache hits/misses to determine when consensus keys are being accessed during critical consensus operations? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: get()] [Error Timing] Do different error conditions (KeyNotSet vs SerializationError) have measurably different execution times that leak information about key storage structure? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: read()] [Allocation Pattern] Does allocating String and HashMap for deserialization create memory allocation patterns observable through side channels (timing, cache) revealing key structure? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: set()] [Serialization Timing] Does serde_json::to_value() execution time vary based on consensus key size/structure, leaking information about key types through timing analysis? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [IO Pattern Analysis] Can an attacker monitoring disk IO patterns (with blktrace) distinguish consensus key updates from other storage operations? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: get()] [Key Existence Oracle] Does the KeyNotSet error provide a reliable oracle for testing key existence, enabling attackers to enumerate all stored key names through repeated get() calls? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: available()] [Availability Leak] Even though available() returns Ok(()), can an attacker infer storage state by measuring subsequent operation latencies after availability checks? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: set()] [Key Rotation Race] During consensus key rotation, if set() is called for a new key while old key is being used, can the read-modify-write race cause both keys to be lost? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: get()] [Safety Rules Key Missing] If get() fails with KeyNotSet when loading CONSENSUS_KEY for safety rules, does this cause the validator to generate a new key, creating double-signing risk? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: write()] [Commit Atomicity] If validator crashes between writing new consensus keys and committing state to blockchain, can the key storage become inconsistent with on-chain validator registration? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: reset_and_clear()] [Accidental Key Deletion] If reset_and_clear() is called accidentally (bug, wrong config), does this permanently delete all consensus keys requiring validator re-registration and potential slashing? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: get()] [Epoch Transition Keys] During epoch transitions, can concurrent reads of old and new epoch keys cause validators to use wrong keys for signing, breaking consensus safety? (Critical)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: set()] [Backup Inconsistency] If file_path is included in validator backups, can restoring from backup cause validators to use old consensus keys inconsistent with current epoch? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: available()] [Silent Failure Mode] Since available() doesn't check actual file access, can validators operate with inaccessible storage until they need to sign, causing unexpected consensus participation failures? (Medium)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: new()] [Shared Storage Attack] If multiple validators accidentally share the same file_path on network storage, can they overwrite each other's keys causing consensus failures and potential slashing? (High)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Trait: CryptoKVStorage] [Empty Implementation] The CryptoKVStorage trait is implemented with no methods - does this mean cryptographic operations on stored keys lack additional security checks? (Low)",
  "[File: aptos-core/secure/storage/src/on_disk.rs] [Function: set()] [Key Version Confusion] Since the storage doesn't track key versions, can updating a consensus key during an epoch cause validators to use different key versions, breaking quorum? (High)"
]