[
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Struct: Type] [Type confusion] Can an attacker craft a malicious Type::Struct variant with mismatched type_actuals that violates generic type constraints, allowing type confusion attacks that bypass Move's resource safety guarantees? (Critical)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Struct: Type] [Reference safety] In the Type::Reference variant, can the bool mutability flag be manipulated to convert an immutable reference into a mutable one, enabling unauthorized state mutations and potential double-spending? (Critical)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Struct: Type] [Type parameter substitution] Does TypeParameter validation prevent attackers from substituting type parameters with incompatible types that lack required abilities, breaking resource safety invariants? (Critical)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Function: Type::reference()] [Reference mutability bypass] Can the reference() constructor be exploited to create references with incorrect mutability flags that bypass borrow checker validation during bytecode generation? (High)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Struct: Type] [Vector type validation] Does Type::Vector properly validate nested vector depth to prevent stack overflow during type checking or execution of deeply nested vector<vector<vector<...>>> structures? (Medium)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Struct: Type] [Signer type abuse] Can Type::Signer be constructed in contexts where it should be prohibited, allowing unauthorized signer injection and access control bypass in transaction validation? (Critical)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Enum: Type] [Integer type confusion] Can integer types (U8, U16, U32, U64, U128, U256) be confused through AST manipulation, leading to integer overflow/underflow when values are cast between incompatible sizes? (High)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Struct: Type] [Struct instantiation validation] When Type::Struct contains type_actuals, are the number and kinds validated against the struct definition to prevent type argument mismatch attacks? (High)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Enum: Ability] [Ability constraint bypass] Can an attacker manipulate BTreeSet<Ability> constraints to grant Copy ability to non-copyable resources, enabling resource duplication and double-spending? (Critical)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Enum: Ability] [Key ability exploitation] Can Key ability be removed from struct definitions that should be storable in global storage, allowing unauthorized resource extraction from accounts? (Critical)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Enum: Ability] [Store ability bypass] Can Store ability validation be circumvented to embed non-storable types inside structs that will be stored globally, causing state corruption? (High)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Enum: Ability] [Drop ability manipulation] Can Drop ability be added to resources that should never be dropped, allowing value destruction that violates resource conservation invariants? (Critical)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Type: StructTypeParameter] [Phantom type parameter] Does the phantom flag in StructTypeParameter prevent attackers from using phantom parameters to smuggle forbidden types through ability checks? (High)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Struct: StructDefinition_] [Native struct abuse] Can StructDefinitionFields::Native be exploited to declare arbitrary native structs without proper validation, bypassing Move's type safety guarantees? (Critical)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Function: StructDefinition_::move_declared()] [Field type validation] Does move_declared() validate that field types don't contain forbidden reference types that would violate storage invariants? (Critical)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Function: StructDefinition_::native()] [Native struct abilities] Can native() constructor be used to create native structs with arbitrary abilities that violate the invariants of VM-provided types? (High)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Struct: StructDefinition_] [Invariant validation] Are invariants in StructDefinition_ properly validated to prevent contradictory or unverifiable conditions that could cause prover failures? (Medium)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Struct: StructDefinition_] [Type formal validation] Can type_formals contain duplicate TypeVar names or conflicting ability constraints that cause ambiguity during type checking? (High)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Struct: StructDefinition_] [Recursive struct definition] Does the AST prevent self-referential or mutually recursive struct definitions that could cause infinite loops during type resolution? (Medium)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Type: Fields<Type>] [Field uniqueness] Are field names in Fields<Type> validated for uniqueness to prevent duplicate field definitions that could cause ambiguous field access? (High)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Struct: StructName] [Name collision] Can StructName symbols collide across different modules, allowing struct shadowing attacks that confuse type resolution? (High)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Struct: FunctionSignature] [Parameter validation] Does FunctionSignature validate that formal parameter names are unique to prevent parameter shadowing and assignment confusion? (High)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Struct: Function_] [Visibility bypass] Can FunctionVisibility::Friend be manipulated to grant friend access to modules not declared in the friends list, bypassing access controls? (Critical)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Struct: Function_] [Entry function validation] Does is_entry flag validation prevent attackers from marking private functions as entry points, exposing internal implementation to external callers? (High)",
  "[File: aptos-core/third_party/move/move-ir/types/src/ast.rs] [Struct: Function_] [Acquires validation] Can the acquires vector be manipulated to omit required struct names, allowing unprivileged borrowing of global resources without proper declaration? (Critical)"
]