[
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Scope Limitation] The file path includes 'coin_models' but processes all account transactions - if table items are commonly used for coin/token operations, does the missing table item tracking make this entire module incomplete for its intended purpose? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_event()] [Malformed Input] At line 91, event.guid.account_address.to_string() is passed to standardize_address without validation - if the API types allow malformed addresses, could this cause panics or SQL injection when inserting into account_transactions? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Address Validation] At line 105, write_resource.address.to_string() is not validated before standardization - if this contains SQL special characters or escape sequences, could it bypass parameterized queries and cause database injection? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_delete_resource()] [Address Validation] At line 129, delete_resource.address.to_string() is directly used - if malicious validators can inject delete resources with crafted addresses containing newlines or null bytes, could this corrupt the account_transactions table? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Signature Validation] At line 68, sig.signer is used directly without validation - if UserTransaction.get_signatures returns signatures with malformed or malicious signer addresses, will these be inserted into account_transactions, potentially causing query failures or security issues? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Object Validation] At line 110, ObjectWithMetadata.from_write_resource may deserialize arbitrary data - if this deserialization is exploitable (e.g., buffer overflow in BCS decoder), could malicious write resources cause indexer RCE? (High)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Memory Exhaustion] At line 64, a HashMap is allocated without size hint - if a malicious transaction has thousands of events and write set changes affecting different accounts, could this cause unbounded memory allocation and OOM crashes? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Loop Amplification] At lines 71-73 and 74-83, loops process all events and write set changes - can an attacker create a transaction with maximum allowed events/changes to amplify processing cost and cause indexer DoS? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_event()] [Allocation Overhead] At lines 92-95, a new HashMap is allocated for each event - if a transaction has thousands of events, will this cause excessive allocation/deallocation overhead and slow down indexing? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_write_resource()] [Nested Allocation] At lines 104 and 107, new HashMap is created and inserted into - for transactions with many write resources, could the nested HashMap allocations cause memory fragmentation and performance degradation? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [String Cloning] At lines 66, 68, 93, 107, and 131, account addresses are cloned multiple times - for large transactions, could this excessive string cloning cause performance issues or memory pressure? (Low)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Indexer Lag] If from_transaction takes too long to process a transaction with many account associations, could this cause the indexer to fall behind the chain, creating long-term lag that makes account_transactions data stale? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Indexer Crash Recovery] If the indexer crashes after from_transaction returns but before database commit, will reprocessing the transaction cause duplicate primary key violations, or does the database have upsert logic to handle this? (Medium)",
  "[File: aptos-core/crates/indexer/src/models/coin_models/account_transactions.rs] [Function: from_transaction()] [Checkpoint Inconsistency] If the indexer processes transactions out of order due to parallel execution, could account_transactions have gaps where transaction N+1 is indexed before transaction N, breaking sequential queries? (High)"
]