[
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: diffie_hellman()] [Small subgroup attack] Can an attacker provide a malicious public key that lies in a small order subgroup of Curve25519, causing the shared secret to be predictable or have reduced entropy, potentially compromising encrypted validator communications? (Critical)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: diffie_hellman()] [Invalid curve point] Does the function validate that the remote_public_key represents a valid point on the Curve25519 before performing the scalar multiplication, or can an attacker supply an off-curve point that leads to exploitable behavior? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: diffie_hellman()] [All-zero shared secret] Can an attacker craft a public key such that the Diffie-Hellman operation produces an all-zero shared secret (0x00...00), which could be trivially guessed if used directly for encryption keys without additional key derivation? (Critical)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: diffie_hellman()] [Low order points] Does the implementation check for and reject low-order public keys (order 1, 2, 4, 8) that would produce predictable shared secrets, potentially allowing an attacker to compromise secure channels between validators? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: diffie_hellman()] [Side-channel timing] Is the scalar multiplication in diffie_hellman() constant-time, or could timing variations leak information about the private key bits through network timing analysis of validator handshakes? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: diffie_hellman()] [Key reuse vulnerability] If the same PrivateKey is used for multiple diffie_hellman() calls with different public keys, can an attacker exploit key reuse to derive the private key through cryptanalysis? (Medium)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: diffie_hellman()] [Shared secret exposure] Does the function return the raw shared secret bytes directly without clearing them from memory afterward, potentially leaving sensitive key material in memory for extended periods vulnerable to memory dumps? (Medium)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: diffie_hellman()] [Identity element attack] Can an attacker send the identity element (point at infinity or equivalent) as their public key, causing the shared secret to reveal information about the victim's private key? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: from_ed25519_private_bytes()] [Clamping bypass] Does the validation at line 118 properly check that the expanded key matches X25519 clamping requirements, or can an attacker supply specially crafted Ed25519 keys that bypass clamping and produce weak X25519 keys? (Critical)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: from_ed25519_private_bytes()] [Non-canonical scalar] The check at line 118 compares bytes after conversion - can this validation be bypassed by supplying Ed25519 keys whose expanded form produces non-canonical X25519 scalars that still pass byte comparison but have cryptographic weaknesses? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: from_ed25519_private_bytes()] [Partial key exposure] Does converting an Ed25519 private key to X25519 format (lines 108-123) leak information about the original Ed25519 signing key through the derived X25519 key, enabling cross-protocol attacks? (Critical)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: from_ed25519_private_bytes()] [Expanded key truncation] The function extracts only the first 32 bytes of the expanded key (line 114) - can an attacker exploit the discarded second half to derive the original Ed25519 key if they obtain the X25519 key? (Medium)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: from_ed25519_private_bytes()] [Key material leakage] Does the temporary expanded_keypart buffer at line 113 get properly zeroed after use, or does it leave sensitive key material in memory that could be extracted through memory analysis? (Medium)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: from_ed25519_private_bytes()] [Double key usage vulnerability] The documentation warns against double usage of keys under several schemes (line 107) - but does the implementation enforce any restrictions to prevent validators from using the same key for both Ed25519 signatures and X25519 key exchange? (Critical)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: from_ed25519_private_bytes()] [Invalid Ed25519 key acceptance] If the Ed25519 key deserialization succeeds at line 109 but produces a weak/invalid key, will it still be converted to X25519 format without proper validation? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: from_ed25519_private_bytes()] [Clamping verification logic] The clamping check at line 118 compares byte slices - is this comparison sufficient to detect all non-compliant X25519 keys, or can subtle differences in scalar representation bypass this check? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: from_ed25519_public_bytes()] [Invalid point decompression] If the EdwardsY decompression at line 141-143 fails and returns None, could an attacker supply public keys that pass the length check but fail decompression in a way that causes panic or undefined behavior? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: from_ed25519_public_bytes()] [Montgomery conversion weakness] Does the to_montgomery() conversion at line 145 properly handle edge cases like the identity point or low-order points that could result in weak X25519 public keys? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: from_ed25519_public_bytes()] [Cross-protocol key confusion] Can an attacker provide an Ed25519 public key that converts to a valid but predictable X25519 public key, enabling them to pre-compute shared secrets or impersonate validators? (Critical)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: from_ed25519_public_bytes()] [Length validation bypass] The length check at line 138 only verifies 32 bytes - can an attacker exploit this by providing exactly 32 bytes of invalid data that passes length validation but causes issues in subsequent operations? (Medium)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: from_ed25519_public_bytes()] [Torsion point inclusion] After Montgomery conversion, does the resulting X25519 public key contain torsion components that could leak information about private keys during Diffie-Hellman operations? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: from_ed25519_public_bytes()] [Small subgroup validation] Does the function validate that the converted X25519 public key is not in a small subgroup before returning it, or can attackers inject small-order public keys? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: public_key()] [Weak private key handling] If the PrivateKey (self.0) contains all zeros or another weak value, does public_key() still derive a public key that appears valid but is actually predictable? (High)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: public_key()] [Base point multiplication] The conversion at line 86 performs scalar multiplication with the base point - are there any private key values that produce low-order public keys that could compromise security? (Medium)",
  "[File: aptos-core/third_party/move/move-examples/diem-framework/crates/crypto/src/x25519.rs] [Function: public_key()] [Deterministic derivation] Is the public key derivation truly deterministic, or could race conditions or uninitialized memory cause the same private key to produce different public keys in different contexts? (High)"
]