[
  "[File: config/global-constants/src/lib.rs] [adjust_gas_headroom] [Floating point contamination] Although the function uses integer math, can compiler optimizations introduce floating-point operations that cause non-deterministic rounding, violating consensus requirements? (High)",
  "[File: config/global-constants/src/lib.rs] [Gas constants] [Time-based attacks] Can attackers exploit timing differences in gas calculation to determine validator hardware capabilities, then target slower validators with specifically crafted transactions to cause consensus delays? (Medium)",
  "[File: config/global-constants/src/lib.rs] [CONSENSUS_KEY, OWNER_ACCOUNT] [Storage backend attacks] Do the hardcoded constant names prevent proper key derivation or hierarchical storage structures, forcing all validators to use the same storage keys and enabling cross-validator storage attacks? (High)",
  "[File: config/global-constants/src/lib.rs] [SAFETY_DATA, WAYPOINT] [Backup/restore vulnerability] Can attackers exploit the global constant names during backup/restore operations to inject malicious data that appears valid but contains backdoors? (High)",
  "[File: config/global-constants/src/lib.rs] [All storage constants] [Access control bypass] Do the simple string constants lack namespace or authentication information, allowing unauthorized processes to read sensitive validator data from secure storage? (Critical)",
  "[File: config/global-constants/src/lib.rs] [Line 21: TODO comment] [Unverified constants] The TODO comment 'double check if this right' for gas constants indicates potential uncertainty - can attackers exploit incorrect gas values if this verification was never completed, leading to economic or consensus vulnerabilities? (Medium)",
  "[File: config/global-constants/src/lib.rs] [Gas constants with TODO] [Technical debt exploitation] Does the unresolved TODO comment indicate untested edge cases in gas calculations that attackers could exploit to bypass gas limits or cause validator crashes? (Medium)",
  "[File: config/global-constants/src/lib.rs] [All constants] [Const evaluation attack] Can attackers exploit Rust's const evaluation to inject malicious code that executes during compilation, modifying global constants before deployment? (High)",
  "[File: config/global-constants/src/lib.rs] [Conditional compilation] [Build-time injection] Can supply chain attacks on the build system inject malicious feature flags to enable test mode in production, setting GAS_UNIT_PRICE to 0 and enabling unlimited free transactions? (Critical)",
  "[File: config/global-constants/src/lib.rs] [All constants] [Linker manipulation] Can attackers modify object files during linking to replace constant values without changing source code, bypassing code review and deploying backdoored validators? (Critical)",
  "[File: config/global-constants/src/lib.rs] [All pub constants] [Excessive visibility] Does declaring all constants as 'pub' allow external crates to read and potentially misuse these values, or could malicious dependencies exploit access to these constants for attacks? (Low)",
  "[File: config/global-constants/src/lib.rs] [Constant mutation] [Unsafe modification] Although Rust constants are immutable, can unsafe code blocks in other modules transmute or otherwise modify these values at runtime, causing validator misbehavior? (High)",
  "[File: config/global-constants/src/lib.rs] [adjust_gas_headroom] [Zero gas handling] When gas_used is 0, does adjust_gas_headroom return 0 or apply headroom anyway, and can this behavior be exploited to bypass gas checks for empty transactions? (Low)",
  "[File: config/global-constants/src/lib.rs] [adjust_gas_headroom] [Maximum gas edge case] When gas_used equals max_possible_gas, does the function correctly handle the boundary condition, or can off-by-one errors allow transactions to exceed limits? (Medium)",
  "[File: config/global-constants/src/lib.rs] [adjust_gas_headroom] [Underflow protection] Is there proper validation that gas_used and max_possible_gas are non-negative (u64 is unsigned, but can conversion from signed types cause issues)? (Low)",
  "[File: config/global-constants/src/lib.rs] [Gas constants] [Move VM inconsistency] Can discrepancies between these global gas constants and Move VM's internal gas accounting cause transaction validation to pass in simulation but fail in execution, wasting user funds? (Medium)",
  "[File: config/global-constants/src/lib.rs] [MAX_GAS_AMOUNT] [Script complexity attack] Can attackers write Move scripts that consume exactly MAX_GAS_AMOUNT while performing malicious operations (like reading entire state or spawning many resources), evading detection? (Medium)",
  "[File: config/global-constants/src/lib.rs] [GAS_UNIT_PRICE] [Gas schedule mismatch] If Move VM's gas schedule is updated but GAS_UNIT_PRICE remains fixed, can this mismatch cause transaction fee calculations to be incorrect, leading to economic attacks? (Medium)",
  "[File: config/global-constants/src/lib.rs] [SAFETY_DATA] [Safety rule bypass] Can attackers exploit the global SAFETY_DATA constant to clear or corrupt validator safety rules, allowing double-signing attacks that violate AptosBFT safety? (Critical)",
  "[File: config/global-constants/src/lib.rs] [SAFETY_DATA] [Vote history manipulation] Can malicious validators modify the safety data storage using the global constant to erase evidence of previous votes, enabling equivocation without detection? (Critical)",
  "[File: config/global-constants/src/lib.rs] [CONSENSUS_KEY] [Signature key substitution] Can attackers exploit the CONSENSUS_KEY constant to substitute validator signing keys in secure storage, causing honest validators to sign with attacker-controlled keys? (Critical)",
  "[File: config/global-constants/src/lib.rs] [Gas constants] [Network partition via gas] Can attackers exploit differences in gas constants across network partitions to cause validators on different sides of a partition to produce incompatible blocks, preventing reconciliation? (Critical)",
  "[File: config/global-constants/src/lib.rs] [WAYPOINT] [Fork attack via waypoint] Can attackers distribute different waypoint values to different validators using the global constant, causing permanent network fork that cannot be resolved? (Critical)",
  "[File: config/global-constants/src/lib.rs] [All storage constants] [Database corruption] Can attackers craft storage operations using these global constant names to corrupt underlying databases, causing validator crashes or data loss? (High)",
  "[File: config/global-constants/src/lib.rs] [SAFETY_DATA, WAYPOINT] [Crash recovery vulnerability] During crash recovery, can attackers inject malicious data using these global constants to compromise validator state, causing Byzantine behavior after restart? (High)"
]