[
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: set_raw_image_uri()] [Missing cascade] When raw_image_uri changes, should cdn_image_uri and image_optimizer_retry_count be automatically reset, or can outdated CDN URLs remain associated with new raw URIs? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: set_raw_animation_uri()] [Retry count inconsistency] If raw_animation_uri is updated to a new URL, should animation_optimizer_retry_count be reset to 0, or can stale retry counts cause the new animation to be incorrectly marked as already-failed? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: set_asset_uri()] [Length limit] Is there a maximum length enforced on asset_uri before database insertion, or can extremely long URIs (megabytes) cause database errors, query timeouts, or memory exhaustion? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: set_raw_image_uri()] [URI scheme validation] Are dangerous URI schemes (file://, ftp://, gopher://) blocked in raw_image_uri, or can these be stored and later trigger SSRF vulnerabilities when the crawler fetches the resource? (High)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: set_cdn_json_uri()] [Domain restriction] Should CDN URIs be restricted to trusted CDN domains, or can arbitrary domains be set, allowing attackers to redirect metadata queries to malicious endpoints? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: set_cdn_image_uri()] [Protocol validation] Are only HTTPS URIs allowed for CDN fields, or can HTTP URIs be stored, creating downgrade attack vectors where attackers can MITM unencrypted metadata requests? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: increment_json_parser_retry_count()] [Unbounded retries] If there's no max retry check in this function, can an asset with a permanently broken JSON URI be retried infinitely, wasting system resources? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: increment_image_optimizer_retry_count()] [Retry bomb] Can an attacker create many NFTs with intentionally broken image URIs that cause the optimizer to retry repeatedly, creating a resource exhaustion attack on the crawler service? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: reset_json_parser_retry_count()] [Retry reset abuse] Can reset_json_parser_retry_count() be called inappropriately to bypass max retry limits, allowing permanently failing assets to be retried indefinitely? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: get_json_parser_retry_count()] [Missing max check] Does the getter return the raw count without any maximum enforcement, requiring all calling code to independently check retry limits and creating opportunities for bypass if checks are missed? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Diesel table mapping] Does the diesel(table_name) attribute correctly map to the database schema, or can mismatches cause silent data corruption where fields are written to wrong columns? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Primary key update] Can Diesel operations that update the primary key (asset_uri) cause referential integrity violations if other tables have foreign key constraints to this table? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Bulk insert] During bulk insert operations with Diesel, can constraint violations on one record cause the entire batch to fail, or are transactions properly scoped to allow partial success? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Deep clone cost] Does the Clone trait implementation perform deep clones of all String fields, and can this be exploited to cause performance degradation when many ParsedAssetUris instances are cloned? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Clone isolation] After cloning a ParsedAssetUris instance and modifying retry counts, can confusion arise about which instance represents the current database state, leading to incorrect database updates? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Public fields] Are all fields meant to be publicly readable via the Serialize trait, or does this expose internal implementation details like retry counts that should be private? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [API injection] If ParsedAssetUris is serialized and exposed via REST API, can malicious URI values containing script tags cause XSS when displayed in web frontends consuming the API? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: set_last_transaction_version()] [Monotonicity] Is there any enforcement that last_transaction_version monotonically increases, or can it be set to arbitrary values causing temporal ordering violations? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: get_last_transaction_version()] [Zero version] Does returning 0 for new records create issues when comparing against actual blockchain transaction version 0, potentially causing the crawler to think genesis transactions have already been processed? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [No validation] Are there any validation methods (e.g., is_valid_uri(), is_max_retries_reached()) that should exist but are missing, forcing validation logic to be scattered across calling code? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Invariant checks] Are there struct invariants (e.g., retry counts must be non-negative, version must be positive) that should be enforced but aren't, allowing invalid states to exist? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: get_asset_uri()] [No immutability] Does returning a cloned String prevent external modification, but the set_asset_uri() function allows unrestricted changes to the primary key after construction? (Medium)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Function: set_do_not_parse()] [Missing audit trail] When do_not_parse is set to true, is there any logging or audit trail of who set it and why, or can assets be silently blacklisted without accountability? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Multiple functions] [Excessive warnings] Do the multiple warn! calls in getter functions trigger for every field access, potentially creating log spam and I/O bottlenecks when processing large NFT collections? (Low)",
  "[File: aptos-core/ecosystem/nft-metadata-crawler/src/models/parsed_asset_uris.rs] [Struct: ParsedAssetUris] [Memory footprint] With multiple String and Option<String> fields, can a large number of ParsedAssetUris instances in memory cause excessive heap fragmentation and allocation overhead? (Low)"
]