[
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Generic Type: D] [Weak hash acceptance] The type constraint D::OutputSize: IsGreaterOrEqual<DMinimumSize, Output = True> at line 104 only enforces 32-byte minimum - can an attacker instantiate HKDF with a 32-byte hash that has known collision or preimage vulnerabilities, compromising key derivation security? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Constant: DMinimumSize] [SHA256 vs SHA1] While SHA1 is blocked by the 32-byte minimum at line 88, can an attacker use SHA256 or SHA3-256 with known length-extension weaknesses in contexts where HMAC doesn't fully mitigate those attacks? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Generic Type: D] [Hash function substitution] Is there runtime validation that the hash function D matches expected algorithms (SHA256/SHA512/SHA3-256), or can an attacker compile custom Aptos binaries with weak custom hash functions satisfying the type constraints but lacking security properties? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: extract_no_ikm_check()] [Hash state manipulation] At line 125, hkdf::Hkdf::<D>::extract() is called - can an attacker corrupt the hash function state D through malformed inputs causing non-deterministic output, breaking consensus when different validators derive different keys? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: expand()] [Hash collision exploitation] If the underlying hash function D experiences collision attacks, can an attacker find PRK and info values that collide, allowing them to derive the same output keys for different input contexts, compromising validator identity separation? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: extract()] [Error suppression] When extract() returns Err(HkdfError::InvalidSeedLengthError) at line 119, is this error properly propagated and handled by callers, or can error suppression allow weak keys to be used in critical validator signing operations? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: expand()] [Panic on large length] Does the vec![0u8; length] allocation at line 140 panic on very large length values instead of returning an error, potentially crashing validator nodes during key derivation and causing loss of liveness? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: expand()] [Error mapping loss] The map_err conversions at lines 139 and 143 may lose underlying error details - can this obscure root causes of key derivation failures during security incidents, hindering forensics after consensus failures or key compromise? (Medium)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Enum: HkdfError] [Insufficient error granularity] HkdfError only has 4 variants - does this provide enough detail to distinguish between attacker-induced errors vs legitimate failures, potentially allowing attackers to probe for vulnerabilities through error oracle attacks? (Low)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: extract_then_expand()] [Error propagation order] If extract() succeeds at line 154 but expand() fails at line 155, is the intermediate PRK properly cleared from memory on the error path, or does it leak sensitive key material? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: expand()] [Key material in heap] The okm vector at line 140 allocates derived key material on the heap - is this properly zeroed after use, or can memory dumps from compromised validator nodes recover private keys even after they've been consumed? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: extract()] [Timing side channel] Does the ikm.len() < MINIMUM_SEED_LENGTH comparison at line 118 execute in constant time, or can timing differences leak information about seed length to attackers monitoring validator node timing behavior? (Medium)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: extract_no_ikm_check()] [PRK copy overhead] At line 126, arr.to_vec() creates a heap copy of the PRK - does this introduce additional memory locations where PRK remains uncleared, expanding the attack surface for memory scraping? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: expand()] [Cache timing attacks] Can an attacker use cache timing side channels during the hkdf.expand() operation at line 141 to extract bits of the PRK or derived keys by observing cache access patterns on validator nodes? (Medium)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: extract()] [Branch prediction leakage] Do the error path branches (lines 119-120) leak timing information through branch prediction that could reveal seed characteristics to attackers with local access to validator hardware? (Low)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: extract_then_expand()] [Master key derivation] When deriving hierarchical validator keys, can an attacker who compromises one derived key work backwards to recover the master seed due to insufficient PRK protection or weak expand operations? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: extract_then_expand_no_ikm()] [Noise protocol weakness] The extract_then_expand_no_ikm() function at line 165 is used for Noise protocol - can an attacker exploit the missing ikm to break forward secrecy in validator-to-validator encrypted channels, allowing decryption of past session traffic? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: extract()] [DH key derivation] When deriving keys from Diffie-Hellman shared secrets as ikm, does extract() properly handle weak DH outputs (e.g., small subgroup elements) that could result in predictable PRKs compromising session security? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: expand()] [BIP32-style derivation] The documentation mentions BIP32-like hierarchical derivation at line 50 - can an attacker exploit missing hardened derivation paths to compute child validator keys from parent keys without authorization? (Critical)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: extract_then_expand()] [Entropy combination weakness] When combining multiple entropy sources as described at line 27, can an attacker who controls one entropy source (e.g., /dev/urandom on compromised systems) poison the final derived keys despite other sources having good entropy? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Struct: Hkdf] [Shared state corruption] The Hkdf struct at line 99 uses PhantomData - if multiple threads simultaneously call HKDF operations with shared underlying hash state, can race conditions in the digest crate cause non-deterministic outputs breaking consensus? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: expand()] [Concurrent PRK usage] If the same PRK is used concurrently by multiple threads calling expand() with different info values, can race conditions in from_prk() or expand() cause output corruption or key material mixing? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: extract()] [Non-atomic seed read] If the ikm slice is backed by memory being concurrently modified, can TOCTOU (time-of-check-time-of-use) issues between the length check at line 118 and extract_no_ikm_check() call at line 121 cause security violations? (Medium)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Function: extract_then_expand()] [PRK lifetime overlap] At line 154-155, the PRK lifetime spans two function calls - can concurrent memory allocation in other threads cause the PRK to be paged out to swap or written to disk on validator nodes? (High)",
  "[File: aptos-core/crates/aptos-crypto/src/hkdf.rs] [Generic Type: D] [Hash state races] Does the Clone constraint on D at line 101 properly deep-copy all hash state, or can shallow copying cause multiple HKDF instances to share mutable state leading to output corruption under concurrent use? (High)"
]